{
    "countries": [
        "United States"
    ],
    "description": "It's Christmas time, but all is not well in the world of Everly (Salma Hayek). A call girl by trade, Everly has turned against her gangster boss Taiko (Hiroyuki Watanabe) and become a police informant. In response, Taiko has put out a hit on Everly and her family. Soon, every criminal in town wants to cash in. Everly's survival instincts quickly kick in as she matches wits and firepower with Taiko and a seemingly endless stream of killers.\n\nJoe Lynch is best known as the director of films such as WRONG TURN 2 and KNIGHTS OF BADASSDOM. With EVERLY, Lynch—working from a screenplay by Yale Hannon—sets off in a very different direction from his prior works. Displaying a diverse array of influences—particularly the cinema of Takashi Miike—he delivers a stylish pulpy action film with a massive body count and a whole lot of black humor. EVERLY mostly takes place within the confines of the titular character's apartment but the film never seems constrained by physical space. Instead, it unfolds at a relentless pace as Lynch unleashes surprise after violent surprise upon the viewer.\n\nSalma Hayek dominates the screen with an intense physical performance that makes one wonder why she isn't cast as a lead in more action movies. In addition to meeting the physical demands of the role, Hayek brings serious pathos and sympathy to the film's heroine. EVERLY is a furious dose of fist-pumping action that will leave the audience cheering. (Rodney Perkins)\n\nJoe Lynch (Co-Writer/Director), Adam Ripp (Producer), Luke Rivett (Producer), Ricky Budhani (Executive Producer), Brett Hedblom (Co-Producer), Andrew Pfeffer (Producer)",
    "directors": [
        "Joe Lynch"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/everly"
    },
    "runtime": 92,
    "synopsis": "Salma Hayek stars as a tough yet vulnerable woman who must fight her way through a gauntlet of assassins in this fist-pumping action thriller.",
    "title": "Everly",
    "year": 2014
}