{
    "countries": [
        "United States"
    ],
    "description": "In the opening scene, Ig (Radcliffe) foreshadows, \"When you go through Hell, the only way out is to walk deeper through the fire.\" Since he's been unanimously accused of raping and murdering his longtime girlfriend Marren (Juno Temple, seemingly named from the EXORCIST priest), Ig can only wonder how much deeper into the fire he can go. He wakes up one morning with horns growing from his head and strange new powers, including the ability to have anyone tell them their darkest truths (\"I've never been with a jigaboo before,\" a neighbor says). Ig also has the skill to make them act on these desires. He's initially appalled by this development, but the opportunity to use these powers to find out the truth in Marren's death is a dance with the devil that's too good to pass up.\n\nHORNS skillfully navigates several genres and themes: fantasy, religious drama, detective mystery, and it takes the basic structure one sees in superhero origin stories. Aja does a strong job combining all of this, but the heart and backbone of HORNS is a love story. Ig is hellbent on finding who murdered the love of his life while his community is out to lynch him for the very crime that destroyed him. Many flashbacks are given to Ig and Marren, which scope out their entire relationship, elevating the film beyond its dark nature. She was his Garden of Eden, and that drives everything about the film.\n\nWith three superstars behind it—actor Daniel Radcliffe, director Alex Aja and novelist Joe Hill—HORNS is one of the genre event films of 2014. (James Shapiro)\n\n \n\nAlexandre Aja (Director)",
    "directors": [
        "Alexandre Aja"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/horns"
    },
    "runtime": 120,
    "synopsis": "Daniel Radcliffe stars as Ig, who after being accused of murdering his girlfriend, awakens one morning to discover new powers and devil horns growing from his head. Adapted by Alexandre Aja (HIGH TENSION; PIRANHA) from Joe Hill's novel.",
    "title": "Horns",
    "year": 2014
}