{
    "countries": [],
    "description": "Directors Noboru Iguchi, Yoshihiro Nishimura, Marcel Sarmiento, Jon Schnepp, Ernesto Diaz Espinosa, Adrian Garcia Bogliano, Ti West, Yudai Yamaguchi and Thomas Malling LIVE in attendance!\n\n\n \n\n\nTwenty-six directors. Twenty-six ways to die. And now...it's finally here! Featuring a heavy-hitting lineup of Fantastic Fest alumni, THE ABC'S OF DEATH will make its long-awaited debut in what promises to be one of the biggest events in the history of the festival! Inspired by old-timey children's alphabet primers, this anthology—the most ambitious ever produced—assigns one letter and one method of death each to 26 leading filmmakers, from 15 different countries. Given free creative reign and a fixed budget to design whatever method of death they liked, the resulting films are hilarious, viscerally shocking, ridiculous, and incredibly original, with nearly every inappropriate subject you can imagine. Baby death? Got it. Genital trauma? Sure.\n\n\n\nMass murder? Definitely. Animal abuse? Uh-huh. Dismemberment? Oh, yeah. Nudity? More than you probably want to see. Child abuse? Of course! Defecation? Just a wee bit. Plus...Nazis, serial killers, insects, earthquakes, monsters, arterial blood-sprays, robots, samurai, and more toilets than should probably be in any one movie. And the filmmaking styles? Everything you could hope for: animation, slow motion, fast motion, first-person storytelling, heavy dialogue, dialogue-free, furry cosplay and everything in-between. You will not find a wilder, more diverse, vibrant and exciting collection of films on a film festival program this year.\n\n\n\nWe're extremely excited to unveil our new baby on our home turf, since it's the first original project Drafthouse Films has ever co-produced, along with partners Magnet Releasing and Timpson Films. Join us in the dark, grab a beverage, and prepare to learn your alphabet all over again. THE ABC'S OF DEATH is intended to be a shocking, over-the- top roller coaster ride of a movie, and a truly international project, bringing to the world the best of genre filmmaking with all boundaries removed and sick, twisted creativity given free reign. We hope you like it. And we hope you teach your children about it, too. (Marc Walkow)",
    "directors": [
        "Kaare Andrews",
        "Ernesto Díaz Espinoza",
        "Angela Bettis",
        "Jason Eisener",
        "Bruno Forzani",
        "Héléne Cattet",
        "Adrián García Bogliano",
        "Xavier Gens",
        "Lee Hardcastle",
        "Jorge Michel Grau",
        "Noboru Iguchi",
        "Thomas Malling",
        "Yoshihiro Nishimura",
        "Banjong Pisathanakun",
        "Simon Rumley",
        "Marcel Sarmiento",
        "Jon Schnepp",
        "Srdjan Spasojevic",
        "Timo Tjahjanto",
        "Andrew Traucki",
        "Nacho Vigalondo",
        "Jake West",
        "Ti West",
        "Ben Wheatley",
        "Adam Wingard",
        "Yudai Yamaguchi"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/abcs-of-death"
    },
    "runtime": 123,
    "synopsis": "Twenty-six directors. Twenty-six ways to die. Co-produced by Drafthouse Films, and finally ready to be unleashed—see what happens when you give more than two dozen of the most brilliant filmmakers from around the world free reign to indulge their creative impulses and black humor. From A to Z, it's got something for every genre fan and is like nothing you've ever seen before.",
    "title": "The Abc's of Death",
    "year": 2012
}