{
    "countries": [],
    "description": "Directors Jen and Sylvia Soska and actors Tristan Risk and Katie Isabelle LIVE in attendance!\n\n\n \n\n\nMary Mason appears to be on the verge of achieving the American Dream. Young, beautiful and intelligent, Mary is sailing through medical school with the aim of becoming a surgeon. There's no doubt at all she's got the skills to get there. The question is whether she has the cash. Perpetual debt and the questionable behavior of the teachers she idolizes and emulates combine to leave Mary disillusioned and questioning her path through life.\n\n\n\nThen a very unusual opportunity arises, one that will pay her very well, indeed, to indulge her growing skills provided she is willing to set aside certain ethical considerations. So Mary plunges into a world of underground surgeries and extreme body modification.\n\n\n\nCanadian twin directors Jen and Sylvia Soska made waves on the genre circuit a few years ago with their debut micro-budget feature, a grindhouse throwback titled DEAD HOOKER IN THE TRUNK that won the duo high profile fans around the world including Eli Roth. If DEAD HOOKER showed raw talent, then follow up AMERICAN MARY shows the results of that talent beginning to come of age. A major step forward in every respect, AMERICAN MARY features a stellar central performance from GINGER SNAPS star Katharine Isabelle as the titular Mary, drawn into this increasingly bizarre world. To bring that world to life the Soskas – better known as The Twisted Twins – descended into the body modification underground of Canada's west coast, bringing the results to the screen without the use of any CGI. (Todd Brown)",
    "directors": [
        "Jen Soska",
        "Sylvia Soska"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/american-mary"
    },
    "runtime": 95,
    "synopsis": "Disillusioned with her chosen profession and perpetually broke, medical student Mary Mason finds herself drawn into a shady world of underground surgery and body modification.",
    "title": "American Mary",
    "year": 2011
}