{
    "countries": [],
    "description": "Director Brandon Cronenberg and actor Caleb Landry Jones LIVE in attendance!\n\nThe Lucas Clinic exists to serve – or prey upon, depending upon your perspective – the most celebrity obsessed elements of our society. Striking exclusive deals with major celebrities to harvest their illnesses, the Clinic offers a most intimate communion between the famous and their admirers. For a price you can be infected with the very same viruses that grew within their very cells. What was part of them can be part of you.\nSyd March is an up and comer within Lucas, a salesman adept at capitalizing on patients' yearning for connection. He'll tell you exactly what you want to hear as he injects herpes into your lip or influenza into your veins. But Lucas isn't enough for Syd. Whether for boredom or greed Syd is playing both sides of this particular game, peddling Lucas' wares by day but also infecting himself with their most rare and elusive offering so that he can incubate them within his own body, break the patented copy protection and sell them on the black market. So when he sees the opportunity to harvest a new virus from the famed Hannah Geist – Lucas' top seller – Syd sees a chance to profit and injects himself with Hannah's blood. And then Hannah dies.\nBrandon Cronenberg makes his feature debut with ANTIVIRAL, a film that would do his father David proud. A jet black satire of celebrity obsession run through with enough needles and body fluids to make even the most hardened squirm, ANTIVIRAL is an icily precise affair. Star Caleb Landry Jones (THE LAST EXORCISM, X-MEN: FIRST CLASS) delivers a mesmerizing performance as the inscrutable March, his physical breakdown as the virus takes hold an alarming yet compelling sight to behold. (Todd Brown)",
    "directors": [
        "Brandon Cronenberg"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/antiviral"
    },
    "runtime": 110,
    "synopsis": "Syd March makes people sick, infecting them with viruses harvested to order from celebrities, but gets more than he bargained for when his most famous source dies from a virus Syd has just infected himself with.",
    "title": "Antiviral",
    "year": 2012
}