{
    "countries": [],
    "description": "Jos is about to have a very bad day. He knows this because he has just woken up with a splitting headache, a big blank where his previous days' memories should be, a gun beneath his pillow and an unrecognizable corpse in bed next to him. There are, of course, also the gangsters who insist he has twenty kilograms of their cocaine, cocaine Jos neither remembers nor has in his possession. And, oh yes, there's also the small matter of his fiancé calling to remind him of the final errands that need running before their wedding the next morning.\n\nJos is an ex-con who may not be quite so ex after all and if he can't sort it all out within the next twenty four hours, his past life is going to spill out all over his future life with potentially deadly consequences.\n\nDutch director Arne Toonen takes a hard left turn with his sophomore feature – his first was a family comedy – delivering BLACK OUT, a brash and energetic crime caper. Laced with colorful characters, blue collar working class criminals and outbursts of extreme violence, BLACK OUT stands as a sort of Dutch response to Guy Ritchie.\n\nLeading man Raymond Thiry brings a rumpled elegance and intelligence to the role of Jos – intelligence he'll need if he's going to sort out what's really going on here and avoid being killed by his ballet-trained gangster nemesis. The entire cast is made up of solid industry veterans clearly loving the chance to get out and flex their muscles in something a bit different – acclaimed director Alex Van Warmerdam (GRIMM, WAITER) even gets in on the fun – and the solid cast makes all the difference, bringing a healthy dose of substance to Toonen's abundance of style (Todd Brown).",
    "directors": [
        "Arne Toonen"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/black-out"
    },
    "runtime": 89,
    "synopsis": "A splitting headache, a dead gangster, twenty kilos of missing coke and 24 hours to sort it all out before getting married. Jos is about to have a very bad day.",
    "title": "Black Out",
    "year": 2012
}