{
    "countries": [],
    "description": "Director Ernesto Diaz LIVE in attendance! \n\n \n\nSantiago Fernandez is an aimless young man content with spending hours on the couch playing Grand Theft Auto and fantasizing about an exciting life of crime and gun fights. By night he DJs at a club owned by ruthless Argentinian kingpin Che Longana. One evening, Santiago finds himself trapped in a bathroom stall as Longana holds a secret meeting to make known his offer of $300 million pesos for the head of Machine Gun Woman, an ex-girlfriend turned hitwoman who has it out for him. When he is discovered eavesdropping on the conversation, Santiago's only choice to avoid being executed is to lie, claim he knows Machine Gun Woman and offer to bring her in. When he is given 24 hours to make good on his claim, Santiago's life turns into a violent video game of its own complete with missions, guns, sexy women and brutal violence.\n\nBRING ME THE HEAD OF MACHINE GUN WOMAN is that latest film from Chile's Ernesto Díaz Espinoza, a man who is no stranger to Fantastic Fest. His first three features (KILTRO, MIRAGEMAN and MANDRILL) have blown audiences away in years past and he also has a segment in this year's THE ABCS OF DEATH. In a departure from his string of Marko Zaror actioners, Espinoza has crafted an incredibly entertaining exploitation film all centered around a beautiful Chilean goddess clad in small swaths of leather and, of course, machine guns. As Santiago tracks down the killer, he is thrust into a strange criminal underworld that frequently erupts in unexpected violence and when he comes face-to-face with her, all bets are off. Espinoza keeps BRING ME THE HEAD OF THE MACHINE GUN WOMAN fast and fun from sexy start to explosive finish. (Brian Kelley)",
    "directors": [
        "Ernesto Díaz Espinoza"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/bring-me-the-head-of-machine-gun-woman"
    },
    "runtime": 75,
    "synopsis": "Timid, video game-loving DJ Santiago seemingly digs his own grave when he agrees to bring a violent criminal kingpin the head of Machine Gun Woman.",
    "title": "Bring Me the Head of Machine Gun Woman",
    "year": 2012
}