{
    "countries": [],
    "description": "Director Matthias Hoene and writer James Moran LIVE in attendance!\n\n \n\nAndy and Terry are two clueless brothers with hearts of gold. Spending their days delivering meals-on-wheels and their nights picking fights in bars, the pair of misfits seem to care for nothing more than then their aging grandfather, Ray. In a desperate attempt to save Ray's retirement home pension, the duo hatch a half witted plan to rob a bank. When the heist is bungled by the arrival of the cops, the team is forced to take two hostages and flee the scene, not realizing there are even bigger problems than the authorities in store for them. A mysterious virus has been let loose in East London and is rapidly turning all the inhabitants into good ol' foot-dragging, flesh-eating zombies.\n\nMeanwhile, on the other side of the city, Ray begins to mount an elderly army, determined to save themselves from the cockney undead. Ranging from the very ornery to the downright horny, Ray's geriatric band of soldiers, armed with wheelchairs and crutches, barricade themselves inside their home, awaiting the impending bloodbath. One zombie at a time, Ray is out to prove that determination runs deep in the blood lines and that family should always stick together.\n\nCommercial director Matthias Hoene comes out strong with his first feature, a zany, bloody comedy that has as much fun playing with culture as it does playing with guts. Peppering the story with quirky flashbacks and hilarious asides, Hoene creates fast-paced atmosphere,full of blood-soaked quick wit, along with kills crazy enough to satisfy the most gore-thirsty viewer. Reminiscent of the best zombie comedies like SHAUN OF THE DEAD and DEAD ALIVE, COCKNEYS VS. ZOMBIES is an outrageously good time. (Michael Lerman)",
    "directors": [
        "Matthias Hoene"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/cockneys-vs.-zombies"
    },
    "runtime": 87,
    "synopsis": "When a badly planned bank robbery and a zombie outbreak collide, hilarity ensues in this balls-out, irreverent British comedy.",
    "title": "Cockneys Vs. Zombies",
    "year": 2011
}