{
    "countries": [],
    "description": "Director David Wu LIVE in attendance!\n\nBullets show no mercy! War has ravaged China and chaos has reigned in many parts. An elite group of snipers have been assembled to take out enemies and traitors. Mu (Peter Ho), a rather young and naïve hunter, has been drafted to be part of the 204th unit after heroically shooting down enemies during an ambush. Squad leader Zhang (Tony Leung) welcomes him into the brotherhood by assigning him his first official mission. His task is to join the team in taking out four enemy generals and a handful of Chinese traitors. Mu's recklessness and soft heart begin to cloud his judgment, and even diminish his abilities - as the best snipers need to be emotionally detached. Meanwhile, General Masaya sends some of his best sharp-shooters to retaliate. Whose bullets will speak louder?\n\nLock and load! Frequent John Woo collaborator David Wu returns with a vengeance and directs one of the most dynamic war films in years. Wu hits bulls-eye after bulls-eye with fast and furious gunfire action with a heavy dose of the kinetic energy from the best 80s Hong Kong action that will undoubtedly kick your adrenaline gland into overdrive.  Based on the famous and popular online Chinese novel, Wu improves upon original material with more humor and excitement. Wu is one of the most influential action editors for 40 years starting with Chang Cheh and Lau Kar Leung at Shaw Brothers to Tsui Hark, Ronny Yu and of course John Woo(A BETTER TOMORROW, HARD BOILED is back to assault action cinema. Newcomer actor Peter Ho(upcoming MONKEY KING) brings a breath of fresh air as a leading actor to look forward to in the future, he keeps his performance intense yet funny and charismatic. (King-Wei Chu, Fantasia International Film Festival)",
    "directors": [
        "David Wu"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/cold-steel"
    },
    "runtime": 107,
    "synopsis": "After 17 years spent directing television series in North America, director David Wu (a longtime collaborator of John Woo) returns to his native China to deliver the heart-pounding World War II epic COLD STEEL.",
    "title": "Cold Steel",
    "year": 2011
}