{
    "countries": [],
    "description": "Charged with the theft of a bag of precious diamonds and the murder of his partner in crime, Cordero is comatose and chained to a hospital bed on an isolated and otherwise empty overflow floor. Officer Jane is the stern, by-the-book policewoman guarding Cordero's room when he wakes from his coma and immediately claims he was framed in the killing of his partner. The two quickly establish a playful rapport, which is broken when Cordero makes his first escape attempt. His efforts to slip away prove to be the least of Officer Jane's worries as violent, no-nonsense crime kingpin Louis Holland arrives at the hospital looking for the jewels. Officer Jane finds herself trapped on an empty hospital floor guarding her prisoner and trying to find a way out while Holland is quick to prove he intends to maintain the upper hand.\n\nDirector Jason Lapeyre (who comes to Fantastic Fest with this and another film, I DECLARE WAR) squeezes every bit of excitement out of a setup that's limited in scope but not in cleverness. Combining crime, thriller and some occasional humor elements, COLD BLOODED moves at an incredible pace and is smattered with some seriously violent moments proving that no character can ever be considered safe. Holland is a formidable baddie, a brash hulk of a man who's unflinchingly evil when anyone stands in his way. Officer Jane is a refreshingly well-rounded female lead character, a woman intent on doing what is right and just, regardless of the cost to her own well being. As the two collide, COLD BLOODED shows how much fun a movie with just a handful of characters in a single location can really be. (Brian Kelley)",
    "directors": [
        "Jason Lapeyre"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/cold-blooded"
    },
    "runtime": 86,
    "synopsis": "Things quickly spiral out of control when a policewoman must protect her recently comatose suspect from a violent crime boss who has cornered them in an isolated hospital wing.",
    "title": "Cold Blooded",
    "year": 2012
}