{
    "countries": [],
    "description": "Beth and Francis, a young married couple, are on holiday together when they venture to a beautiful, but highly remote, island. Beth is pregnant and the two are hoping to enjoy their last vacation before their baby is born. When they arrive, they notice that while there are plenty of children present, the adults all seem to be missing. Initially attributing this to the after effects of a recent festival, they quickly realize something far more sinister is afoot. The two will face terror and unsettling difficult decisions in their quest to make it off the island alive.\n\n\nMakinov's remake of the 1976 Spanish horror film WHO CAN KILL A CHILD upholds much of the disturbing content and genuinely affecting narrative subtleties of the original film without muddying its own identity. In remaking the film, Makinov skillfully captures the timeless horror of the original story's stark, deeply morally troubling themes. It makes us FEEL the ethical questions posed throughout the narrative, that pit our survival instinct against our sense of decency.\n\n\nLikewise, the underlying tensions and ambivalences of impending parenthood, explored so deftly in the original are upheld in this translation, counterbalancing that which could otherwise play as exploitation. However, COME OUT AND PLAY simultaneously delivers the goods in terms of shocks and gore. There is plenty here to appeal to both the reasoned and primitive sides of our brains.  The performances by leads Ebon Moss-Bachrach and Vinessa Shaw are sincere and empathetic to the point of palpable heartache. We watch them commit heinous acts of violence, but for all of it we cannot muster judgment given their unbearable circumstances. Tension blossoms from unexpected places and grows at a rapid pace until it achieves an absolute stranglehold on the audience. COME OUT AND PLAY is a sterling example of a horror remake done right and its final moments are a testament to the genre's continuing ability to shock and challenge us. (Brian Salisbury)",
    "directors": [
        "Makinov"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/come-out-and-play"
    },
    "runtime": 95,
    "synopsis": "While on vacation, Beth and Francis visit a remote island that turns out to be almost solely inhabited by children. Unfortunately for them, these kids are far from well behaved.",
    "title": "Come Out and Play",
    "year": 2012
}