{
    "countries": [],
    "description": "It's World War II and the forces of Goodness and Right are in a pickle. Hitler is on the rise and the little Fuhrer's deviousness knows no bounds. There is no scheme too outlandish, no plan too far-fetched. No, he means to rule the world and if stealing international landmarks will help him do it, then that's what he's going to do. Radio controlled dinosaurs? Of course! Solid gold weaponry? Sterling!\n\nAll that stands between Hitler and total world domination are the intrepid forces of DANGER 5. A collection of the free world's top secret agents, DANGER 5 unite for one simple task: To kill Hitler. And they'll go to the ends of the earth to do it. From Australia: Tucker. From England: Claire. From Russia: Ilsa. From France: Pierre. And from the USA: Jackson. Together they will put an end to Hitler's nefarious schemes.\n\nFrom the demented minds of Dario Russo and David Ashby – who also plays Jackson – DANGER 5 is a hilarious spin on THUNDERBIRDS-style spy adventures. There is no mission too dangerous, no plan too outlandish for this team.\n\nDirector Russo's love for the period DANGER 5 recreates is matched only by his astounding ability to actually recreate it, the series executed so flawlessly using period techniques ranging from miniatures and matte paintings to models and prosthetics that it could very nearly be an artifact from the time rather than a recreation. Only the slyly deconstructionist sense of humor gives the ruse away. DANGER 5 originally aired as a six part television series in Australia. Fantastic Fest is proud to present all six parts in a single, uninterrupted orgy of dinosaur-headed excess (Todd Brown).",
    "directors": [
        "Dario Russo"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/danger-5"
    },
    "runtime": 75,
    "synopsis": "It's World War II and there's nothing Hitler won't do to take over the world! Dinosaur men! Love potions! Giant robots! And all that stands in his way are the intrepid forces of the DANGER 5!",
    "title": "Danger 5",
    "year": 2012
}