{
    "countries": [],
    "description": "Director Noboru Iguchi, producer Mana Fukui, and actress Rina Takeda in attendance!\n\n\nDirector Noboru Iguchi has brought audiences around the world machine gun schoolgirls, robot geishas, karate robots, and toilet zombies. Once you consider this fact, a \"nature attacks\"-type movie about flying killer sushi seems like the next logical step! Wait no longer, fans of nutbar Japanese cinema, for chef Iguchi has served up an omakase that will eat you, if you don't eat it first.\n\n\nKeiko, daughter of a famous sushi chef, leaves home to escape his overbearing training in both sushi-making and martial arts. Finding work at a rural inn, she is bullied by the staff and ridiculed by the guests, including the president of Komatsu Pharmaceuticals, who has come to the inn for a vacation with his associates. Little do they know, however, that disgruntled Komatsu researcher Yamada has followed them there with designs on revenge, using a serum he developed that can awaken the murderous instincts of fish on rice, creating…killer sushi! Bloodthirsty tuna and squid soon descend upon the humans, killing many and turning the remainder into zombie-like creatures. Keiko, joined by the inn's former sushi chef Sawada, uses her fighting skills against the creatures in an attempt to escape with a handful of uninfected survivors. But Yamada has another deadly surprise for them…can Keiko and Sawada defeat both him and his flying killers?\n\n\nIguchi is no stranger to Fantastic Fest, but the big difference this time around is the presence of rising martial arts star Rina Takeda, still barely out of her teens when the movie was made. Takeda's earlier films like HIGH KICK GIRL left a bit to be desired in the story department, but her first feature film collaboration with Iguchi delivers the goods. It helps, of course, that she's backed up by Iguchi's regular stock company of players, including faces familiar to Austin audiences like Asami and Demo Tanaka, plus the required presence of Yoshihiro Nishimura's special effects to deliver the splatter. Bring your soy sauce and wasabi and plenty of beer—you're on the menu tonight! (Marc Walkow)",
    "directors": [
        "Noboru Iguchi"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/dead-sushi"
    },
    "runtime": 91,
    "synopsis": "Japanese splatter action comedy is on the menu when director Noboru Iguchi and karate girl Rina Takeda join forces to take on flying killer sushi monsters in DEAD SUSHI!",
    "title": "Dead Sushi",
    "year": 2012
}