{
    "countries": [],
    "description": "Families are hell. That's a given. There's nobody closer and that special relationship translates into a special ability to wreak havoc when things turn sour. And things have very definitely turned sour for the Shamanov family. Four generations live in the same crowded farmhouse on the remote steppes. Four generations chafing at a lack of opportunity and their meager existence. Four generations of people who, as often as not, barely want to be in one another's presence.\n\nAnd yet that's not going to stop them from celebrating grandpa's birthday. No, brave faces shall be worn as the entire clan gets together to honor their eldest. The entire clan, including those few who have managed to escape the gravitational pull of the family home and make other lives for themselves. Everyone including eldest son Stepan, who left decades ago and has not been seen since. They may soon wish Stepan had not returned after all. You see, Stepan's path to success involved some very unsavory activities. Away from the farm he has thrived in the criminal underworld, climbing through the ranks of the mafia and acquiring some dangerous enemies in the process. And now that he's home, those enemies cannot be far behind.\n\nAfter building a career as a director who essentially dressed up American action film tropes in Russian clothes for the local audience, helmer Oleg Pogodin turns in something far more unusual, far more distinctly Russian, and far, far better with his fourth feature film. Starting as a family drama laced with dark domestic overtones, DOM builds in threads of external menace before exploding into an ultra violent finale. Totally unique, totally compelling, there is nothing else quite like it. (Todd Brown)",
    "directors": [
        "Oleg Pogodin"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/dom-a-russian-family"
    },
    "runtime": 109,
    "synopsis": "A Russian mobster returns to his ancestral home for a family reunion after years of living in the criminal underworld. Unbeknownst to him, his ruthless enemies follow close behind.",
    "title": "Dom - a Russian Family",
    "year": 2011
}