{
    "countries": [],
    "description": "Kim Ji-Woon is one of Korea's most fascinating directors, and a new movie from him is always an event. Whether it's the stylized horror of A TALE OF TWO SISTERS, the intense action of A BITTERSWEET LIFE, the wild spaghetti western madhouse of THE GOOD, THE BAD AND THE WEIRD or even the dark psychodrama I SAW THE DEVIL, he has consistently delivered some of the most challenging, gorgeously shot, innovative genre movies to come out of Korea.\n\n\nOriginally planned to be a three-part omnibus directed by Kim Ji-Woon, Yim Pil-Sung (director of HANSEL & GRETEL and ANTARCTIC JOURNAL) and Han Jae-Rim (THE SHOW MUST GO ON), production started on DOOMSDAY BOOK in 2006, and then fell apart when Han's film (a retelling of an O. Henry short story) proved to be unworkable. With only two-thirds of the movie completed, it was shelved. Then, after a new influx of cash in 2010, Kim and Yim worked together to complete the movie's third segment. Now their collaboration about the end of the world is finally ready for the big screen.\n\n\nOutlining three ways in which the world ends, DOOMSDAY BOOK starts with Yim Pil-Sung's \"A Brave New World,\" a rollicking, hilarious tale about rampant pollution that leads to an outbreak of zombie-ism that robs man of even his ability to choose to die. The second short, Kim Ji-Woon's \"The Heavenly Creature\" is about a future where robots have become our main source of manual labor. One android, which resides at a Buddhist temple, achieves enlightenment, and the company that produces robot workers realizes that it's got a crisis on its hands. The movie wraps up with the two directors collaborating on \"Happy Birthday,\" about a young girl whose wish results in a giant meteor heading straight for the planet Earth. Injecting welcome doses of comedy into three hard science fiction scenarios, this two-fisted dose of apocalypse is the smartest sci-fi flick to hit movie screens all summer. (NYAFF)",
    "directors": [
        "KIM Jee-woon",
        "Yim Pil-sung"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/doomsday-book"
    },
    "runtime": 113,
    "synopsis": "Innovative Korean genre directors Kim Ji-Woon (A TALE OF TWO SISTERS, A BITTERSWEET LIFE, THE GOOD, THE BAD AND THE WEIRD, I SAW THE DEVIL) and Yim Pil-Sung (HANSEL & GRETEL) turn their imaginations to apocalyptic sci-fi with this three-part omnibus film which outlines three possible ways in which the world goes kaput.",
    "title": "Doomsday Book",
    "year": 2012
}