{
    "countries": [],
    "description": "Director Eron Sheean and actor Michael Eklund LIVE in attendance!\n\n\nWhile it is very tempting to refer to Eron Sheean's ERRORS OF THE HUMAN BODY as a sci-fi thriller, that would simply not be accurate. Because while it is very much a fictional story that revolves around science, the science in this film – shot on location at the Max Planck Institute of Molecular Cell Biology and Genetics – is all as real as can be. Call it a scientific thriller, if you will, with all of the science grounded in reality.\n\n\nTHE DIVIDE screenwriter Sheean makes his feature directing debut following a string of acclaimed shorts with ERRORS OF THE HUMAN BODY, the story of geneticist Dr Geoff Burton obsessively struggling to find a cure for the rare genetic ailment that killed his infant son years before. Though brilliant, his obsessions and often unorthodox working methods have left Burton's career in a shambles, forcing him to relocate to Germany to continue his work.\n\n\nIt seems a promising move at first, a well equipped lab with a sympathetic administration and a former student in a key position, but Burton is soon swept up into a web of deceit and jealousy when he discovers that his former student may have found the solution he has searched for – and another researcher may be stealing it.\n\n\nAn icily precise thriller anchored by a subtle, nuanced performance from Michael Eklund (THE DIVIDE, THE DAY), with support from indie faves Karoline Herfurth (PERFUME, WE ARE THE NIGHT) and Tomas Lemarquis (NOI THE ALBINO), ERRORS OF THE HUMAN BODY offers up a surprisingly human take on science, a story ultimately more concerned with its characters than the tools they wield. It is a refreshing, yet challenging approach. (Todd Brown)",
    "directors": [
        "Eron Sheean"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/errors-of-the-human-body"
    },
    "runtime": 101,
    "synopsis": "Plagued by the memory of the infant son he could not save, geneticist Geoff Burton plunges into a web of intrigue, jealousy and lies in this icily precise thriller.",
    "title": "Errors of the Human Body",
    "year": 2012
}