{
    "countries": [],
    "description": "Backberga has gone dark, its power supply crashing to the ground – literally – just outside of town. This has been happening a lot lately. Not by any fault of the local electrical engineers or struggling local telecom company Unicom. No, it's the group of radical, anti-radiowave anarchists who keep blowing things up. Not even Unicom's freshly created superhero mascot can stop them.\n\nSwedish writer-director Patrik Eklund has won international acclaim – and an Oscar nomination – for his previous short films thanks to his wickedly sharp wit and drily understated sense of humor. Those factors are once again in full effect with Eklund's debut feature, FLICKER.\n\nThough the plot of FLICKER has plenty to draw you in, the real strength of the film lies in its characters. The put-upon accountant who dreams of a more romantic, Ted Danson-style love life. The cleaning woman terrified of spiders. Unicom's hysterically incompetent IT department. Eklund is an absolute master of wedding the mundane to the absurd because, to his eyes, there is little to no difference between the two. But Eklund is not content to just poke fun. No, as silly as these people are he loves them all and FLICKER accomplishes the remarkable task of finding the humanity in each of them.\n\nA slyly observed gem of a film, FLICKER announces Eklund as a director who could be a sort of surrogate Coen Brother, should he ever choose to go that route. Eklund certainly shares the Coen's gift for observation and their appreciation of the absurd, but Eklund's obvious love for his characters stands in stark contrast to the lurking cynicism of most who walk this road, and marks him as a truly unique voice. (Todd Brown)",
    "directors": [
        "Patrik Eklund"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/flicker"
    },
    "runtime": 99,
    "synopsis": "Oscar-nominated short film director Patrik Eklund's feature debut showcases the wry wit that made his shorts so hugely popular in this tale of a small town telecom company plagued by anti-radiowave anarchists.",
    "title": "Flicker",
    "year": 2012
}