{
    "countries": [],
    "description": "Director Oystein Karlsen, producer Anders Tangen, Cinematographer Pal Bugge Haagenrud, and actor Jon Oigarden LIVE in attendance!\n\n\nJack is not what you would consider a high quality human being. He drinks too much, does drugs constantly and has never been one to hold down a job. He also has a tendency to fuck anything that moves, a pattern of behavior that Jack puts no particular effort into hiding from anybody – not even his live-in girlfriend and mother of his child. Jack is, in short, the titular FUCK UP in Øystein Karlsen's feature debut.\n\n\nJack has only two things in his favor. He has a certain natural charm, and he's intensely loyal to his three childhood best friends. It is, of course, one of Jack's good traits that gets him in trouble when one of these friends crashes his car into a moose and ends up in hospital, the clock ticking on just how long it will take for the police to realize there's two and a half kilos of cocaine hidden in his trunk. The people who were waiting to receive said cocaine know it's there, of course, and they're less than pleased that it hasn't been delivered. The clock is ticking for Jack to get the drugs out of the car without the police noticing and complete the transaction himself while hopefully keeping everybody alive in the process.\n\n\nThough FUCK UP is Karlsen's first feature, it is a reunion project of sorts, realigning the entire cast and creative team of hugely popular Norwegian sitcom DAG – currently in development for a US version at Fox – for a wickedly black action comedy. The friends on screen are friends in real life, and the established rapport – to say nothing of the fact that all of them are hugely talented – elevates FUCK UP into rare territory. If you take your comedy darker than pitch then this is a treat, indeed. (Todd Brown)",
    "directors": [
        "Øystein Karlsen"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/fuck-up"
    },
    "runtime": 95,
    "synopsis": "Clearly it's all the moose's fault. Jack had everything under control until his best friend crashed into a moose on the Swedish border. With a trunk full of cocaine. Now it's all gone to shit.",
    "title": "Fuck Up",
    "year": 2012
}