{
    "countries": [],
    "description": "Director Ron Morales and producer Rebecca Lundgren LIVE in attendance!\n\n\nMarlon Villar is a typical working man, though as the driver for corrupt Congressman Manuel Changho, Marlon makes a little more than the average Filipino. Despite his good fortune, it's still not enough money to help his wife, who's deathly ill and in need of an organ transplant. When Marlon has some trouble covering up Changho's latest impropriety, it sparks a series of events that will threaten to ruin him and everyone close to him. It begins when he goes to pick up Changho's daughter Sophia from school. The Congressman's child has struck up a friendship with Marlon's daughter Elvie, who's also along for the ride. They're pulled over by a \"cop\" that turns out to be a kidnapper, who makes off with Elvie (mistaking her for Sophia) and tells Marlon to pass along the ransom demands to Changho. Marlon, terrified and distraught, must find some way to get his daughter back.\n\n\nWritten and directed by Ron Morales, a key grip on several well-known Hollywood films, GRACELAND is a tense, taut thriller that drags the audience through some of the darkest parts of the Filipino underworld. Bribes and corruption are commonplace in GRACELAND's Manilla, and they're just the tip of the lurid iceberg. Morales borrows somewhat from Kurosawa's classic kidnapping thriller HIGH AND LOW, but continually puts his own spins on a familiar story. Arnold Reyes is particularly great in the difficult role of Marlon, communicating a plethora of emotions in a very real way as the web of deceit tightens around him. GRACELAND is a dark and dirty film, tense and occasionally unsettling, where no one makes it out completely clean. (Luke Mullen)",
    "directors": [
        "Ron Morales"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/graceland"
    },
    "runtime": 84,
    "synopsis": "When a driver for a powerful congressman picks up his and his boss's daughter from school, he's annoyed to find himself being pulled over. But this alleged cop, far from an officer of the law, sets in motion a downward spiral of kidnapping, murder, deceit and deep depravity.",
    "title": "Graceland",
    "year": 2012
}