{
    "countries": [],
    "description": "Danny (Daniel P. Jones) is released from a Melbourne jail and immediately returns home to his girlfriend Leanne (Jone's real life partner Leanne Campbell). Though his relationship with Leanne picks right back up where it left off, Danny's attempts to reintegrate into society are met with resistance at every step of the way. Haunted by the mental and emotional demons of prison and the lifestyle that put him there, he soon resorts to the familiar crutches of alcohol and outbursts of anger to alleviate tension. Danny is able to maintain some amount of control until things begin to fall off the rails, triggered by a visit from Leanne's heroin dealing friend Anthony.\nHAIL is a startling and brutal hybrid film, a semi-autobiographical pastiche of events from Jones' life and from those of his acquaintances in the criminal world he used to inhabit. Director Amiel Courtin-Wilson worked with Jones to piece together a narrative from his memories and cast Jones, Campbell and other real life characters to create HAIL. The result is a gripping experimental film full of a palpable reality. The narrative is as free-flowing and surreal as it is straightforward with scenes of intense grit inter-cut with those of arresting artistic beauty all coupled with an inventive and unforgettable score. It all works thanks to stunning performances from everyone, especially Jones who has spent his entire life preparing for this role.\n\nWe at Fantastic Fest certainly do love our crime dramas but HAIL is certain to defy attendees' expectations of what a film of its kind can be. Like other ultra-realistic films coming out of Australia, HAIL will take you uncomfortably close to the mind and misdeeds of people who have actually lived the kind of lives most of us only see in movies. (Brian Kelley)",
    "directors": [
        "Amiel Courtin-Wilson"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/hail"
    },
    "runtime": 104,
    "synopsis": "Real life ex-con Daniel P. Jones stars in this haunting and unflinchingly realistic film crafted from pieces of his own memories and experiences.",
    "title": "Hail",
    "year": 2012
}