{
    "countries": [],
    "description": "A double shot from one of Japan's brightest – and strangest – young directors, THE BIG GUN and HENGE prove that the country that spawned iconic talents like Kiyoshi Kurosawa and Shinya Tsukamoto isn't done yet.\n\nWith his twenty minute short film THE BIG GUN, Ohata captures Japan at its economic worst, the crumbling economy leaving the residents of a small town completely on their own as employer after employer shuts down. In the face of financial ruin, the owner of a local ironworks and his brother have no choice but to accept an offer from local gangsters to design and construct bargain handguns. Things do not end well.\n\nOhata was silent for some time following THE BIG GUN's completion in 2008 but returned to screens this year with the longer, more ambitious offering HENGE. Part domestic drama, part creature feature, HENGE wears its influences on its blood-soaked sleeve, and while some parts may feel familiar, the way they're assembled is utterly unique.\n\nHENGE tells the story of a marriage on the rocks, the husband afflicted with strange fits that he says feels as if some strange creature is trying to burst out of him. This bad scenario becomes even worse when the wife must acknowledge that she cannot care for her husband – who she still loves – and must send him away. But when he escapes and returns – looking not for vengeance but for shelter – both must confront the truth that his description of his fits is in fact a reality and his days as a human are rapidly coming to an end. An enormously ambitious micro budget effort, HENGE shows the sort of raw power that hasn't been seen from Japan since the original TETSUO. (Todd Brown)",
    "directors": [
        "Hajime Ohata"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/henge-and-the-big-gun"
    },
    "runtime": 106,
    "synopsis": "A double shot from Japanese up-and-comer Hajime Ohata. Blending elements of Kiyoshi Kurosawa and Shinya Tsukamoto with just the right amount of kaiju monster battles, Ohata is quickly building a reputation as one of Japan's brightest new talents.",
    "title": "Henge + the Big Gun",
    "year": 2012
}