{
    "countries": [],
    "description": "Director Adrian Garcia Bogliano, Producer Andrea Quiroz Hernandez, and Actor Francisco Barreiro will be LIVE in attendance!\n\n\nDirector Adrián García Bogliano is no stranger to Austin with his past films screening at Cine Las Americas (36 STEPS), SXSW (COLD SWEAT) and, most recently, at Fantastic Fest 2011 (PENUMBRA). Bogliano returns to Fantastic Fest this year with HERE COMES THE DEVIL, another horror pastiche sure to please and fans both old and new.\n\n\nAfter a sexy and horrifying opening sets the mood at appropriately creepy, we are introduced to Felix and Sol- normal, young parents who are on vacation with their children, Sara and Adolfo, in Tijuana. On the way home, exhausted from the journey and also looking for a little alone time, the couple allows Sara and Adolfo to explore a hillside near the rest stop unattended. The pair enter a dark cave on the hill and disappear. Felix and Sol work with the local authorities to conduct a search and retreat back to their hotel room empty handed. Their nightmare appears to come to an end when the children are found and returned but it's not long before they realize there's something not quite right with the kids.\n\n\nHERE COMES THE DEVIL displays many of Bogliano's signatures including beautiful women in various stages of undress, brutal violence and clever ways to build tension on a budget. Like all of his other films, though, it's completely unlike the one that came before it. As Sol and Felix become more and more convinced of something evil at work behind Sara and Adolfo's disappearance, a palpable sense of dread builds as paranoia sinks in. There are plenty of twists along the way, keeping the audience off balance and unsure of what to make of various bits of information. When the end finally comes, the revelations are as horrific and shocking as we have come to expect from Bogliano. (Brian Kelley)",
    "directors": [
        "Adrián García Bogliano"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/here-comes-the-devil"
    },
    "runtime": 97,
    "synopsis": "Fantastic Fest veteran Adrián García Bogliano (COLD SWEAT, PENUMBRA) returns with his latest supernatural horror. When two children who went missing while exploring a cave are found, it quickly becomes apparent something evil has come home with them.",
    "title": "Here Comes the Devil",
    "year": 2012
}