{
    "countries": [],
    "description": "Mr. Oscar is a busy man. Obviously quite wealthy and important, he bids his young daughter good day while walking from his expansive home to his limousine to start the day's appointments, as his bodyguards follow in a BMW. Seemingly exhausted already, he speaks with his driver, Celine, who informs him that he has 9 appointments scheduled for the day. But it quickly becomes apparent that these are not normal appointments and Mr. Oscar is not your normal businessman.\n\n\nA film that's far better to experience than to read about, Holy Motors is a wild ride down the proverbial rabbit hole. Directed by Leos Carax, a Frenchman perhaps best known for his 1999 film Pola X, and starring Denis Lavant in an unbelievably difficult and demanding role, Holy Motors is a film that is constantly changing and evolving into something different. Carax and Lavant previously collaborated on Merde, the triumphant centerpiece of the anthology film Tokyo!, a Fantastic Fest alum from 2008. Fans of that film will find an extra layer of appreciation for Holy Motors.\n\n\nAn absurdist adventure featuring everything from a random musical number to an impromptu fashion show in the Paris sewers, Holy Motors is crazy but not without purpose. It is hilarious and completely insane yet strangely brilliant at the same time. An incredibly astute and acute meditation on acting and identity and the needs we have as audience members as well as the increasingly blurry line between fantasy and reality, Holy Motors is exactly the type of film you hope to discover at Fantastic Fest. (Luke Mullen)",
    "directors": [
        "Leos Carax"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/holy-motors"
    },
    "runtime": 116,
    "synopsis": "While following a day in the life of Mr. Oscar as he attends several appointments, things quickly unravel and spiral out of control, abandoning all sense of logic or sanity. Fans of Carax's 'Merde' segment of Fantastic Fest 2008 hit TOKYO! will be right back at home.",
    "title": "Holy Motors",
    "year": 2012
}