{
    "countries": [],
    "description": "Director Rob Wilson and producer Lewin Webb will be LIVE in attendance!\n\nEvery afternoon, several 13-year-olds congregate in the woods to play the game of \"war.\" Using their imaginations, they transform sticks into sub-machine guns and water balloons into grenades to practice their combat abilities. Legendary for his tactical mind, the young PK is a pure General in the making. The only thing he cares more about than winning a battle is his best friend Kwon, a long time ally who frequents PK's house for sleepovers and screenings of PATTON after their various victories. In an effort to defeat the illustrious PK, the ruthless General Skinner kidnaps Kwon with the intention and torturing him for information. Little does Skinner know that PK will do anything to get his best friend back and before they know it, a diverse band of soldiers that includes a priest, a bully and a mysterious girl sets off for battle in the war to end all wars.\n\nIf this sounds like a joke, it's not. Director Jason Lapeyre treats what could quickly become a dismissive satire with incredible sincerity. Putting us inside of the minds of his young protagonists, Lapeyre creates a world in which we see children attack each other with everything from heavy artillery to laser eyeballs, while all the while keeping the focus on their basic adolescent conflicts. Utilizing a cast of extremely talented child actors, the film contains very real depictions of bullying, teenage crushes and fickle friendships, making the movie as much about adolescence as it is about warfare. Winner of the top prize at this year's Action Fest, I DECLARE WAR is a one-of-a-kind action pic with an incredible twist. (Michael Lerman)",
    "directors": [
        "Jason Lapeyre",
        "Robert Wilson"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/i-declare-war"
    },
    "runtime": 91,
    "synopsis": "A group of exceptionally creative teens gets sucked into their own private Lord of the Flies scenario when an after-school game of \"war\" turns into a test of loyalty, strategy and friendship.",
    "title": "I Declare War",
    "year": 2012
}