{
    "countries": [],
    "description": "Li Xianje is a video game-loving slacker, who coasts through life at his own pace, thanks to a rare condition known as Temporal Dilation Disorder. TDD causes time to pass more slowly than for everybody else - minutes feel like days, a day like an entire lifetime. It proves a lonely existence until he meets the beautiful Wang Qian, who shares his affliction. However, when a tragic car accident snatches her away, Li will do whatever it takes to be reunited with the woman he loves. Perhaps a mysterious video game is the answer - a game rumoured to hold the secret to time travel. If he can beat the game, he might just be able to save Wang Qian.\n\nAdapted from a hit animated short that appeared online in 2009, director Li Yang teams up with TV ad man Frant Gwo to expand his unique, frenetic vision into a feature-length blend of live action, hand drawn animation, epic CGI landscapes, crude cut-outs and East-meets-West pop culture iconography. Jaycee Chan, son of martial arts legend Jackie Chan, stars as bewildered, heart-broken \"Devotion Lee\", who must become the kind of ass-kicking name-taking hero he's only experienced in video games, if he is to succeed in his mission.\n\nThe result is a wholly unique and exhilarating experience, a gorgeous visual odyssey packed with comedy and adventure, that remains, at its core, a beautifully touching quest for love played out with the unabashed romanticism only Asian Cinema can get away with. At a time when China is spewing out nothing but nationalistic period dramas and crass consumerist rom-coms, LEE'S ADVENTURE proves fantasy, sci-fi and imagination are still alive and kicking in the Mainland. (James Marsh)",
    "directors": [
        "Frant Gwo"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/lees-adventure"
    },
    "runtime": 91,
    "synopsis": "When Li Xianje's beautiful girlfriend dies in a tragic accident, he attempts to harness his Temporal Dilation Disorder in order to travel back in time and save her!",
    "title": "Lee's Adventure",
    "year": 2011
}