{
    "countries": [],
    "description": "Director Javier Diment, and writer Martin Blousson will be LIVE in attendance!\n\nAlicia is devastated by the death of her beloved husband, Jorge. Not surprised, but devastated nonetheless. Not surprised because Jorge, a practitioner of the occult with remarkable powers, foresaw his own death and warned his beloved wife ahead of time. Warned her and left her with instructions on how to bring him back. And Alicia intends to follow those instructions to the letter.\n\nAnd so, just a few days after Jorge's death, Alicia has gathered their closest friends in their home to undertake the rite Jorge laid out for them. A rite that she tells her friends will send their love shining out like a beacon through the afterlife, a shining beacon to guide Jorge home. Yes, there will be difficulties. All involved may find themselves visited by the spirits of their own dead. But – and this is important – as long as all involved stay inside the house they will be perfectly safe. Nothing can harm them there.\n\nAlicia is lying, of course, the ritual and its risks not exactly as she has presented them to her guests. And it quickly becomes clear that not everyone will survive until the morning.\n\nA compelling fusion of visual bravado and reckless energy, LA MEMORIA DEL MUERTO announces the arrival of a major new talent in Argentina's Valentin Javier Diment. Blending the DIY bravado and grotesque sense of humor of an EVIL DEAD II era Sam Raimi with the baroque sensibilities of classic giallo, LA MEMORIA DEL MUERTO is simply astounding in its ambitions and even moreso in its ability to accomplish those ambitions on a tiny budget. Diment is clearly some sort of gonzo genius and this the film that he packed all of his loves and obsessions into as though afraid he'll never get the chance again. (Todd Brown)",
    "directors": [
        "Valentín Javier Diment"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/memory-of-the-dead"
    },
    "runtime": 89,
    "synopsis": "Alicia undertakes a bizarre cult ritual to restore her deceased husband to life – a ritual that will see her home and friends visited by the spirits of the dead.",
    "title": "Memory of the Dead",
    "year": 2012
}