{
    "countries": [],
    "description": "Actor/Producer Grandmaster YK and actors Joe Diamond, Maurice Smith, Angelo Jannotti, and Vince Hirsch will be LIVE in attendance!\n\nTHE ULTIMATE ACHIEVEMENT IN TAE KWON DO ANTI-SANITY! The year is 1987. Motorcycle ninjas tighten their grip on Florida's narcotics trade, viciously annihilating anyone who dares move in on their turf. Multi-national martial arts rock band Dragon Sound have had enough, and embark on a roundhouse wreck-wave of crime-crushing justice. When not chasing beach bunnies or performing their hit song \"Against the Ninja,\" Mark (kung-fu master/inspirational speaker Y.K. Kim) and the boys are kicking and chopping at the drug world's smelliest underbelly. It'll take every ounce of their blood and courage, but Dragon Sound can't stop until they've completely destroyed the dealers, the drunk bikers, the kill-crazy ninjas, the middle-aged thugs, the \"stupid cocaine\"...and the entire MIAMI CONNECTION!!!\n\nReal life martial arts grandmaster Y.K. Kim only made one film in his life, but it's without a doubt the most rampaging crowd-pleaser of the '80s, bursting with vibrance, violence, honor and hilarity. Completely lost for decades, a 35mm film print has been unearthed by the Alamo, and its first viewing opened a dimensional portal to pure, unstoppable FUN. After demolishing the crowd with it at select festivals, we've allied with writer/producer/star Y.K. Kim and the rest of the cast to detonate Fantastic Fest with the supreme synth-rock anti-ninja experience. Miss this epochal screening event and you'll hate yourself for a thousand lifetimes...guaranteed!!! (Zack Carlson)",
    "directors": [
        "Y.K. Kim",
        "Woo-Sang Park"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/miami-connection"
    },
    "runtime": 83,
    "synopsis": "The legendary long-lost '80s thunder-rager! Martial arts rock band Dragon Sound throw down in the ultimate conflict against an army of cocaine-powered motorcycyle ninjas. The BEST unseen movie in HISTORY!",
    "title": "Miami Connection",
    "year": 1987
}