{
    "countries": [],
    "description": "Director Eric Walter and Producers Andrea Adams and Christine Irons will be LIVE in attendance!\n\nOne of the most famous hauntings in American paranormal lore is that of the Lutz family home in Amityville, New York. In addition to the forensic facts of the catalytic DeFeo murders, the supernatural particulars of what befell the Lutz family in that twenty-eight day period in 1975 have been sensationalized and immortalized on film, a but doubts have lingered as to the validity of the Lutz's claims. My Amityville Horror offers to the curious the extremely rare privilege of a firsthand account of life inside the Lutz house during those fateful days. Daniel Lutz, a man whose entire life has been inexorably altered by his brief stay in the house at 112 Ocean Avenue, finally speaks. His words of contempt for his stepfather George pour with icy conviction like the reported blood from the walls of the house. He is reunited with the mediums who investigated the haunting and even walks the streets of his old neighborhood once more; still pursued by the ghosts of bad memories. To date, he is the only child of the ill-fated Lutz family to come forward. Through a combination of interviews and archival footage and photographs, My Amityville Horror explores a familiar story with fresh perspective.\n\nThere is a temptation as an audience member to approach My Amityville Horror as a fleeting thrill, a chance to mine the last goosebumps of a gimmicky campfire story. Director Eric Walter is not possessed of so exploitative an intent. My Amityville Horror is an intensely human story about how the demons of our past, be they of this world or the next, fundamentally shape our futures. Daniel Lutz's shattered world, his perpetually darkening outlook, and his violent resentment of his own existence is every bit as frightening as his stories of levitating beds and ghostly visions. (Brian Salisbury)",
    "directors": [
        "Eric Walter"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/my-amityville-horror"
    },
    "runtime": 88,
    "synopsis": "You've seen the movie, now hear the story of the Amityville haunting from someone who lived it. Regardless of the source, it's clear there was darkness in that Long Island house.",
    "title": "My Amityville Horror",
    "year": 2012
}