{
    "countries": [],
    "description": "Santos Trinidad (José Coronado) is a dirty cop with a violent streak and a serious thirst for rum and Coke. During a drunken binge, he murders three people in a bar. A witness escapes from the building before Santos can catch him. While Santos sets out to kill the witness and cover up his crimes, a judge and the police conduct a investigation into the murders. Santos' hunt for the witness and the parallel police investigation slowly converge to reveal a massive criminal conspiracy that no one involved could have ever anticipated.\n\n\nEnrique Urbizu's NO REST FOR THE WICKED (NO HABRÁ PAZ PARA LOS MALVADOS) is a briskly paced thriller that deftly juggles intertwining plot lines with surprising and explosive results. The film swept the 2012 Goya Awards—the Spanish equivalent of the Oscars—with wins for Best Film, Best Director, Best Actor, Best Screenplay, Best Editing, and Best Sound. The accolades are well deserved because NO REST FOR THE WICKED is amongst the strongest thrillers to emerge from Spain—or anywhere else—in the past few years. The film's secret weapon is José Coronado, who delivers an award-winning performance as a completely despicable cop. Focusing a film on such an unlikeable character is a risky move, but Coronado handles the role with menacing precision. An American remake of the film is already in the works—Sylvester Stallone has expressed serious interest—so now is the time to get ahead of the curve and experience the power of the original NO REST FOR THE WICKED. (Rodney Perkins)",
    "directors": [
        "Enrique Urbizu"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/no-rest-for-the-wicked"
    },
    "runtime": 104,
    "synopsis": "A dirty cop who tries to cover up a crime stumbles upon a massive criminal conspiracy. NO REST FOR THE WICKED swept the Spanish Goya awards this year with an electrifying performance by lead actor José Coronado.",
    "title": "No Rest for the Wicked",
    "year": 2011
}