{
    "countries": [],
    "description": "Phillipe Lefebvre's PARIS BY NIGHT is a sleek French cop thriller that follows a pair of vice cops as they patrol the Parisian club scene over the course of a single evening. Simon Weiss (Roschdy Zem from SLEEPLESS NIGHT and POINT BLANK) plays a suave chain-smoking, hard-drinking cop with the brigade mondaine. Wiess' job is to make sure the Parisian night clubs operate legally, but his methods of enforcing the law are unorthodox. In exchange for cash and crime tips, he doles out favors to numerous club owners, including his friend Tony Garcia (Samuel Le Bihan from BROTHERHOOD OF THE WOLF and FRONTIER(S)). Each night, a different colleague chauffeurs Weiss around Paris. On this particular evening, Sergeant Laurence Deray joins Weiss as his driver. A seemingly normal shift evolves into a long night of beat downs and shake downs.\n\nPARIS BY NIGHT provides a behind-the-scenes look at the seductive and dangerous world of the Parisian club scene. The film is based on the experiences of co-writer Phillipe Asard, who worked with the Paris vice squad for fifteen years. In fact, PARIS BY NIGHT was shot entirely in the same clubs that Asard once worked as a cop. In the film, Weiss and Deray are constantly in motion, weaving in and out of tight-knit network of bars, brothels, and dives. Each stop on the beat introduces the audience to a motley array of characters, ranging from mobsters and drug dealers to hookers and drag queens. Over time, the seemingly routine trips reveal become parts of a puzzle that suggests that Weiss is involved in something far elaborate simple graft and bribery. PARIS BY NIGHT is an intoxicating ride through a seductive world of booze, drugs, and sleaze. (Rodney Perkins)",
    "directors": [
        "Philippe Lefebvre"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/paris-by-night"
    },
    "runtime": 100,
    "synopsis": "Phillipe Lefebvre's PARIS BY NIGHT is a sleek French cop thriller that follows a pair of vice cops as they patrol the Parisian club scene over the course of a single evening.",
    "title": "Paris by Night",
    "year": 2011
}