{
    "countries": [],
    "description": "Director Max Porcelijn, Actor Ruben van der Meer, and DP Coen Stroeve will be LIVE in attendance!\n\n\nDetective Ronald Plasmeyer is good at coming up with plans. The problem is that he's bad at coming up with good plans. This is a particularly significant problem given the large Asian men who turned up for a 'chat' with Ronald's estranged wife and young son over the money he owes them.\n\n\nIt's not that Ronald doesn't want to repay the debt, it's just that ten thousand Euro is a lot on a policeman's salary. Plan A involved winning at poker. But poker is how he racked up the debt in the first place so – no surprise – Plan A just makes the problem worse. Plan B? Well, since Ronald can't win at poker why not steal a tournament's worth of poker winnings, instead? But Ronald is even worse at hiring henchmen than he is at making plans and that goes spectacularly badly. And now Ronald is on the run and desperately in need of a good Plan C.\n\n\nA deliciously dry and slyly absurd comedy, Max Porcelijn's PLAN C captures a train wreck in slow motion, a Coen-esque tale of criminal ineptitude. Ruben van der Meer anchors the film with his nuanced, understated, and very funny central performance as Plasmeyer.\n\n\nA weak willed and deeply passive man Plasmeyer as played by van der Meer is the world's least likely criminal mastermind. This is, of course, entirely the point and Porcelijn takes great delight in letting the dominos fall as this incompetent cop proves to be an equally incompetent robber. As the chaos swirls ever higher Plasmeyer remains in the eye of the hurricane, not so much a beacon of strength but an icon of confusion and indecision. (Todd Brown)",
    "directors": [
        "Max Porcelijn"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/plan-c"
    },
    "runtime": 95,
    "synopsis": "Detective Ronald Plasmeyer has a problem in need of a solution: A ten thousand Euro debt to the Chinese mafia. Plan A didn't work. Plan B made things much, much worse. Now it's time for Plan C.",
    "title": "Plan C",
    "year": 2012
}