{
    "countries": [],
    "description": "Director Rodney Ascher will be LIVE in attendance!\n\n\nStanley Kubrick's Kubrick's 1980 adaptation of Stephen King's novel THE SHINING is rightly regarded as one of the best horror films ever made. While cinephiles admire THE SHINING for its iconic performances, dread-inducing atmospherics, and technical precision, others appreciate the film on an entirely different level. These fans see the film as a subversive commentary on such disparate topics as: the mass murder of the American Indians, Nazism, numerology, the rise of Western civilization, Freudian analysis, and the Apollo 11 moon landing \"hoax.\" Rodney Ascher's ROOM 237 gathers five of these Kubrick obsessives and weaves their bizarre—and often incredulous—ideas into a thought-provoking exploration of the extreme boundaries of subtextual analysis and conspiratorial thinking.\n\n\nROOM 237 is radical in both content and construction. The film deploys a style that has more in common with the work of Chris Marker and other experimentalists than traditional documentaries. ROOM 237 is structured in nine parts, each of which is built around a specific theme invoked by the interviewees. The film's five subjects are identified by name but never physically appear onscreen. We only hear their voices as they relay their thoughts. In addition to using original footage, Ascher appropriates clips from numerous films—including Kubrick's works—, cartoons, and newsreels. This mélange of material is expertly edited into a hypnotic flurry of wild ideas and startling images that challenges the limits of the audience's belief.\n\n\nROOM 237 raises provocative questions about THE SHINING and Kubrick's overall artistic—and perhaps political—goals. What really lies behind the door to Room 237? This is a question that may never be fully answered. (Rodney Perkins)",
    "directors": [
        "Rodney Ascher"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/room-237"
    },
    "runtime": 102,
    "synopsis": "Rodney Ascher's ROOM 237 is a fascinating documentary that explores bizarre theories about the subtext and symbolism underlying Stanley Kubrick's landmark film THE SHINING.",
    "title": "Room 237",
    "year": 2012
}