{
    "countries": [],
    "description": "Set during the Qing Dynasty (1644–1911), when China's once mighty empire was temporarily overshadowed by the scientific and technological innovations of the West, Tai Chi 0 is a funky, steampunk-infused chronicle of the origins of Tai Chi. Reinventing the martial arts genre with a style influenced by the dazzling colours and dynamism of Japanese animation and videogame graphics, actor-turned-director Stephen Fung gathers an all-star cast (including Shu Qi and Tony Leung Kar-fai) to tell the tale of Yang Luchuan, the master who developed the \"Yang style\" form of tai chi.\n\nCursed with an abnormal, fleshy bulge protruding from his forehead, Yang Luchuan (played by the spectacular new martial arts star Yuan Xiaochao, gold medalist at the 2006 Asian Games) is considered the town fool. Following the wishes of his late mother (Shu Qi), Yang travels to the remote village of Chen to learn tai chi, the only thing that can stop the growth on his forehead from developing into a life-threatening affliction. Although met with hostility from the villagers, Yang is determined to become a disciple of the legendary Master Chen (Tony Leung Kar-fai), and engages in a series of combat trials to prove his worth — only to be defeated by everyone in the village (including old ladies and children), as well as Chen's beautiful daughter Yuniang (Angelababy).\n\nBut Yang gets another chance to display his courage to Yuniang by taking on another challenge: not a human opponent but a steam-powered machine, a Western invention that threatens to bring a railroad through the village and annihilate its sacred cultural heritage. The first installment of a trilogy designed to revisit the fundamentals of Chinese culture, Tai Chi 0 combines spectacular visuals and stunning fight choreography (courtesy of the great Sammo Hung) with a delightful retro-futuristic twist on the traditional martial arts hero narrative. The result is a rollercoaster ride of a movie, a cheeky tribute to tradition that boldly revolutionizes the genre for the twenty-first century. (Giovanna Fulvi, program note courtesy of the Toronto International Film Festival.)",
    "directors": [
        "Stephen Fung"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/tai-chi-0"
    },
    "runtime": 100,
    "synopsis": "Martial arts meets steampunk in Hong Kong actor-director Stephen Fung's (Gen-X Cops) slick, stylish pop-art take on the life of Yang-lu Chan (played by new martial-arts sensation Yuan Xiaochao), founder of the Yang school of tai chi.",
    "title": "Tai Chi 0",
    "year": 2012
}