{
    "countries": [],
    "description": "Johan and Saar are a couple in trouble. Their marriage on the rocks, the couple have left their daughter at home and hit the road, returning to the site of the Argentinean honeymoon in a desperate last attempt to recapture the spirit of their relationship and save their marriage. This is it for them. Should this trip fail their marriage is at an end. What Johan and Saar never suspected, however, is that this trip could be the end of them, period.\n\nIn a classic case of 'wrong place, wrong time' the couple not only witness a shooting, they capture it on camera. Even worse, the shooter is a police officer and his target left dead in the street. Worse still, they were spotted on the scene. And suddenly their idyllic vacation spot has become a terrifying trap, the couple chased through a hostile environment unable to communicate with the locals and unable to trust any of the authorities they would normally be able to turn to for help. If they do not find their way to safety before being tracked down by the shooter then Johan and Saar will surely become his next victims.\n\nA lean, taut thriller anchored by stellar performances from Barry Atsma and Susan Visser, TAPED takes a simple premise and works it out to its logical extreme. It is a film that takes the primal, irrational fear of being someplace unknown and suggests that the fear may not be irrational after all. Director Diederik Van Rooijen finds just the right balance between style and grit, tension and character as he delivers a thriller that Hollywood has already snapped up for remake. Here's your chance to see the original version first. (Todd Brown)",
    "directors": [
        "Diederik van Rooijen"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/taped"
    },
    "runtime": 80,
    "synopsis": "A trip meant to save their marriage turns into a nightmare when Johan and Saar accidentally videotape a police shooting in the streets of Argentina.",
    "title": "Taped",
    "year": 2012
}