{
    "countries": [],
    "description": "Director Yudai Yamaguchi and Producer Masaru Yabe wil be LIVE in attendance!\n\n\nIn 1995, before they joined forces to help create the low-budget Japanese action classic Versus, writer / director Yudai Yamaguchi (Battlefield Baseball, Cromartie High School, Meatball Machine, Yakuza Weapon) and actor / action choreographer Tak Sakaguchi (Death Trance, Shinobi) teamed up to create a crazy, independent short film called Snot Rockets & Super Detective. Now, 17 years later, the pair have joined forces again to reboot a brand-new, feature-length version of the short, and it's even more lunatic and unpredictable than what came before.\n\n\nTak stars as Tebana Sankichi—lover of women, rescuer of the fallen, sometime private detective, wayward son, homeless bum, celebrity, bullied child, spoiled rich kid, and fighting master. In what can politely be described as a \"loose episodic comedy,\" we follow Sankichi's increasingly bizarre adventures across space and time, and his long-suffering partnership with \"Twice\" Shiro, his bespectacled, put-upon partner, as well as the efforts of a hard-working postman trying to deliver a very important letter to him.\n\n\nShot across the globe in Tokyo, Yubari, Philadelphia, New York, and even in Austin during Fantastic Fest 2011, TEBANA SANKICHI: SNOT ROCKETS is now bigger, longer, and packs more power per inch than ever before. Careening recklessly from suicide humor to Tora-san references to traditional New Year's Day television greetings to horror homage and yakuza movie references, it's a film guaranteed to wear the audience out with its relentless pace, and make you cry \"mercy!\" A radical departure from anything the filmmakers have done in the past few years, and produced on a shoestring budget, TEBANA SANKICHI is a demonstration of how much Yudai and Tak continue to push the boundaries of the action/comedy film, and is their latest shot across the bow of good taste and good judgment. Watch it if you dare! (Marc Walkow)",
    "directors": [
        "Yudai Yamaguchi"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/tebana-sankichi-snot-rockets"
    },
    "runtime": 79,
    "synopsis": "Tak Sakaguchi stars in Yudai Yamaguchi's feature-length reboot of an original indie short film made in 1995. Follow the ridiculous adventures of sometime private detective and fighting master Tebana \"Snot Rockets\" Sankichi, and his loyal sidekick \"Twice\" Shiro. An episodic, nonsense comedy that flies like a rocket and lands like a wet loogie.",
    "title": "Tebana Sankichi: Snot Rockets",
    "year": 2012
}