{
    "countries": [],
    "description": "Director Fredrik Horn and producer Christian Falch LIVE in attendance! \n\nIt has been done so many times now that it has become cliché, eyes simply rolling and glazing over when the 'Based on a true story' tag scrolls across the screen to add gravity to the latest Hollywood concocted tale of demonic possession. But THE EXORCIST IN THE 21ST CENTURY really is the true story, a detailed and nuanced documentary of highly specialized priests – real life Vatican-approved exorcists – and the people who seek out their services.\n\nFilmmaker Fredrik Horn Akselsen has been granted a remarkable degree of access to tell this story, presenting information and first hand experiences in a steady, even hand that leaves the audience free to draw their own conclusions. He meets with believers in the phenomenon as well as skeptics, both inside and outside of the church. But mostly he tells his story through two people.\n\nFirst, there is Father Jose Antonio Fortea, a Roman Catholic priest based in Madrid. Father Fortea first rose to prominence as the author of Summa Daemoniaca, a treatise on the history of demonology throughout Catholic history including, yes, a manual of Catholic rites of exorcism. Father Fortea has become known around the world as an expert on the topic, traveling to speak about demonology around the world and – as one of a small group of Catholic priests approved by the Vatican to perform exorcisms – he very definitely practices what he preaches.\n\nAnd then there is Constanza - an articulate, university educated Colombian woman who sincerely believes she is demon possessed and is seeking out the help of Fortea or any other priest who may free her of her affliction.\n\nAkselsen tells these stories with a minimum of fuss and bother, choosing to let the day to day life of the men who live out this very unusual vocation be the story rather than attempting to embellish for shock value. It makes for fascinating viewing. (Todd Brown)",
    "directors": [
        "Fredrik Horn Akselsen"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-exorcist-in-the-21st-century"
    },
    "runtime": 80,
    "synopsis": "Norwegian documentarian Fredrik Horn Akselsen examines the work of Father Jose Antonio Fortea – an actual, Vatican-approved exorcist – in this balanced look at a largely hidden world within the Catholic church.",
    "title": "The Exorcist in the 21st Century",
    "year": 2012
}