{
    "countries": [],
    "description": "South Korea's very first animated film to screen at Cannes, THE KING OF PIGS is a time-tripping, soul-shattering mystery about the scars that make us, and the secrets we bleed to keep. Kyung-Min has just killed his wife, but it didn't make him feel any better. His business is failing and he can't stop thinking about his middle school days, back when he was one of the lowly, bullied \"pigs\", the rock-bottom caste of the social animal kingdom, at the mercy of the popular \"dogs\". His old school friend, Jong-Suk, agrees to meet, and each man tells the other polite lies about his wrecked life. But both of them have one thing on their minds: Chul-Yi, their old class comrade, the quiet, deadly boy in the hoodie who fought back against the bullies and became, for one blazing moment in time, The King of Pigs. \"Be my friends,\" he offered, \"and you will never cry.\"\n\nTHE KING OF PIGS animation style evokes memories of the great Satoshi Kon (PAPRIKA), sinuous yet rippling with organic textures that mimic the flesh and failings of real, flawed human beings, with every tear, bruise and knuckle to the face meticulously rendered. One thing the film never allows us is too much room to breathe: these kids are suffering, and so must the audience. Every moment is tripwired, every scene is a time bomb. In keeping with the film's thematic resonance, the adult and child Jong-Suk are voiced, respectively, by Yang Ik-June and Kim Kkobbi, the stars of NYAFF 2009's harrowing, BREATHLESS.\n\nInspired by his own experiences in middle school, director Yeun Sang-Ho also drew upon recurring dreams to tell his dual-narrative story about the cycles of abuse and the bullied who become the bullies. THE KING OF PIGS is a meditation on the impotence and violence in the world of young adults, and the cancer of memory. In Yeun's dark vision, Korea today is bound by an invisible web of resentment, classism, and persecution from birth to death, where souls are trapped by their hidden sins. The only way to break free is to face the ugly truth about where we've been and where we're going. (NYAFF)",
    "directors": [
        "Yeun Sang-ho"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-king-of-pigs"
    },
    "runtime": 97,
    "synopsis": "THE KING OF PIGS is an emotionally punishing animated indie film about a group of friends whose brutal childhoods continue to haunt them as adults.",
    "title": "The King of Pigs",
    "year": 2011
}