{
    "countries": [],
    "description": "Director Michael Paul Stephenson, producer Lindsay Stephenson and haunters Manny Souza and Victor Bariteau LIVE in attendance! \n\n\n \n\n\nChances are you've come across one in your lifetime. Your neighbor may be one. Your co-worker may be one. There could even be one in your family. Sometimes they operate alone and sometimes they involve their loved ones. The moment they wait for is over in what seems like the blink of an eye but there can be months of planning, designing and building leading up to a night of terror.\n\n\nThese people are home haunters.\n\n\nThe idyllic East Coast town of Fairhaven, MA is the home of several home haunters, individuals who are obsessed with turning their properties into elaborate and horrifying spectacles every Halloween. THE AMERICAN SCREAM follows three of them - a perfectionist IT professional whose wife and children help out with varying levels of enthusiasm, a friend inspired to create his own haunt, and a father and son duo- as they prepare for the big day. Their passion is immediately apparent and their methods are varied with some opting for obsessive attention to detail and others more concerned with overall effect. The common link between them all is an artistic genius bred from the love of scaring the pants off their friends and neighbors.\n\n\nDirector Michael Stephenson (BEST WORST MOVIE) has crafted another extraordinarily entertaining and heartwarming documentary with THE AMERICAN SCREAM. Despite bumps along the way in the days leading up to Halloween, the payoff captured is something truly special. In the end all the mishaps, slips, spills, scrapes and creative differences don't matter. What really matters is the sense of pride a home haunter feels by bringing together his or her community to experience the product of months of hard work. That and the look of frozen terror on the faces of men, women and children alike. (Brian Kelley)\n\n\nThere will be a special haunted house event following the world premiere of The American Scream - check it out here!",
    "directors": [
        "Michael Paul Stephenson"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-american-scream"
    },
    "runtime": 91,
    "synopsis": "In a small Massachusetts community, three Halloween-obsessed households transform into neighbor-terrifying supernatural wonderlands in this surprisingly touching documentary from the director of BEST WORST MOVIE.",
    "title": "The American Scream",
    "year": 2012
}