{
    "countries": [],
    "description": "Producer/Co-Director Jeremy Kipp Walker, Writer/Co-Director John Mitchell, and Actors Nil d-Aulaire and Jay Klaitz will be LIVE in attendance!\n\n\nWhen a comet threatens to destroy their planet, the citizens of Hondo send General Trius (Nils d'Aulaire) to find a new planet on which they can live. After landing on Earth somewhere near Brooklyn, General Trius chooses to ignore his mission to eliminate the indigenous peoples after wandering into a megastore and hearing music for the first time. He assumes the name Bill and starts a family and one-man bluegrass act.\n\n\nHis peaceful life is disrupted when the Hondorians send a representative- a bumbling fool named Kevin (Jay Klaitz)- to Earth to assassinate General Trius and clear the way for an invasion. Bill finds it easy to subdue Kevin with music and the two form a band called Future Folk that becomes popular in New York bars. The problem is, though, the Hondorians have no intention of calling off their plan to eliminate mankind.\n\n\nTHE HISTORY FUTURE FOLK, the feature debut of directors John Mitchell and Jeremy Kipp Walker, is the impossibly charming and clever origin story of the real life \"Acoustic Space Aliens\" who have been perfecting their act for more than 6 years in the New York City area. For all of its sci-fi elements, at the heart of the film is the immediately lovable personality of Future Folk, whose songs are enormously catchy and lyrics are full of the wit on which the movie the built. The deep love d'Aulaire and Klaitz have for music is apparent in every scene and while watching their musical performances in the film one starts to believe that two guys with a banjo and a guitar (along with some fancy red spacesuits) really could save the world through sheer charisma. (Brian Kelley)",
    "directors": [
        "J. Anderson Mitchell",
        "Jeremy Kipp Walker"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-history-of-future-folk"
    },
    "runtime": 85,
    "synopsis": "Real life bluegrass band Future Folk use a banjo and a guitar to save mankind in this sci-fi comedy origin story.",
    "title": "The History of Future Folk",
    "year": 2012
}