{
    "countries": [],
    "description": "Director Christopher MacBride, producer Lee Kim, actor/producer Aaron Poole, cinematographer Ian Anderson, and actor Jim Gilbert LIVE in attendance!\n\nWhen two young filmmakers select a crazed conspiracy theorist as the subject of their new work, the task seems simple enough: Befriend him, gain his trust, and let his theories speak for themselves. But things prove much more complicated than that. Despite his wild street preaching, their subject proves to be an articulate and intelligent man; one prone to seeing patterns others don't, sure, but hardly the expected lunatic. Listen long enough and his arguments even start to make a certain sort of sense. It's enough to make you wonder if maybe, somewhere, there's some basis to what he's saying...\n\nAnd then he simply disappears. No word. No trace. Just gone.\n\nWhile one of the filmmaking duo is prepared to walk away, the other becomes obsessed. This should not be possible. People don't just disappear. Not unless someone wants them to. What if he was correct? What if he was on the verge of exposing some greater scheme? And what if he was taken? And so begins an obsessive effort to reconstruct his work, an effort that points the duo to a hidden society, a high powered retreat and networking organization for the political and business elite.\n\nA meticulously researched and cannily constructed bit of work, THE CONSPIRACY systematically blurs the lines between fact and fiction, deconstructing the distinction between facts and news, news and propaganda. Using one of the most persistent memes of our time – the conspiracy theory – to create a fact-based thriller, THE CONSPIRACY is more than just entertainment. It's a sly commentary on a world in which the medium really has become the message, a world in which the most important question is not \"What happened?\" but \"Who is telling us?\" (Todd Brown)",
    "directors": [
        "Christopher MacBride"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-conspiracy"
    },
    "runtime": 85,
    "synopsis": "Two young documentary filmmakers are drawn into a shadowy world of secret societies when the subject of their film simply disappears. Have his investigations led to his demise?",
    "title": "The Conspiracy",
    "year": 2012
}