{
    "countries": [],
    "description": "In 2005 a trio of directors combined to unleash one of the most deliriously silly, surreal, and psychedelic experiences ever witnessed on theater screens on to an unwitting audience. Loaded with absurdity and stylistic excess THE FUNKY FOREST was like a guided tour through the subconscious minds of its creators, a visual guide to the adolescent fantasies of a trio of immensely talented directors who refused to acknowledge any limitations whatsoever.\n\n\nAnd now one of them is back to do it again.\n\n\nEntirely self funded with money squirrelled away during a decade of directing high-end television commercials, Shunichiro Miki's THE WARPED FOREST will delight and confuse – and delightfully confuse – fans of the esoteric and strange. Follow the adventures of a young girl tracking down the elusive Pinky-Panky with her trusty penis-rifle at her side! Marvel at the normal sized girl working in a Very Small Shop! Wonder at the psychic powers of the inverted pyramid hovering deep in the nearby forest, the strange pod-like growths that pop up throughout and the furry, nipple sucking creature on hire at the local brothel!\n\n\nJust a touch less manic than its predecessor, THE WARPED FOREST is every bit as much a delicious sensory experience. There are narrative threads holding it all together, to be sure, but this is film as experience far more than film as story and what an experience it is. Fans of THE FUNKY FOREST will recognize Miki's distinctive touch immediately while those walking into this bizarre world for the first time will want to seek out that earlier effort immediately. (Todd Brown)",
    "directors": [
        "Shunichiro Miki"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-warped-forest"
    },
    "runtime": 81,
    "synopsis": "Shunichiro Miki delivers a shot of utter madness. Penis guns! Nipple monsters! A giant girl running a very small shop! This quasi-sequel to THE FUNKY FOREST more than lives up to the weird factor of its predecessor.",
    "title": "The Warped Forest",
    "year": 2011
}