{
    "countries": [],
    "description": "Stanley Kubrick's The Shining is less an adaptation of Stephen King's bestselling horror novel than a complete reimagining of it from the inside out. In King's book, the Overlook Hotel is a haunted place that takes possession of its off-season caretaker and provokes him to murderous rage against his wife and young son. Kubrick's movie is an existential Road Runner cartoon (his steadicam scurrying through the hotel's labyrinthine hallways), in which the cavernously empty spaces inside the Overlook mirror the emptiness in the soul of the blocked writer, who's settled in for a long winter's hibernation. As many have pointed out, King's protagonist goes mad, but Kubrick's Jack Torrance (Jack Nicholson) is Looney Tunes from the moment we meet him--all arching eyebrows and mischievous grin. (Both Nicholson and Shelley Duvall reach new levels of hysteria in their performances, driven to extremes by the director's fanatical demands for take after take after take.) The Shining is terrifying--but not in the way fans of the novel might expect. When it was redone as a TV miniseries (reportedly because of King's dissatisfaction with the Kubrick film), the famous topiary-animal attack (which was deemed impossible to film in 1980) was there--but the deeper horror was lost. Kubrick's The Shining gets under your skin and chills your bones; it stays with you, inhabits you, haunts you. And there's no place to hide...",
    "directors": [
        "Stanley Kubrick"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-shining-forwards-and-backwards"
    },
    "runtime": 142,
    "synopsis": "On Wednesday, March 9th, 2011, in Williamsburg, Brooklyn, The Spectacle Theater screened Stanley Kubrick's The Shining forwards and backwards simultaneously, superimposed. This experiment in projection was inspired by the analysis of The Shining by MSTRMND, and one line in particular: \"The Shining is a film meant to be watched both forwards and backwards\".",
    "title": "The Shining: Forwards and Backwards",
    "year": 1980
}