{
    "countries": [],
    "description": "Director Ronnie Thompson will be LIVE in attendance!\n\n\nIn the years following World War II, England, in a period of rebuilding constructed tower blocks, the forefathers of today's high-rise apartment buildings. Initially desirable for their excellent views, they have deteriorated in the years since their inception, becoming dirty, squalid low-cost housing riddled with crime. One such tower block is on the verge of demolition, with only the top floor of stubborn tenants remaining. The tenants are an odd bunch. There's Paul, the alcoholic. Jenny, the single mom who screams and beats her two kids just before hitting the clubs every night. Neville and Violet, the elderly couple. Daniel, the teenager addicted to video games who lives with his mom and dad. Mark and Gary, two gangster wannabe 20-something best mates sharing a flat. Kurtis, the local bad boy who shakes down each of the tenants for 20 quid a week as insurance so he won't break in and tear their flats to shreds. And finally Becky, the cute blonde girl with a good heart.\n\n\nOne night, a young man comes tearing through the top floor, screaming for help and banging on each door, only to be greeted by the sound of deadbolts slamming home and chains rattling across door frames as lights are switched off. His two assailants have little trouble rounding him and beating him senseless in front of one of the flats. Unable to ignore his screams for help any longer, Becky, the flat's occupant attempts to help, only to be beaten herself for her troubles. The assailants beat their victim to death and escape with ease. When the police arrive to question the tenants, they're met with the same closed doors and closed mouths that the victim found. A year later, the tenants wake up to find a killer has set up shop on a nearby rooftop, using a high-powered sniper riffle to pick them off one by one through the windows of their flats. Like so many cinematic groups before them, the tenants must band together to survive.\n\n\nTOWER BLOCK is a taut thriller with a score full of synth and bass underscoring the tension and frantic pace. While the story is basic, the execution is spot on avoiding many of the pitfalls to which similar thrillers succumb. The tension from the ever-present threat couples with the mystery of who and why to create a film fraught with peril and intrigue. Written by SEVERENCE scribe and friend of the fest, James Moran, TOWER BLOCK is a fast-paced tale of urban survival, pitting normal folks against a brutal and seemingly omnipotent foe. (Luke Mullen)",
    "directors": [
        "James Nunn",
        "Ronnie Thompson"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/tower-block"
    },
    "runtime": 87,
    "synopsis": "The last remaining tenants of a deteriorating, soon-to-be-demolished tower block must band together to survive when a killer with a high-powered sniper rifle starts picking them off through the windows of their flats.",
    "title": "Tower Block",
    "year": 2012
}