{
    "countries": [],
    "description": "Edgar is a prodigy, showing a vast proficiency for computer and mechanical engineering from a young age. Building on his natural talents through college, he emerged a genius, but like so many highly intelligent abstract thinkers, couldn't adjust to typical 9-5 work. When a terrible accident forces him to leave the country, he spends two years in Miami hatching a revenge plot to enact upon his return to Brazil.\n\nIn the tradition of great complicated crime thrillers, the most important pieces in the puzzle of TWO RABBITS are the players. The major player is Maicon, a local gangster kingpin, who has greased enough pockets to operate without interference from law enforcement. Then there are the brothers Geush, gay siblings making a fortune with their Shopping Network-style program, selling jewelry to old women over the phone. Their assistant Celia is the only person entrusted with the combination to the Geush's safe and her only vulnerability is her daughter, who is snatched in a scheme to convince Celia to steal from her employers. There's Julia, the young, beautiful prosecutor working her way up in the DA's office while feeding information to her husband Henrique, who just so happens to be a criminal lawyer with a single client...Maicon. And this is just the tip of the bloody iceberg.\n\nTWO RABBITS is a black comedy and a crime thriller where everyone has a price as well as a few skeletons in their closet. Corruption, kidnapping, and murder are all on the menu alongside traditional servings of sex, money and drugs. The film is hyper-stylized and lightning fast, but with a labyrinthine, darkly funny plot worthy of the Coen brothers. An odd mix to be sure, but writer/director Afonso Poyart manages to pull it off and make it look easy in the process, despite the fact that this is his first feature film. An impressive accomplishment, TWO RABBITS is exactly the type of off the radar gem you hope to discover at Fantastic Fest. (Luke Mullen)",
    "directors": [
        "Afonso Poyart"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/two-rabbits"
    },
    "runtime": 108,
    "synopsis": "Edgar returns to Brazil after two years in Miami, focused on enacting a complicated revenge plot and hoping to find absolution for his sins in the process.",
    "title": "Two Rabbits (Dois Coehlos)",
    "year": 2012
}