{
    "countries": [],
    "description": "You may only know Pang Ho Cheung from his famously over-the-top violent social commentary slasher DREAM HOUSE. While he has bounced around between genres, he certainly seems particularly at home working in comedy. From his breakout hit MEN SUDDENLY IN BLACK to LOVE IN A PUFF and its sequel LOVE IN THE BUFF he has proven time and again he has a slick sense of humor and a knack for satire. In his latest film, VULGARIA, he turns his wit towards the movie industry.\n\nChampan To plays To Wai Cheung, a movie producer invited to speak in front of a class of film students with the aim of explaining the hard sacrifices these unsung heroes of cinema must make. He relates the story of the making of his latest film and its roots in a deal with a gangster named Brother Tyrannosaur. Lacking money to pay the alimony needed to maintain shared custody of his daughter, To's desperation forces him to agree to Brother Tyrannosaur's demands that the movie be a sequel to a Shaw Brothers softcore and that he use original star Susan Shaw Yin Yin.\n\nTo's quest to make a movie is filled with obstacles at every corner- a lackluster assistant that sues him for sexual harassment, a director who turns his office into a Mahjohng parlor, a body double with whom he starts a relationship, cow vagina feasts, candy-coated fellatio and much more.\n\nWhile some of Pang stabs are at the Hong Kong movie industry in particular (with a direct target being the recent hit 3D SEX AND ZEN), one quickly realizes making fun of making movies is universally hilarious when done this well. In the end you'll agree with To, producers really are the all-important pubes in the filmmaking machine. (Brian Kelley)",
    "directors": [
        "Pang Ho-Cheung"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/vulgaria"
    },
    "runtime": 90,
    "synopsis": "What do pubic hair, pop rocks, cow vaginas and sex with mules have in common? They are all part of moviemaking in Hong Kong.",
    "title": "Vulgaria",
    "year": 2012
}