{
    "countries": [],
    "description": "Director Ted Kotcheff will be LIVE in attendance!\n\nWhen Mark Hartley's Oz-ploitation documentary NOT QUITE HOLLYWOOD was making the festival rounds a couple years back, there were many salacious titles that sent collectors scurrying for their P2P sites. But one in particular, one that Hartley claimed was the impetus for Australia's signature brand of outback horror, would prove especially elusive... until now! Long considered a lost film due to its unavailability on home video or broadcast, this new 35mm print from the National Film and Sound Archives of Australia lets contemporary audiences see why WAKE IN FRIGHT is such a pioneering cornerstone in the development of the Australian genre film.\n\nJohn Grant (Gary Bond) is a schoolteacher stationed reluctantly in a desolate outback town. As the Christmas holiday approaches, his dreams of a surfing vacation back in Sydney with his beach-bunny girlfriend are disrupted when he stops over for the night in the one-horse mining community of Bundanyabba , or \"the Yabba\" — a town that won't be so easy to leave. It's clear from the outset that the Yabba moves to its own rules and rhythms, a rhythm punctuated by the sputtering of draught pumps, clinking beer glasses, the ringing of cash registers and gruff, bawdy sing-songs. John's determination to remain aloof is challenged at every turn by sweaty country folk for whom not sharing in loud displays of drunken idiocy is considered a grave slight. When he relents, participating in a penny-tossing gambling match in which he quickly loses all his money, he finds himself at the mercy of the town's \"aggressive hospitality,\" effectively stranded there. He falls in with the town's most boisterous good ol' boys, including then-unknown Jack Thompson (on the verge of regional stardom) and a disturbingly sex-obsessed Donald Pleasence. During one of many drunken binges, John brags about being a target-shooting medalist, which leads to the film's epic, highly controversial kangaroo-hunting sequence, which utilizes graphic footage from an actual licensed pursuit. While dread is palpable throughout the film, it is through these scenes that John's physical and moral degradation is cemented. (Kier-la Janisse)",
    "directors": [
        "Ted Kotcheff"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/wake-in-fright"
    },
    "runtime": 114,
    "synopsis": "A Palme D'Or nominee based on the 1961 book of the same name by Kenneth Cook and directed by FIRST BLOOD's Ted Kotcheff, a relatively new director at the time, WAKE IN FRIGHT is an uncompromisingly brutal look at what happens when men are left alone together in the country with guns and a lot of beer. This is going to be a mind-blower on the big screen. Get ready.",
    "title": "Wake in Fright",
    "year": 1971
}