{
    "countries": [],
    "description": "Step aside Dirk Gently, there's a new private eye in town. There's no case too big, too small or too odd for Young Gun. The frizzy haired, wispy moustached, Hawaiian shirted PI takes his work seriously. Pay no mind to his tarted up secretary/taskmaster or to the fact that his master of gadgets also happens to run a sex shop. Ignore also that his choice of attire hints at a deep admiration for MAGNUM PI. When you hire Young Gun the job gets done.\n\n\nWhich is precisely why Song Hyun – a cute young museum researcher – wants to hire him. There's a watch that needs finding and it's possessor needs killing. He turns the girl down of course – Young Gun is no hitman – but his curiosity is piqued enough for Young Gun to follow Song out of the office, witnessing her attempted kidnapping and subsequent death in the street. But when he visits the museum where Song works, Young Gun finds her there very much alive. Clearly there is only one explanation: The Song who came to Young Gun's office was a future Song, having traveled back in time. And that seals it. Young Gun is on the job.\n\n\nDirector Oh Young-doo created something of a sensation with his debut feature, a sci-fi comedy titled INVASION OF ALIEN BIKINI that won acclaim and awards around the world despite being shot on a budget of just five thousand dollars. Bigger job offers rolled in following the success of BIKINI but Oh turned them all down, preferring to tell his own stories with his own cast and crew. Having boosted the budget of his sophomore film up to a whopping thirty grand Oh has brought back the entire ALIEN BIKINI cast for a rollicking, incredibly ambitious second go-round that firmly cements his reputation as an auteur of low budget sci-fi. While the budget may be small the ideas and talent are huge. (Todd Brown)",
    "directors": [
        "Oh Young Doo"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/young-guns-in-the-time"
    },
    "runtime": 95,
    "synopsis": "The director of INVASION OF ALIEN BIKINI returns with a quirky, low budget time travel romp filled with sex shops, robot hands and Hawaiian shirts.",
    "title": "Young Gun in the Time",
    "year": 2012
}