{
    "countries": [
        "United Kingdom"
    ],
    "description": "Bros — one of the biggest English bands of the 1980s — was the classic pop star story: A meteoric rise with a #1 album that sold over 10 million copies followed by sell-out stadium tours, and then by their decline amid disagreements, arguments, and fractured relationships.\n\nNow over twenty years later, Luke and Matt Goss agree to reunite for a very special gig at the 02 in London. But first they have to contend with each other, their past, the issues that drove them apart in the first place, and much more.\n\nAFTER THE SCREAMING STOPS is the kind of pop band documentary that bends the genre in such a way that it's impossible not to take notice, whether you were a fan of the band or not. At its center are two charismatic and diametrically opposed brothers, Matt and Luke Goss. Both men have forged well-earned careers after the band dissolved, and are in turns charming, funny, ridiculous, and heartfelt.\n\nIt's their unique charisma that gives the film a momentum that others of its ilk lack. Their reunion after so many years, their philosophies on life, and the story of Bros are perhaps the most fascinating pop story never told.\n\nDon't worry if you've never heard of Bros. There's never been a band quite like them, and this film is your opportunity to experience the brothers at their best. Hear their stories, their outrageous philosophies, and the very human experiences they put on the screen, no-holds-barred, and emerge from the film a newly declared fan. (EVRIM ERSOY)\n\nWith Directors Joe Pearlman and David Soutar in Attendance.",
    "directors": [
        "Joe Pearlman",
        "David Soutar"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/after-the-screaming-stops"
    },
    "runtime": 97,
    "synopsis": "Matt and Luke Goss were part of Bros, one of the biggest bands of the 1980s. With a number one album and sold out concerts at stadiums across the world, the rise of the band was meteoric... sharply followed by their downfall. Now, the two brothers reunite for the gig of a lifetime, facing fractured relationships, a new musical landscape, and the changes that time brings. Can they rekindle the magic and make Bros come alive once again?",
    "title": "After the Screaming Stops",
    "year": 2018
}