{
    "countries": [
        "France"
    ],
    "description": "ALL THE GODS IN THE SKY is the feature length version of Quarxx's short film A NEARLY PERFECT BLUE SKY, which was selected at Sundance in 2017 and garnered awards all over the world. It's also his first feature film, and it sets its sights on establishing him as a solid player in the genre film industry.\n\nWhile working on a La Reunion photo report in 2012, Quarxx stumbled upon a scene that became the inspiration for the film: a brother who had been lying next to his dead sister for three weeks. While not the subject of the film, the devotion and implied remorse of that image is the emotional core that Quarxx explores. Beginning with an opening scene that will both shock and baffle, the director takes us on a journey of a man plagued by guilt and slowly losing his grip on reality.\n\nConvinced that he was abducted by aliens in his childhood, Simon is waiting for the day they will return to release him and his sister Estelle from their suffering. His behavior starts to worry his coworkers at the factory, resulting in his demotion, but he never stops caring for Estelle. While his methods may be questioned, he dearly loves his sister whose physical state is the consequence of a stupid game they played as children.\n\nWith her very peculiar physique due to a rare genetic disorder, model Melanie Gaydos — making her film debut — is fantastic despite being immobile for most of the film. Quarxx searched for two years to find just the right actress, a testament to his perfectionism. The production design and the cinematography are equally amazing, and the film is produced by FF alum François Cognard (AMER; LET THE CORPSES TAN), a man who has a sharp eye for talent.\n\nWith imagery that will blow your mind, mixing science fiction and drama, ALL THE GODS IN THE SKY is a dark tale of brotherly love, paranoia, and the burden of responsibility that will unsettle and surprise you on many levels. (ANNICK MAHNERT)\n\nWith Director Quarxx in Attendance.",
    "directors": [
        "Quarxx"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/all-the-gods-in-the-sky"
    },
    "runtime": 98,
    "synopsis": "Simon lives in an old house in the countryside with his severely disabled sister. He takes care of her day after day, hoping that \"they\" will come to ease their pain. The date of \"their\" arrival approaches.",
    "title": "All the Gods in the Sky",
    "year": 2018
}