{
    "countries": [
        "United States"
    ],
    "description": "We've all seen or heard of the insanity and one-of-a-kind experience that was THE GREASY STRANGLER,the extremely gross and inherently Fantastic Fest-ish movie that received ovations when screened in 2016. Jim Hosking is back with a second feature that maintains his trademarked preposterous comedy, but tones down the grease for more emotional depth, and will please the fans of his unique voice.\n\nLulu Danger (Aubrey Plaza, goofy and touching) is deeply unsatisfied with her mundane life; one could even call her desperate. She's just been sacked from her waitressing job by her own husband Shane (Emile Hirsch, real-life cartoon villain) and her home life is not faring any better. In a misguided attempt to get them out of financial trouble, Shane asks his Stooges-esque co-workers to help him rob Lulu's brother, only to become the target of the world's saddest hitman (Jemaine Clement, just plain awkward). But Lulu, awakened by the mysterious return of a past flame, the titular Beverly Luff Linn (Craig Robinson, mainly grunting), turns the tables on them and flees with the hitman and the cash to attend Beverly's mysterious show.\n\nAN EVENING WITH BEVERLY LUFF LINN (in two words, please) is a delight of offbeat, deadpan humor delivered by a troop of seasoned comedians. What makes it most delightful is that everyone acts as if it all were perfectly normal, and these events just happen as a matter of course. The gallery of quirky personas are so out of place that they create their own universe (augmented by the eclectic score and tacky décor), as they remain steadfastly in character and committed to the gag. They're clearly having the time of their lives, but the absurd humor is also a way to underline how utterly alone and in want of emotional connection every single one of them is...and their plight is very much our own. (SONIA DROULHIOLE)\n\nWith Director Jim Hosking and Writer David Wike in Attendance for 1st half.",
    "directors": [
        "Jim Hosking"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/an-evening-with-beverly-luff-linn"
    },
    "runtime": 108,
    "synopsis": "Fantastic Fest alumni director Jim Hosking (THE GREASY STRANGLER; RENEGADES) is back with a second feature as absurd, crazy, and funny as his first. Follow Lulu Danger's very own revolution in a Lynch-meets-Waters run-down version of America.",
    "title": "An Evening with Beverly Luff Linn",
    "year": 2018
}