{
    "countries": [
        "United Kingdom"
    ],
    "description": "Thomas may hate his father, but his love for his sister Jennifer has never wavered. Upon learning that she's been kidnapped for ransom, Thomas finally returns home to face his father. Finding him too broken to handle the situation, he makes his way to the remote island of Erisden. The island is home to a mysterious cult that worships \"the Goddess\" of the land who speaks to them through Her chosen prophet, Malcolm. But before boarding the boat, Thomas switches his ticket with another man: an instinctive move that allows him to arrive undetected and stay in hiding.\n\nUpon arrival in Erisden, Thomas finds a pseudo-socialist society, a place that supposedly advocates freedom and equality, with no currency and shared work. But as with all communities, it's poisoned by the all-too-human instincts of greed, envy, and lust for power, failings that are spreading like a cancer. It's that very cancer that makes Erisden such a dangerous place and threatens its very existence. While Thomas carefully searches this cesspool for his sister, Malcolm and his cohorts search for Thomas in a tantalizing cat and mouse game with devastating consequences.\n\nThe name Gareth Evans should be well known to our Fantastic Fest audience by now. The master writer, director and editor behind such titles as MERANTAU, THE RAID, and THE RAID 2, as well as a particularly relevant segment from V/H/S/2, is back with his latest, working in English for the first time since his debut film. The cinematography by Matt Flannery is simply gorgeous and the attention to detail in the Edwardian period production design is incredible, allowing the audience to believe what they see and lose themselves in the story. Evans shows a steady hand and a clear aptitude for more than just amazing action sequences, but don't worry — the film has its fair share of action, with Evans' trademark style and shocking brutality. Featuring powerhouse performances from Dan Stevens and Michael Sheen and an intriguing score by Fajar Yuskemal and Aria Prayogi, APOSTLE is an enigmatic and riveting tour de force, a visceral shock to the senses that will knock you on your ass. (LUKE MULLEN)\n\nWith Writer/Director Gareth Evans in Attendance for 1st half.",
    "directors": [
        "Gareth Evans"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/apostle"
    },
    "runtime": 129,
    "synopsis": "The year is 1905. Thomas Richardson travels to a remote island to rescue his sister after she's kidnapped by a mysterious religious cult demanding a ransom for her safe return. It soon becomes clear that the cult will regret the day it baited this man, as he digs deeper and deeper into the secrets and lies upon which the commune is built.",
    "title": "Apostle",
    "year": 2018
}