{
    "countries": [
        "Republic of Korea"
    ],
    "description": "Very loosely based on a famous Chinese tale, Kim Ki-young's work chronicles the movements and misdeeds of Ban Geum-ryeon, a woman withering away in a marriage to an older man. Her fate changes when the already married Moon-kyung wins a mahjong bet which nets him another man's fortune and ten wives, with Geum-ryeon thrown in to boot. Moon-kyung is quickly infatuated with the sensual Geum-ryeon, but with many other women in the household vying for his affections, it isn't long until the manor runs crimson.\n\nKnown for all-time Korean classics THE HOUSEMAID, THE INSECT WOMAN and IEOH ISLAND, Kim took his biggest gamble when the big-budget BAN GEUM-RYEON went into production in the mid-1970s. After years of on-and-off filming and several more battling censors, the film was finally revealed in 1981, albeit with 40 minutes shorn by overzealous government censors. With Kim's original version lost forever, we can now only show the 95-minute cut of BAN GEUM-RYEON. We're not sure which scenes are missing (though they leave some leaps of logic in their wake), but considering what does remain, we wonder exactly how far a director would need to go to upset a 1980s Korean censor. As things stand, we have cats murdering babies and some good old-fashioned dungeon torture.\n\nKim employs resplendent sets throughout, full of deep primary colors and dark shadows, but what makes the film really pop is his visual signature. BAN GEUM-RYEON boasts extraordinary framing, with a roving camera that snakes left and right and juts in and out, spying carefully placed details in the mise-en-scène, and noting the meticulous blocking as characters are juxtaposed to accentuate the gorgeous, terrifying, or hilarious pieces of Kim's unique period psychological puzzle. Come discover the work of the man that turned Park Chan-wook into a fanboy during this ultra-rare screening, in a beautiful 35mm print to boot! (PIERCE CONRAN)\n\nThank you to our sponsor HI-YAH! — your new favorite martial arts and action movie channel, from your friends at Well Go USA.",
    "directors": [
        "KIM Ki-young"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/ban-geum-ryeon"
    },
    "runtime": 90,
    "synopsis": "From Park Chan-wook's idol comes a twisted tale of lecherous lords and murderous mistresses. Presented outside of Korea for only the second time, Kim Ki-young's masterpiece BAN GEUM-RYEON is a lush smorgasbord from Korea's most demented cinematic mind.",
    "title": "Ban Geum-Ryeon",
    "year": 1981
}