{
    "countries": [
        "United States"
    ],
    "description": "Fantastic Fest doesn't shy away from the strange and unusual. In fact, we love to embrace cinema that so defies all tradition and expectations that audiences are left with their jaws on the floor. Now, take that jaw-dropping film and add the words \"Nicolas\" and \"Cage,\" and Maria Pulera's second feature takes its unconventional narrative to heights that few other films can aspire to.\n\nCage plays Joe, a down-on-his-luck trucker haunted by the recent deaths of his wife and daughter. Joe seemingly rescues Julie (Franka Potente) at a truck stop, but she reveals that he has actually interfered in her saving her injured daughter. Julie, it turns out, has the ability to send her spirit between this world and the next, and Joe stopped her from finding her daughter's spirit and guiding it back. As Julie's daughter slips into a coma, she and Joe comfort each other in ways that don't exactly sit well with Joe's dead wife, Mary. When Julie again tries to help her daughter by entering the spirit world, Mary takes the opportunity to come back from the other side and settle a few scores with her husband.\n\nTrust me when I say I haven't outlined even half the insanity that's unleashed in BETWEEN WORLDS, and whatever praise I give to Cage and the rest of the cast isn't enough to actually encompass what they bring to this film. Everyone follows Cage's lead and goes full-tilt, giving Pulera's unique movie a once-in-a-lifetime feel. We all know Cage is a fearless actor who isn't afraid to take the chances we rarely see with other commercially successful performers. From LEAVING LAS VEGAS to BAD LIEUTENANT to MANDY, Cage has given it all and then some. That said, BETWEEN WORLDS is Cage beyond anything we've seen before. (JAMES EMANUEL SHAPIRO)",
    "directors": [
        "Maria Pulera"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/between-worlds"
    },
    "runtime": 90,
    "synopsis": "Nicolas Cage plays Joe, a lonely trucker whose new girlfriend's daughter is possessed with the spirit of Joe's recently deceased wife, creating a love triangle no synopsis can do justice to.",
    "title": "Between Worlds",
    "year": 2018
}