{
    "countries": [
        "United States"
    ],
    "description": "What if Robert Altman made a shot-on-video slasher instead of NASHVILLE? Wonder no more!\n\nBLOOD LAKE is the most fascinating — and stupefying — horror movie that ever escaped from 1987. Like SLEDGEHAMMER before it, this movie documents a group of unhinged party animals as they embark on a weekend trip filled with Jet Skis, a keg of Busch, and an extended game of quarters. But look out! There's a supernatural killer on the loose who wears cowboy boots and a silk shirt with a rose stitched on it! The motive for the gory killings? Real estate debt. Yes, you read that right — people are being murdered because someone has anxiety about their unpaid bills. And then there's Lil' Tony, played by Travis Krasser. Lil' Tony is an adolescent horn-dog with a 12\" mullet. Whenever he speaks (\"I choose you as my sex partner!\"), you'll wish you were smoking weed on a paddle boat with him, just like in the movie!\n\nMade by real-life friends from Oklahoma on a real-life vacation, BLOOD LAKE is a rewardingly lethal collision of '80s slasher video-vomit and twisted cinéma vérité madness. From false metal soundtrack hits like \"Thru-Out The Nite\" and \"Was It Real\" to gratuitous scenes of people sleeping, this might be the only movie in history capable of receiving a stamp of approval from both David Lee Roth and Andy Warhol.\n\nUndoubtedly, you will have questions after (maybe) surviving the trip to BLOOD LAKE. You're in luck! At this screening, Doug Barry, the producer-writer-star of the movie, will join us in person for a Q&A! (JOSEPH A. ZIEMBA)\n\nWith Director Tim Boggs and Producer Doug Barry in Attendance.",
    "directors": [
        "Tim Boggs"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/blood-lake-presented-by-agfa-and-bleeding-skull"
    },
    "runtime": 82,
    "synopsis": "The finest vacation from hell ever captured on VHS, rescued from the original 1\" master tapes!",
    "title": "Blood Lake - Presented by Agfa and Bleeding Skull",
    "year": 1987
}