{
    "countries": [
        "United States"
    ],
    "description": "Seann William Scott (GOON; AMERICAN PIE) goes full psychopath in BLOODLINE, the latest thriller from Blumhouse Productions and director Henry Jacobson. Evan Cole has a seemingly perfect life: a loving wife, a healthy baby boy, and a meaningful job as a social worker for troubled teens. But Evan has a secret — he violently tortures and kills those who lack his wholesome family values, specifically the family members causing problems for his patients. He hides his compulsion from his wife and son, but concealing his true nature from his overbearing, ever-present mother is harder.\n\nFor a while, things work out quite conveniently for Evan. A sleek white mansion sits empty and available for Evan's murderous rendezvous, his students' problematic family members make themselves easily accessible and readily disposable, and his wife exhibits unending patience for his recurring late-night drives, never questioning her husband's actions… until an observant detective catches a pattern in the killings that leads him to Evan's doorstep.\n\nWhile a relatively simple concept on the surface, the film is elevated by heightened stylistic flourishes. Colorful lighting mirrors shifting moods, murderous close-ups from the killer's perspective echo giallo thrillers, and a pulsating synth score drives every crucial scene. All of this combined with a clever script functioning within its own surreal logic creates a melodramatic spectacle that is juicy, absorbing, twist-filled fun from the very first scene.\n\nSeann William Scott is clearly having a blast playing against type in this role, maintaining a careful balance between buttoned up family man and deranged serial killer. There's also no shortage of arterial splatter and shocking violence in this moody, entertaining, and meticulously crafted thriller about the lengths some people will go to in order to protect their families. (LOGAN TAYLOR)\n\nWith Director Henry Jacobson, Producer Adam Hendricks, and Writer Avra Fox-Lerner in Attendance.",
    "directors": [
        "Henry Jacobson"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/bloodline"
    },
    "runtime": 95,
    "synopsis": "Evan (Seann William Scott) values family above all else, and anyone who gets between him, his wife, and newborn son learns that the hard way. But when it comes to violent tendencies, it seems the apple doesn't fall far from the tree.",
    "title": "Bloodline",
    "year": 2018
}