{
    "countries": [
        "Sweden",
        "Denmark"
    ],
    "description": "Every year, Fantastic Fest is privileged to present a film which can only be described as the genre discovery of the year. HEREDITARY looked to be this year's big splash, but Sundance debuted it January — and opened the film to great success this summer — preventing it from being featured in this year's lineup. That's okay though, because we have something that'll equally knock the festival crowd through the back of the theater.\n\nBORDER had pinged on our radar a bit before Cannes, and we were intrigued when it was selected to play in their Un Certain Regard section. Once we read the logline, it went immediately to the top of our must-see lists. After watching it (and in some cases, watching it again!), it was apparent that 2018 was going to have two major genre discoveries, and this one we absolutely had to bring to our audiences.\n\nHonestly, the less I say about BORDER, the better. Its wonders, twists, and highs are best experienced going in completely blind. But don't let the lack of details deter you; this film is going to explode out of the fall festival circuit. The comparisons to LET THE RIGHT ONE IN are inevitable — in no small part because both films share a screenwriter, as well as an author (John Ajvide Lindqvist wrote the short story BORDER is based on, and the novel that was adapted into LET THE RIGHT ONE IN) — but knowing fans won't dismiss the comparison as wishful hyperbole.\n\nIT FOLLOWS, THE WITCH, GOODNIGHT MOMMY… almost every year there is one film that crosses over and takes both genre fans and mainstream cinema by storm. These features get their start at festivals like Cannes and Sundance and are amplified by Fantastic Fest. HEREDITARY was that film for the first half of 2018. For the second half of 2018, that film is Ali Abbasi's incredible BORDER. Don't miss it. (JAMES EMANUEL SHAPIRO)",
    "directors": [
        "Ali Abbasi"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/border"
    },
    "runtime": 108,
    "synopsis": "When a border guard with a sixth sense for identifying smugglers encounters the first person she cannot prove is guilty, she is forced to confront terrifying revelations about herself and humankind.",
    "title": "Border",
    "year": 2018
}