{
    "countries": [
        "Republic of Korea"
    ],
    "description": "Each year at Cannes, Screen International gathers a collection of critics from all over the world and asks them to grade every film in competition. They average the scores together and publish what's known as the \"Critics Grid\" so their readers can get an idea of what favorites are emerging for the Palme d'Or.\n\nThis year, Lee Chang-dong's BURNING scored the highest ever in the history of Screen International's Critics Grid with a score of 3.8 out of four. Even though the jury gave the Palme to master filmmaker Hirokazu Kore-eda for his film SHOPLIFTERS, the mark that BURNING had left on the festival and the audience was profound.\n\nBased on Haruki Murakami's short story, BURNING follows struggling writer Lee (Yoo Ah-in) as he becomes fascinated by former classmate Haemi (first-timer Jeon Jong-seo). When she travels to Africa, Lee watches her cat and is taken aback when Haemi returns with a new suitor, Ben (Steven Yeun from THE WALKING DEAD). Ben's rich and privileged, aloof and unemotional. \"He's the Great Gatsby,\" Lee warns Haemi, and he's right. But Ben isn't driving a wedge between Haemi and Lee so much as Haemi is building a link between the two men, so by the time Lee Chang-dong reveals what the film's true intentions are, the audience is as obsessed with Ben as Lee is.\n\nBURNING may not have won Cannes, but it won Cannes over. Lee Chang-dong's psychological thriller is one of the best in world genre cinema this year and one of the must-see titles at Fantastic Fest. (JAMES EMANUEL SHAPIRO)\n\nWith Actor Steven Yeun in Attendance for 1st half.",
    "directors": [
        "LEE Chang-dong"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/burning"
    },
    "runtime": 148,
    "synopsis": "Lee Chang-dong's latest triumph weighs the delicate balance between creation and destruction as a writer runs into an old classmate who gets him caught up in a mystery bigger than both of them.",
    "title": "Burning",
    "year": 2018
}