{
    "countries": [
        "United States"
    ],
    "description": "Daniel Goldhaber's feature debut, CAM, is the kind of twisty, sexy, enigma of a movie we love to screen at Fantastic Fest. The film stars the revelatory Madeline Brewer (ORANGE IS THE NEW BLACK; THE HANDMAID'S TALE) as Alice, a rising young star in webcam pornography. Alice wants nothing more than to break the top ten ranking of camgirls in her network, concocting outrageous and original narratives for each of her live shows to slowly climb in popularity and prestige. But Alice has three rules: she doesn't do public shows, she doesn't fake her orgasms, and she doesn't mislead her \"Johns\" with promises of love or in-person affection. Instead, she succeeds through sheer willpower and infectious optimism.\n\nIt's impossible not to be charmed by Alice, who despite her risqué career path maintains an innocent worldview, close relationship with her mother and younger brother, and supportive network of camgirl friends. She's effervescent and warm and full of ambition — sex work simply seems like the easiest way to break away from the the small-town fate those around her have succumbed to. But one day, Alice wakes to find another girl who looks just like her has commandeered her cam channel and username, and this girl has no rules or boundaries. Alice wants nothing more than to take back her page and her life before it's too late to save either.\n\nWhat follows is a neon-soaked thrillride complete with mistaken identities, cyberstalkers, and web-based psychological warfare. Goldhaber's debut combines kinetic visual style, a pounding techno score, and an unfaltering performance by Brewer to make CAM an unforgettable journey into the depths of the modern-day sex industry. Even more importantly, Goldhaber and screenwriter Isa Mazzei (the latter drawing from her own experience in the camming industry) upend any preconceived notions audiences may have about women in the sex industry, allowing us a sympathetic view of an oft-maligned community. Don't swipe left on this provocative, female-driven tale of digital-age madness sure to be talked about long after the credits roll. (LOGAN TAYLOR)\n\nWith Director Daniel Goldhaber and Writer/Producer Isa Mazzei in Attendance.",
    "directors": [
        "Daniel Goldhaber"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/cam"
    },
    "runtime": 94,
    "synopsis": "Alice is a camgirl with principles. She doesn't do public shows, she doesn't tell her fans she loves them, and she doesn't fake her orgasms. But when a mysterious lookalike takes over her channel, the rules no longer apply.",
    "title": "Cam",
    "year": 2018
}