{
    "countries": [
        "United States"
    ],
    "description": "In CHAINED FOR LIFE's movie-within-a-movie, Mabel (Jess Weixler, TEETH) plays a blind woman and Rosenthal (Adam Pearson, UNDER THE SKIN) is the man with a unique face with whom she falls in love. In the real world of CHAINED FOR LIFE, Mabel has her sight but Rosenthal retains the same distinct features (Pearson has neurofibromatosis); both have been hired for the way they look. As their onscreen characters embark on a twisted and tragic romance in the hands of Herr Director (HOOK's Charlie Korsmo, unrecognizable and rocking a dead-on Herzog voice impersonation), Mabel and Rosenthal develop a special relationship off-camera as they challenge each other to grow as individuals.\n\nWriter/director Aaron Schimberg (who has undergone dozens of reconstructive surgeries throughout his life to address a bilateral cleft palate) has crafted a wholly original, marvelously layered and deeply touching examination of how we define and idolize beauty, and use art as a proxy for our feelings about physical differences. Cinematographer Adam J. Minnick's striking Super-16mm photography adds a grainy, dreamlike quality to a film already unconcerned with following traditional narrative structures. In parallel to the shooting of the horror film that brings these characters together, the lines between reality and movie are increasingly blurred. The group of physically distinctive actors are forced to sleep in the hospital used for filming as the hotel in which the rest of cast sleeps is not \"handicap accessible\" and, left to themselves, they take over the narrative with a mixture of fantasy and storytelling.\n\nCHAINED FOR LIFE is awash in a strangely comforting melancholy, but is often very funny and always profoundly human as it challenges us to have difficult conversations about inclusivity and portrayal. It is when we are open to hearing and listening to the voices of the marginalized — their representation having been limited by pre-defined and deeply ingrained notions of beauty — that we are given the gift of films, like CHAINED FOR LIFE, that are truly fantastic. (BRIAN KELLEY)\n\nWith Director Aaron Schimberg and Director of Photography Adam Minnick in Attendance.",
    "directors": [
        "Aaron Schimberg"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/chained-for-life"
    },
    "runtime": 91,
    "synopsis": "Mabel (Jess Weixler, TEETH) and Rosenthal (Adam Pearson, UNDER THE SKIN) — both hired for their looks — meet on the set of a horror movie in this surreal examination of how those with physical differences are portrayed on film.",
    "title": "Chained for Life",
    "year": 2018
}