{
    "countries": [
        "France"
    ],
    "description": "Anyone familiar with Gaspar Noé's filmography knows generally what they're in for with his newest feature CLIMAX. Like his previous works, CLIMAX is a neon-soaked dreamscape of sex, violence, drugs, bold graphics, and catchy techno. Twenty young, lithe, sex-charged hip-hop dancers have been cooped up together for three days, choreographing a performance that we get to see in its swirling, mesmerizing entirety. The dancers celebrate their hard work with an all-night bacchanalia, complete with plenty of flirtation, coke, and sangria. But someone has put something in the sangria, and from the moment it hits, the party falls into distrust and chaos.\n\nThe film opens and closes in a snowy, empty landscape, but everything between takes place in a claustrophobic abandoned boarding school with endless, twisting, mysterious hallways reminiscent of Stanley Kubrick's THE SHINING. The twenty dancers, almost all of whom are played by nonprofessional actors discovered in Parisian dance clubs and YouTube videos, are diverse not only in who they are, but what they want and how they go about getting it. They also each have their own neuroses and insecurities, slowly unveiled to the audience through raw, mostly improvised conversations. Even before the sangria kicks in, tensions are high.\n\nNoé artfully places us among dancers with his penetrative camerawork, swirling in rhythm with their bodies and capturing their movements in a combination of lustful close-ups and kaleidoscopic, Busby Berkeley-esque arrangements. Dancers — artists that inhabit their bodies fully and consciously — are the perfect subject for Noé's newest exploration of insanity. We feel intimately the changes that come over them; their early sexual energy slowly builds into an anxiety reminiscent of the worst trip you can imagine, gradually taking hold of each body in varying forms of contortion and demonic possession. Not since William Friedkin's THE EXORCIST and Andrzej Zulawski's POSSESSION has the physical body been host to more shocking transformations. Sofia Boutella's captivating lead performance anchors the otherwise inexperienced (but nonetheless enthralling) cast, and she eventually becomes the audience's surrogate witness to the mayhem.\n\nWith its raw, improvisational style, ambitiously long single takes, obsessively catchy French-techno score and stunning camerawork, CLIMAX is Gaspar Noé's unrivaled masterpiece. (LOGAN TAYLOR)",
    "directors": [
        "Gaspar Noé"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/climax"
    },
    "runtime": 96,
    "synopsis": "Consistent provocateur Gaspar Noé outdoes himself with his latest feature CLIMAX, a trippy horror-musical featuring twenty sensuous dancers partying hard and living their best lives, until a bad batch of sangria plunges them into insanity.",
    "title": "Climax",
    "year": 2018
}