{
    "countries": [
        "France"
    ],
    "description": "Driss, Manuel and Imrane come from the same Parisian suburb — born and raised in the vertical concrete jungle called \"la cité\" — but their paths forked along the way. Driss (Reda Kateb) became a cop in the narcotics department, using his knowledge and connections to advance, while Manuel (Matthias Schoenaerts) and Imrane (Adel Bencherif) started working for the local drug kingpin. Driss has built his life on the rejection of his upbringing, evidenced both in how he raises his daughter and his commitment to bringing down the drug trafficking gangs. Manuel, separated from his wife and son, has the roguish charm of the small-time thug that became exactly what his peers expected of him.\n\nAs Manuel and Imrane prepare for their biggest drug deal yet, tragedy strikes. Manuel barely escapes with his his life, ends up under a cloud of suspicion, and swears to avenge his friend. Teaming up with Driss to uncover what really happened, it becomes clear they might not be ready for the truth behind it all.\n\nDavid Oelhoffen, the pen behind L'AFFAIRE SK1, tells us a story not about what's right and what's wrong, but about the concept of heritage and what ties a family together. Oelhoffen guides his actors on a nuanced emotional journey as they learn how hard it is to escape where you were born, and how far you might go to defend your family. The film opens and closes in the same parking lot surrounded by the towers of \"la cité.\" Those towers frame the lot, frame the film, and even frame their lives, forming the arena of their tragedies where every sound of the city echoes and submerges us into the raw brutality of their lives. (SONIA DROULHIOLE)",
    "directors": [
        "David Oelhoffen"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/close-enemies"
    },
    "runtime": 111,
    "synopsis": "A gangster film with heart, CLOSE ENEMIES refers to Driss and Manuel, childhood friends now on either side of the law, who discover the sacrifices both are willing to make in the name of family in this Paris-set contemporary thriller.",
    "title": "Close Enemies",
    "year": 2018
}