{
    "countries": [
        "Tunisia"
    ],
    "description": "Tunisia, modern day. Death seems a constant companion to Yasmin; her parents are dead, her grandfather ritually embalms those who passed, and she is plagued by nightmares of a woman in black. But she's not one to shy away from a challenge.\n\nTwo university classmates, Walid and Bilel, are given the assignment to produce an exclusive investigation report for their year-end assignment. Bilel suggests Mongia, a suspected witch found naked and mutilated by the highway 25 years ago. While it's a cold case now, Bilel has access to the asylum where she's kept. Following a harrowing meeting with her, they pinpoint where she was discovered and make their way into a remote forest. There, they discover an isolated archaic village filled with mute women, one pigeon-eating child, chunks of hanging meat, and an impressive amount of goats. Something's very not right. Once the overly sympathetic cult leader forces them to stay the night, the friends quickly realize the danger is real, it links to Yasmin's past, and that they may not make it out alive.\n\nFor his first feature — which is also the first horror film to come out of Tunisia (no small feat) — Abdelhamid Bouchnak wanted to scare but also denounce. A great student of the most twisted sides of human nature, he calls out witchcraft and cannibalism as the most universally extreme practices — ones that still exist today and are seeing a revival in Northern Africa, where children are disappearing.\n\nHe decided to use a very traditional three-act structure but subvert it with quaint visual tropes and a very peculiar way of filming that alternatively pulls you in and out, closer or further away from the characters. This specific technique, resulting in an oversaturation of the senses, reinforces the vivid scenery and dreary atmosphere, and helps shape a tale engrained in local traditions and rituals, infused with unflinching poetry, unlike any you've seen before. (SONIA DROULHIOLE)\n\nWith Director Abdelhamid Bouchnak and Cinematographer Hatem Nechi in Attendance for 2nd half.",
    "directors": [
        "Abdelhamid Bouchnak"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/dachra"
    },
    "runtime": 113,
    "synopsis": "Come for Tunisia's first horror film, following three students' filmed investigation of weird rumors in a remote village, and stay for the sickening madness, macabre witchcraft, ghastly beheadings, and gory cannibalism.",
    "title": "Dachra",
    "year": 2018
}