{
    "countries": [
        "France"
    ],
    "description": "I was 15 years old when DEADLY GAMES (3615 CODE PÈRE NOËL) was released in theaters and on that day I saw the film three times in a row at the local cinema. I couldn't believe what I was seeing: a genre film where a kid turns into a warrior to save himself from an intruder dressed as Santa. 3615 had a huge impact on a whole generation of filmmakers in Europe because René Manzor, the director, broke a taboo. Christmas is a holy event — you don't degrade it and you definitely don't turn it into a nightmare. Manzor's Santa Claus, although not necessarily a bad guy at the start, turns into a boogeyman who robs a 9-year old of his childhood.\n\nThe Minitel, a basic version of the internet, was invented in France in the '80s and allowed access to commercial and private addresses, along with chat rooms. The code to access some of these services was \"3615\" and then the name of the company. The Minitel died in 2012, replaced by the internet as we know it, but while it lasted it was an awesome tool. Yet, as always with technology, it can be misused. Manzor had the perfect evil tool and made a brilliant job turning it into a kid's worst nightmare.\n\nThomas is a 9-year-old whose mom is the CEO of a toy store. The lucky kid gets to try all the toys and transforms his home into a battlefield where he chases his dog JR around and treats his grandpa as a prisoner. With his mom not coming home for Christmas night, he logs onto the Minitel and starts chatting with Santa, inviting him to visit — with fatal consequences.\n\nI have to mention that this film is a family collaboration. Manzor's son plays Thomas, and his two brothers score and produce the film. One thing's for sure: producing such a film in France in the '80s was certainly not an easy feat, and we're absolutely thrilled to be able to present a French-German restoration and the North American premiere of this French gem to you, dear Fantastic Fest audience, made possible by Le Chat qui Fume in France and Camera Obscura in Germany. (ANNICK MAHNERT)\n\nWith Director René Manzor in Attendance.",
    "directors": [
        "René Manzor"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/deadly-games"
    },
    "runtime": 90,
    "synopsis": "DEADLY GAMES (3615 CODE PÈRE NOËL) is the terror version of HOME ALONE. A 9-year old kid in his house, tormented by a demented Santa Claus, fights for his survival by setting traps. Christmas will never be the same again.",
    "title": "Deadly Games",
    "year": 1990
}