{
    "countries": [
        "United States"
    ],
    "description": "From streaming service Shudder comes a new and original short form TV series — shown in its entirety — from Graham Reznick, sound designer on several past FF features like STAKE LAND, THE HOUSE OF THE DEVIL and THE SACRAMENT. Taking its cues from the urban legends of backmasking (hidden messages in vinyl records that can be discovered when played backwards), DEADWAX goes one step further: What if the vinyl itself could cause harm just by putting the needle to the groove?\n\nDEADWAX delivers a creepy and stylish tale of Etta (Hannah Gross, MINDHUNTER), a young woman who works as a scavenger of scarce records for rich clientele. She's got a gift for tracking down the rarest of the rare, even if it involves a little breaking and entering. Her most recent score includes an especially unusual piece, legendary in collectors' circles: a \"key\" record from master sound engineer Lyle M. Lytton, and one of only three in existence. She sells it off to one of her usual high bidders, but her curiosity goes into overdrive when the police discover that one of these records — identified by its strange, ominous marks in the space between the grooves and the label, also known as the \"deadwax\" — is linked to the death of another record collector. That gruesome demise puts the law and Etta on the same track, trying to unwind the mystery behind these wicked acetates.\n\nGuest starring Ted Raimi (ASH VS EVIL DEAD), peppered with '70s giallo-esque music, and splashed with '80s-style gore, this highly original series works with as sparse an atmosphere as the songs contained on the deadly platters. The minimal use of production keeps each 15-minute episode laser-focused on its menacing tone and mystifying puzzle. Reznick's background in sound design comes through in his use of eerie tones, electrifying bursts of static, and nightmarish music, each giving life to DEADWAX. Join us for all eight episodes of this frightful series, and get the full sensory experience of its Lynchian ambiance and dark mysteries. (NOAH LEE)\n\nWith Director Graham Reznick in Attendance.",
    "directors": [
        "Graham Reznick"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/deadwax"
    },
    "runtime": 110,
    "synopsis": "A young woman is pulled into a murder investigation revolving around a curious vinyl record which has driven those who possess it mad, and killed anyone who dared to listen to it.",
    "title": "Deadwax",
    "year": 2018
}