{
    "countries": [
        "United States"
    ],
    "description": "The best characters in cinema connect with us at an emotional level. Police officer Erin Bell is one of those characters… and in this stunning new thriller, that connecting emotion is RAGE.\n\nAs a rookie on her first undercover assignment, Erin (Nicole Kidman) and her partner Chris (Sebastian Stan of I, TONYA) infiltrated a dangerous crew of drug-slinging, bank-robbing, nihilistic desert burnouts. The group was led/tormented by the enigmatic young Silas (Toby Kebbell), a narcotic gutter-messiah with a penchant for firearms. The two officers were successful in their masquerade and everything went according to plan — until it didn't. Now eighteen years have passed, Silas has found his way to Los Angeles, and LAPD Detective Bell is a blazing pillar of regret, pain and an undying thirst for retribution.\n\nMovies tend to treat anger as a propulsive force, one that pushes heroic characters into superhuman action against overwhelming odds. DESTROYER opts for a more realistic approach, introducing us to a very human woman who's spent decades being slowly consumed by hatred. She's survived untold physical and emotional damage, all of which has only made her stronger. Unfortunately, it's also barred her from a normal life, causing wreckage in every relationship she's had professionally, romantically, and even with her own daughter. With the sudden reappearance of the target of her boiling hostility, Bell embarks on an ice-cold kamikaze spiral of righteous violence.\n\nDESTROYER is a legitimate masterpiece, the most powerful American film about alienation and misanthropy since NIGHTCRAWLER, though that's where the comparisons end. Director Karyn Kusama (FF favorite THE INVITATION) keeps an objective view of her authentically flawed characters, each relentlessly racing toward their own brand of self-destruction. Every performance is solid, but Nicole Kidman attacks hers with such valid intensity that you'll forget you're watching an actor in a role. Instead, you'll recoil from every withering glare, left hook, and bullet that Detective Bell dishes out on her cataclysmic path to redemption. (ZACK CARLSON)\n\nWith Director Karyn Kusama and Screenwriters Phil Hay and Matt Manfredi in Attendance for 1st half.",
    "directors": [
        "Karyn Kusama"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/destroyer"
    },
    "runtime": 123,
    "synopsis": "Nicole Kidman gives the performance of a lifetime as LAPD detective Erin Bell, a human weapon of escalating vengeance, in the brilliantly grounded new drama-action-thriller from Karyn Kusama.",
    "title": "Destroyer",
    "year": 2018
}