{
    "countries": [
        "France"
    ],
    "description": "Samuel Benchetrit adores telling stories anchored in lost humanity and strange coincidences leading to unplanned meetings, making us see reality and relationships in a different light. But where ASPHALTE was hopeful, he now offers an altogether different film. Adapted from his eponymous novel published in 2015 as he was overcoming depression, DOG is an awkward experience that will cause the viewer to oscillate between laughter and extreme embarrassment.\n\nJacques Blanchot (Vincent Macaigne) is having the worst week. He's just lost his wife, his home, his job — and his newly acquired Hitler lookalike dog — thanks to a careless driver. At a loss for what to do, he decides to attend the pre-paid dog training sessions with the sympathetic owner of the pet shop (Bouli Lanners), and organically begins to take the place of his late animal in the sessions. Gradually losing touch with his humanity, he adopts the lifestyle and behavior of a dog.\n\nWe are the silent witnesses of the terrible degradation of a man, perfectly incarnated by the always tender Macaigne. A dog is the only completely tame animal living alongside humans in cities, one which never questions people's motives, and one that accepts whatever happens to it as just. Blanchot has the same sincerity and innocence in how he appraises the world, and he pays the utmost price for it. While we witness, we cannot judge; Jacques doesn't see the world the same way we do. He can't fathom that people might be out to hurt him (especially on purpose) and is thus totally incapable of surviving in modern society. He's completely sympathetic in a world that's not.\n\nThe film vacillates tonally between violence, black comedy, and absurdity — exactly like life — and illustrates perfectly how everything can collapse in a second: love, family, honor, relationships. The time and place are purposefully undetermined, which dampens the violence while showing the universality of such a tale. Visually it's lean, polished, sometimes sober and cold, holding up a dark mirror to Blanchot and us.\n\nLove it or hate it, Benchetrit spins a tale, which, unexpectedly, has more bite than bark. (SONIA DROULHIOLE)",
    "directors": [
        "Samuel Benchetrit"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/dog"
    },
    "runtime": 87,
    "synopsis": "A dark fable about loneliness, perfectly illustrated by Jacques Blanchot's loss of humanity and slow transformation into a dog. Director Samuel Benchetrit shares a subtle commentary on our current world, and its social, interpersonal, and political issues.",
    "title": "Dog",
    "year": 2017
}