{
    "countries": [
        "Italy",
        "France"
    ],
    "description": "Based on a real crime that happened more than thirty years ago, Matteo Garrone's searing DOGMAN is yet another look at life and violence set in a derelict estate outside of an unnamed town in Italy. Marcello Fonte, in a career-defining role that won him the Palme d'Or, is the titular \"Dogman\" Marcello, a small and gentle creature who spends his days running a dog grooming shop, hanging out with his daughter, and playing soccer with the neighbourhood team. However, it's his on-and-off semi-friendship with violent thug Simone which becomes the defining characteristic of Marcello's life, and as their relationship spirals violently out of control, there will be consequences for everyone.\n\nGarrone's eye for the seedier side of Italy hidden within its picturesque ruins is well-documented in films like GOMORRA, and DOGMAN continues this exploration. While smaller in scope, the story is vastly more focused on the psychological examination of a character defined by his surroundings and his desire to be accepted. Marcello is the pinnacle of a Garrone character: gentle and caring, yet still party to the petty thievery that infects the estate, which sees him dealing coke on the side.\n\nGarrone's decision to stick to Marcello throughout the film's brief runtime establishes a connection with the character which only serves to highlight Fonte's brilliant acting skills. Not since Hoffman got under the skin of Ratzo in MIDNIGHT COWBOY has a performance so brilliantly defined the character it's depicting. Down to the shifting, questioning and constantly begging look in Marcello's eyes, Fonte creates something as real and vital as someone you would encounter in real life.\n\nAs the two men find themselves locked in a journey that won't end well, it's hard to not be impressed by Garrone's razor-sharp focus on the bully and the bullied: neither completely innocent from the situation they find themselves in, both products of a country whose moral compass — according to Garrone — is in a tailspin that is only too relatable. DOGMAN is a moral crime film with a real and captivating heart, a true modern masterpiece from one of the leading lights of Italian cinema. (EVRIM ERSOY)",
    "directors": [
        "Matteo Garrone"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/dogman"
    },
    "runtime": 102,
    "synopsis": "Marcello is a gentle dog groomer whose tumultuous friendship with violent neighbourhood thug Simone engulfs him in a violent series of events that will leave him forever scarred.",
    "title": "Dogman",
    "year": 2018
}