{
    "countries": [
        "United States"
    ],
    "description": "Deep in the backwoods of Indiana, there's a bare-knuckle, battle royale fighting contest called \"The Donnybrook.\" Each contestant must pony up $1,000 to enter, no holds are barred and the winner walks away with $100,000. In Tim Sutton's (DARK NIGHT) film adaptation of Frank Bill's debut novel, the fates of two already desperate men propel them brutally towards a brawl with stakes far higher than expected.\n\nJarhead Earl (Jamie Bell, BILLY ELLIOT) wants a good life for his wife and children. It is this seemingly noble cause — pretty much the only identifiably righteous motive in a film filled with dishonorable people and actions — that drives him to rob a gun store to obtain the entry fee for the Donnybrook. Meanwhile, Chainsaw Angus (Frank Grillo, WHEELMAN) is a former professional prize fighter-turned-meth dealer in business with his double-crossing sister (Margaret Qualley, THE LEFTOVERS), and caught in the sights of a crooked cop (James Badge Dale, WORLD WAR Z). As Jarhead and Chainsaw approach each other and the Donnybrook, the shockingly violent costs of their quest for an escape from hopelessness become increasingly obvious.\n\nDONNYBROOK is a gut-punch of a film with an unflinchingly bleak view of the apparently bottomless depths of human depravity. Bill, who works the nightshift in a paint factory when he's not writing, created a striking world in his novel, and it's brought to ferocious life by Sutton and his team. The cast inhabits these feral Midwestern souls without reservation, which makes the punches in the jaw-dropping and raw spectacle that is the Donnybrook resonate loud and clear. DONNYBROOK is a gothic nightmare of an ever-more despondent working class, and we at Fantastic Fest are excited to send audiences down the river on a journey into a heartland of darkness. (BRIAN KELLEY)\n\nWith Director Tim Sutton in Attendance for 1st half.",
    "directors": [
        "Tim Sutton"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/donnybrook"
    },
    "runtime": 101,
    "synopsis": "Frank Grillo and Jamie Bell are just two of the desperate men and women headed for \"The Donnybrook\" — a no-holds-barred bare-knuckle fight contest with a $100,000 prize — in this midwestern gothic journey into a heartland of darkness.",
    "title": "Donnybrook",
    "year": 2018
}