{
    "countries": [
        "United States"
    ],
    "description": "DRUG STORIES! NARCOTIC NIGHTMARES AND HALLUCINOGENIC HELLRIDES, FEATURING THE TRIP BACK - PRESENTED BY AGFA AND SOMETHING WEIRD\n\nAGFA and Something Weird scoured the Something Weird vaults to rescue and restore 16mm gems from a neglected genre: the classroom drug scare film. From doped-up drag-racers to spiders on speed, the best of the bunch are collected and presented in DRUG STORIES!\n\nWhat's the best way to prevent young people from turning on, tuning in, and dropping out? Government entities of the '60s and '70s seemed to believe that hardline DRAGNET-style narration, groovy medical animation, and dramatic reenactments of bad trips would do the job. Of course, when the old tricks didn't work, filmmakers had to get more creative. Maybe a small child could better relate the cold, hard facts about dope? And maybe the dangers of hallucinogens could be explained by a sentient tab of LSD?\n\nBut they didn't have to overthink it. Sometimes all you need is a middle-aged woman berating kids into submission.\n\nIn THE TRIP BACK, the crown jewel of this collection, Florrie Fisher recounts over two decades of drug use, prostitution, and imprisonment to unimpressed New York City teens. Fisher looks like your aunt but talks like a guttersnipe (\"I turned him into a ten cent pimp!\"), and if you happen to challenge her, watch out! She's dramatic, hyperbolic, and irrationally defensive! Amy Sedaris character of Jerri Blank on the television sitcom STRANGERS WITH CANDY was directly inspired by Fisher's frosted flip hairdo and sordid history, and the similarities are uncanny.\n\nAGFA and Something Weird are thrilled to present 2K preservations of these bad trips, bummers, freak-outs and flip-outs, all from original 16mm prints that were inflicted upon children across the country. (ALICIA COOMBS)\n\nWith Something Weird Video's Lisa Petrucci in Attendance.",
    "directors": [],
    "meta": {
        "source_url": "https://fantasticfest.com/films/drug-stories-presented-by-agfa-and-something-wierd"
    },
    "runtime": 80,
    "synopsis": "AGFA and Something Weird present a compilation of classroom scare films about boozers, users and losers, all in brand new 2K preservations and featuring the legendary anti-drug diatribe known as THE TRIP BACK.",
    "title": "Drug Stories! - Presented by Agfa and Something Weird",
    "year": 2018
}