{
    "countries": [
        "Mexico"
    ],
    "description": "Found-footage films and documentaries are two genres that have arguably reached the oversaturation point, yet Andrés Kaiser's FERAL is the exception that proves there's still plenty of life and brilliance to mine within both.\n\nSomewhere in the Oaxacan mountains are the burnt-out remains of a shelter that housed a psychoanalyst priest who was obsessed with rehabilitating savage children to place them back into society. Through videotape diaries, we're treated to a portrait of a man whose singular pursuit of this goal saw him excommunicated from the church he holds dear, separated from society, and plagued by a self-doubt which chipped away at his humanity. However, a more sinister picture begins to emerge as interviews with individuals from the nearby village and his close family appear. It's a dark secret that may hold the key to the disappearance of the priest and the destruction of the shelter.\n\nKaiser's clever found-footage documentary weaves a spellbinding tale by eschewing jump scares in favor of deep character exploration that threatens to spill into malevolence at any moment. Examining questions of blind faith, trust, and doubt, Kaiser explores the individual in relation to the church through a critical lens that highlights the hypocrisies prevalent within religion, and builds on the idea of the \"other,\" an ostracized figure both feared and reviled.\n\nThe videotape diaries reveal conflicting elements: the nobility of the disgraced priest's mission at odds with the unnatural goings-on that appear at the edges, leaving the audience unsettled. Holding his cards close to his chest, Kaiser keeps the truth hidden as long as possible, hinting at the horrors that lay buried deep within the film. A small cast of remarkable actors help keep the atmosphere taut, tight, and frightening in the build-up to a haunting and unforgettable climax. A brilliant, intriguing debut that marks Kaiser as a talent to watch. (EVRIM ERSOY)\n\nWith Director Andrés Kaiser and Producer Nicole Maynard Pinto in Attendance.",
    "directors": [
        "Andrés Kaiser"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/feral"
    },
    "runtime": 97,
    "synopsis": "The mountains of Oaxaca harbor the remains of a ravaged and burnt shelter, once home to a psychoanalyst priest who used it to look after savage children, trying to re-integrate them into society. Through videotape diaries and interviews, the truth of what happened is shockingly revealed.",
    "title": "Feral",
    "year": 2018
}