{
    "countries": [
        "United States"
    ],
    "description": "Having defeated L Dubba E in sacred Beat-Beat Revelation combat as well as straight up kicking his ass in the 2011 SXFantastic film THE FP, we last saw JTRO retire to his pond with his love Stacy and all the ducks a town could need. But fate is cruel. Some warriors can never rest, and some films demand sequels. JTRO is such a warrior, and THE FP is such a film.\n\nLike any great sequel character, JTRO is at a crossroads in FP2: BEATS OF RAGE. Everything he won in THE FP is lost. Every strength he had has failed him. Everything he learned he must unlearn. He was at the top, but he is faced with a new and even greater challenger in BEATS OF RAGE.\n\nDirector Jason Trost (going solo this time as his co-director from THE FP, Brandon Trost, has become one of Hollywood's busiest cinematographers) used his immense love of big budget action storytelling — which notes to hit and which clichés to embrace — to make THE FP an amazing audience experience and an instant cult classic. Audiences embraced and cheered for each action moment, reveling in the cinematic language they shared with the creators. BEATS OF RAGE replicates that experience, adding in an understanding of apocalyptic sequels and the continuing quest of the weary warrior setting out again.\n\nBad sequels don't let the character evolve, but instead just replicate the structure of the first film. BEATS OF RAGE adopts the best parts of the best sequels, crafting a story that tears down the main character in order to build him into something even stronger, and giving the audience the thrills and laughs they have come to expect from this franchise. (JAMES EMANUEL SHAPIRO)\n\nWith Director Jason Trost and Producer/Actor Tallay Wickham in Attendance.",
    "directors": [
        "Jason Trost"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/fp2-beats-of-rage"
    },
    "runtime": 89,
    "synopsis": "JTRO gave Frazier Park everything he had, but his challenges aren't over. Now he must journey into the destruction of The Waste to rekindle the passion he needs to win the ultimate Beat-Beat Revelation tournament and fulfill his destiny.",
    "title": "FP2: Beats of Rage",
    "year": 2018
}