{
    "countries": [
        "Poland",
        "Czech Republic",
        "Sweden"
    ],
    "description": "Agnieszka Smoczynska's debut feature, THE LURE, took over the festival world in 2016 with its blend of fantasy and musical in a crazy narrative about a pair of mermaid sisters who emerge from the sea and sing at a nightclub. THE LURE dazzled audiences with its sharp visuals and surprising twists, but Smoczynska's retelling of THE LITTLE MERMAID had deeper meaning. The debut filmmaker was exploring the sex trade's exploitation of immigrants looking for a better life while layering in her memories of when she was growing up in her mother's nightclub.\n\nFUGUE may have even deeper meaning, and again pulls from the filmmaker's own experiences and emotions. The film begins with a woman with total memory loss walking along a subway platform. After a series of medical tests and an appearance on a talk show, her family comes to claim her, but she feels no familiar connection to the people claiming to be her husband and son. As time passes, the bond between the three remains strained, threatening to turn the mystery of her disappearance and amnesia into a nightmare.\n\nSmoczynska, a mother of two and wife to actor Andrzej Konopka, talks in her director's notes about FUGUE exploring her personal experiences, and the pressures thrust upon women to accept the roles of spouse and parent. If women are defined solely by biological capacity, how are they supposed to react?\n\nFUGUE is a very different type of genre film from THE LURE. It succeeds in not just entertaining its audience, but proving Smoczynska is capable of a wide array of narratives and styles, making her one of the most exciting emerging filmmakers in the world today. (JAMES EMANUEL SHAPIRO)",
    "directors": [
        "Agnieszka Smoczynska"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/fugue"
    },
    "runtime": 100,
    "synopsis": "A woman tries to reconnect with her family after being lost in a fugue state for several years in Agnieszka Smoczynska's follow up to Fantastic Fest favorite, THE LURE.",
    "title": "Fugue",
    "year": 2018
}