{
    "countries": [
        "France",
        "Belgium",
        "Luxembourg",
        "Spain"
    ],
    "description": "This tale is about girls with balls. Literally. Of course we're talking about the volleyballs they carry around as part of their gear, but they will need to grow a pair to face off against a group of degenerate French rednecks led by Denis Lavant, whose presence alone should be enough to make you want to check out this film.\n\nAmusing aside: English seems to be the only language in which you can describe balls and balls with the same word.\n\nTo be honest, the story doesn't have an ounce of originality: a bus driver (the coach, in our case) is forced to take a short cut and our protagonists end up at a small tavern where they very quickly piss off the locals. And then, of course, the hunt starts. But what director Olivier Afonso has done brilliantly is add wicked, bitchy humor to our characters, along with picking at the cracks in the group's solidarity before the hunt even starts. Albeit a team, our players grapple with the pressure to win, with career opportunities, and with jealousy.\n\nGIRLS WITH BALLS is a molotov cocktail filled with mean jokes and spicy dialogue led by a group of very talented actresses who all give stellar performances. It's a movie made for all of us fed up with only seeing our screen counterparts in the background, proving that women in horror can have fun and kick ass too. While directed by a man, Afonso seems to be just as bored with the typical tropes of the supposed weaker sex as any woman, and the message is clear: girls can throw a punch as well as any man, and they're even more deadly with a full net of volleyballs. Expect gore, salacious jokes, lethal Chihuahuas, and a group of charmingly mean girls. (ANNICK MAHNERT)\n\nWith Director Olivier Afonso in Attendance.",
    "directors": [
        "Olivier Afonso"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/girls-with-balls"
    },
    "runtime": 77,
    "synopsis": "After winning a competition, a women's volleyball team heads home aboard their minibus. Forced to take a shortcut, they end up at a tavern where they upset the local degenerate rednecks… and then the hunt begins.",
    "title": "Girls with Balls",
    "year": 2018
}