{
    "countries": [
        "Sweden"
    ],
    "description": "Set against a backdrop of industrial decay and working class nihilism where the only way to survive is by breaking the law, Peter Grönlund's second feature film is a tough examination of familial bonds in contemporary Sweden. His lens is unflinching, nonjudgmental, yet deeply pessimistic about the future of his characters, and indeed that of the country. GOLIATH presents a society that is broken from the inside, offering little chance of escape for its inhabitants.\n\nKimmie (Sebastian Ljungblad) is defiantly loyal to his family, but has no interest in following his father Roland into a life of drug dealing and thuggery. Regarded as a wimp by his father's gang, Kimmie instead supports his ailing mother by looking out for the welfare of his younger siblings. His sometime girlfriend, Jonna, plans to leave town to take a trainee position at a factory, and Kimmie glimpses an opportunity to escape his familial duties and start afresh. But when Roland is sent back to prison, it inevitably falls to Kimmie to step into his father's place and provide for the family the only way they know how.\n\nResembling a young Mads Mikkelsen, Ljungblad delivers a compelling performance of conflicted loyalties. Presenting a gentle, almost angelic demeanor, there's an ever-present anger that simmers just beneath the surface. Desperate to toughen him up before he is sent back behind bars, his father (Joakim Sällquist) perpetually needles him, and their relationship, barbed by hostile, combative affection, crackles with uneasy intensity throughout.\n\nDespite the bleak subject matter, GOLIATH is never a gruelling nor horrifying watch. The cast, comprised almost entirely of unknowns and first-timers, does an impeccable job of humanising these deeply flawed and marginalised individuals. Grönlund's unflashy direction similarly creates a believable world of endemic crime, without resorting to shock and awe tactics to punctuate his drama. (JAMES MARSH)",
    "directors": [
        "Peter Grönlund"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/goliath"
    },
    "runtime": 88,
    "synopsis": "17-year-old Kimmie hopes to escape the cycle of crime and violence that has consumed his family, but when his father is sent back to prison, fate seems to have decided his future for him.",
    "title": "Goliath",
    "year": 2018
}