{
    "countries": [
        "United States"
    ],
    "description": "The newest and boldest film from acclaimed director Jeremy Saulnier (GREEN ROOM, BLUE RUIN), HOLD THE DARK is a taut examination of human nature and the mysteries of the wilderness.\n\nRetired naturalist and wolf expert Russell Core (Jeffrey Wright) journeys to the edge of civilization in northern Alaska at the request of Medora Slone (Riley Keough), a young mother whose son was killed by a pack of starving wolves. As Core attempts to help the woman process her grief, a strange and dangerous relationship between these two lonely souls develops.\n\nBut when Medora's husband Vernon (Alexander Skarsgård) returns from his brutal tour in the Iraq War, the news of his dead child ignites a violent chain of events across this frozen landscape. As Donald Marium (James Badge Dale), a local cop, races to stop Vernon's seemingly senseless rampage, Core finds himself trapped on a perilous odyssey into the heart of darkness.\n\nBased on the 2014 novel by William Giraldi and adapted for the screen by Sundance Grand Jury Prize–winning filmmaker Macon Blair, HOLD THE DARK expands on Saulnier's fascination with the complications of revenge, the horror of violence, and the moral flaws of his characters. Once again, Saulnier's cinematic storytelling hinges on an airtight command of atmosphere and breathtaking suspense, while expanding his scope with flickers of supernatural mysticism.\n\nThe result is a gripping psychological thriller, as mythic and haunting as a ghost tale told around a crackling midnight campfire.\n\nWith Director Jeremy Saulnier and Writer Macon Blair in Attendance for 1st half.",
    "directors": [
        "Jeremy Saulnier"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/hold-the-dark"
    },
    "runtime": 125,
    "synopsis": "A gripping psychological thriller unfolds in the treacherous Alaskan wilderness when a retired wolf expert is summoned to investigate a child's disappearance.",
    "title": "Hold the Dark",
    "year": 2018
}