{
    "countries": [
        "Denmark",
        "Netherlands",
        "Sweden",
        "Turkey"
    ],
    "description": "Pretty blonde Sascha (Victoria Carmen Sonne) is the epitome of mainstream attractiveness, and is invited to join her Danish criminal boyfriend Michael (Lai Yde) on a no-expense-spared summer holiday on Turkey's idyllic Turquoise Coast. The young woman's presence requires her to take on the role of a human trinket, a girl-shaped bauble whose inclusion in the titular getaway with Michael and his colleagues comes with unspoken expectations and demands. And she knows it.\n\nThe feature film debut of Swedish director and writer Isabella Eklöf, HOLIDAY is marked by a fashion magazine gloss with its aesthetic of hyper-commodified femininity. The look of the film feeds shrewdly into a fearless critique of what happens to a young woman who has been objectified to the point where she can only understand her own identity through the very terms of her objectification. At the heart of the film lies an undeniably brutal rape scene that makes explicit the until-then ambient, rumbling suggestion of violence and threat that surrounds Sascha: as a young woman in this man's world, violence is not just a possibility, but a day-to-day reality.\n\nThe neon-colored bikinis, nightclubs, fancy drinks, and crystal-clear swimming pools lie in sharp contrast to the dark revelations of Sascha's journey, sparked into action when she meets free-spirited Dutchman Thomas (Thijs Römer). In the hands of a less capable, thoughtful, and original director, this scenario could easily collapse into the terrain of the cliched love triangle trope, but Eklöf knows the world is never so simple or clear-cut for women in situations like Sascha's. Rather, violence becomes viral — a way of maintaining the status quo, even if that comes at the loss of agency and the acceptance of an identity that transcends two-dimensional commodified womanhood.\n\nLike so much in Eklöf's film, the title is both an invitation and a provocation: HOLIDAY is no escape, but rather an unflinching, urgent, and desperately important statement about the world so many young women find themselves in. (ALEXANDRA HELLER-NICHOLAS)",
    "directors": [
        "Isabella Eklöf"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/holiday"
    },
    "runtime": 93,
    "synopsis": "The sun-drenched dream of the eponymous summer vacation has its dark side revealed in Isabella Eklöf's powerful debut feature HOLIDAY, an unforgettable exploration of the fraught, brutal experience of young womanhood.",
    "title": "Holiday",
    "year": 2018
}