{
    "countries": [
        "Spain"
    ],
    "description": "Sonia Escolano's mesmerising treatise on religion, faith, and belief marries the aesthetic style of European cinema with the language of horror films to delivery a story both unique and shocking in its take on extremism.\n\nSomewhere in an unnamed country, \"She,\" a mysterious and enigmatic figure, leads a religious cult. Through strict rules and even stricter hierarchy she ensures that her flock never strays from the path of righteousness, and those who even dare to suggest anything out of the ordinary are punished without mercy.\n\nHowever, a series of events start to corrupt the very fabric of their reality; doubt starts to set in for some of the members, and the arrival of a mysterious outsider sets She and her followers on a path of collision from which no one will emerge unscathed.\n\nHighly stylized and deliberately plotted, HOUSE OF SWEAT AND TEARS marks the arrival of an original voice within genre cinema. Exploring the murky waters of blind faith and rebellion, and cleverly divided into chapters to better accentuate the journey of its characters, the film slowly dissects what happens to a community ruled by fear when doubt is introduced into its fabric.\n\nIn the role of Ella, Alzira Gomez acts as the bridge between the audience and the mysterious world of the film. Her performance of a character questioning all of her existence is tinged with the fear of discovering the truth as it collides with the desire to rip the curtain off the duplicitous nature of her surroundings.\n\nPerhaps the biggest draw of the film is Escolano's ability to place the viewer in the middle of a world at once familiar and foreign, a world full of mysterious details which do not require mundane explanations but suggest something just outside the sphere of our understanding. A film that asks its audience to think, to question, and to discuss, HOUSE OF SWEAT AND TEARS is intelligent and uncomfortable filmmaking that challenges perceptions at every level. (EVRIM ERSOY)\n\nWith Director Sonia Escolano in Attendance for 2nd half.",
    "directors": [
        "Sonia Escolano"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/house-of-sweat-and-tears"
    },
    "runtime": 104,
    "synopsis": "\"She,\" the leader of a violent cult, rules her flock with an iron fist to ensure they never stray from the path. But a series of events and a mysterious outsider threaten the pattern of their reality in this electrifying exploration of faith and belief.",
    "title": "House of Sweat and Tears",
    "year": 2018
}