{
    "countries": [
        "Australia"
    ],
    "description": "Elif, Sadia, Dara and Susan are never likely to meet, yet they would all instantly connect through their shared passion for boy bands. Not all boy bands, and not just any boy band.\n\nElif is a Directioner, a superfan of UK pop group One Direction. But Directioners don't say \"1D\" or \"One Direction;\" they call them \"the boys\" as if they know them personally, with an implied sense of ownership of the group. Sadia, on the other hand, fell in love with Nick Carter and The Backstreet Boys around '97. Although Nick loved water and Sadia didn't know how to swim, she was still sure she was destined to end up with him. Far across the globe in Sydney, there's Dara, whose life changed when she discovered the British band Take That and its sensible dad figure Gary Barlow. Take That was the first thing that Dara can remember liking on her own, and that sense of discovery and the first pangs of self-identity and independence would link her to the band forever. Finally there's the elder stateswoman, Susan, original fangirl of the original boy band, The Beatles. She remembers their first Australian tour and how parents weren't prepared for the mania that their presence would inspire. These four women are from different countries and different backgrounds and, while they may not know each other, their obsessions put them on similar paths.\n\nWhat's perhaps most striking about the film is the way it never mocks its subjects, and never encourages the audience to do so. These women are presented as normal — as normal as anyone is — each with a deep abiding love that started when they were young and carried throughout their lives. While things have changed as they've grown, including the way they relate to the bands, that love is still a part of them. These boys will always hold a special place in their hearts, the same way many of us imprinted on comic books or video games or movies, huddled together in a friend's basement developing our own obsessions.\n\nMaybe, on the surface, a documentary about boy bands and the women who love them seems out of place at Fantastic Fest, but these women are us. Their fandom is pure and wholesome and, yes, a bit extreme at times, but it's also inspiring and joyful and heartwarming. They found acceptance and family and themselves in their love of Nick and Gary and John and Zayn, the same way we did with Stan and Wes and Michael and Jason. And when you get down to it, that love, that feeling of belonging, is what Fantastic Fest is all about. (LUKE MULLEN)\n\nWith Producer Rita Walsh in Attendance.",
    "directors": [
        "Jessica Leski"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/i-used-to-be-normal-a-boyband-fangirl-story"
    },
    "runtime": 96,
    "synopsis": "The lives of four women from across the globe are radically changed by their deep love of boy bands in this fascinating, joyful exploration of intense fandom.",
    "title": "I Used To Be Normal: A Boyband Fangirl Story",
    "year": 2018
}