{
    "countries": [
        "United Kingdom"
    ],
    "description": "With his two previous features at Fantastic Fest, Peter Strickland proved his ability to utilize soundscapes (BERBERIAN SOUND STUDIO) and lush visuals (THE DUKE OF BURGUNDY) to unrivaled effect. With IN FABRIC, he combines both skills to create a nightmarish vision of materialism and obsession.\n\nSheila, a bank manager and single mother, decides to dip her feet into online dating. But first she must find the perfect dress for the occasion. She begins her search in an expansive '70s-era department store run by carefully manicured employees who dote on their clientele with a peculiar brand of verbose, enigmatic hospitality. Immediately, she is drawn to a glamorous red dress that miraculously fits her like a glove.\n\nInitially her new dress seems like a good luck charm, but much like similar icons in horror films past, this one harbors mysterious powers and refuses to be disposed of. Sheila's story is just the beginning of the garment's dark journey where nothing good happens to the women who stumble across it.\n\nBut where did the dress come from and what is going on behind the scenes of this strange department store? What's with the hypnotic television advertisements, and why do women seem compelled to wait eagerly outside the store each morning? Why are the employees dressed in head-to-toe black, and why do they only spout incoherent musings about beauty and perfection? Why are there whispers echoing throughout the store, and is that moaning coming from the mannequins?\n\nStrickland clearly has much to say about the fashion industry and our obsession with unattainable perfection, including scenes of materialistic insanity that rival Black Friday security cam footage. Still, he doesn't just rest on this commonly-touted critique. Like the giallo films that he draws from with his collage of rich, kaleidoscopic imagery, he finds depth and complexity in the beautiful figures of women and mannequins, delighting in their form even as he destroys them. (LOGAN TAYLOR)",
    "directors": [
        "Peter Strickland"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/in-fabric"
    },
    "runtime": 118,
    "synopsis": "Peter Strickland (THE DUKE OF BURGUNDY; BERBERIAN SOUND STUDIO) returns to Fantastic Fest in full, flourishing style with IN FABRIC, a film that's part surreal thriller, part giallo love letter, part fashion collage, and all hypnotic originality.",
    "title": "In Fabric",
    "year": 2018
}