{
    "countries": [
        "France"
    ],
    "description": "Fugain (Grégoire Ludig) is in trouble. He found a dead body on the street next to his apartment in the middle of the night, and now he's being interrogated by Chief Inspector Buron (Benoit Poelvoorde) — and describing this man as a \"stickler for detail\" is a euphemism if there ever was one. Trapped in the police station at night, Fugain's growing incomprehension mirrors the burgeoning comedy, especially when left alone with the adjutant (played by Marc Fraize, one of France's newest comedic talents, who famously did a sketch where he just stoically smiled at the audience for the majority of his set). Behind closed doors, many things can happen; the question is how well you can hide them….\n\nQuentin Dupieux has a rich body of work, from directing music videos to films, along with making music as one of the frontrunners of the French Touch dance music scene under the moniker Mr. Oizo. (Interestingly, Dupieux's use of music in KEEP AN EYE OUT is notable in its absence, making it land all the harder when it does underline the action.) From STEAK (where the worst thing that can happen is to be a Phil Collins fan) to the serial killer tire in RUBBER, from WRONG COPS' irreverence to REALITY's take on the film industry, Dupieux shapes contemporary artworks without always infusing them with \"real\" meaning, showcasing his love of \"le grand n'importe quoi\" (which literally translates as \"big complete nonsense\") in his singular universe. KEEP AN EYE OUT is no different in that regard.\n\nThrough a thinly veiled homage to classic French police films (both GARDE À VUE from Claude Miller and PEUR SUR LA VILLE from Henri Verneuil), Dupieux offers us a new take on this genre. The interrogation of this unlucky, flustered man — who could very well be us — is the best pretext for his reliably arbitrary dialogues and absurd lines. However, it's delivered with a warmth and compassion than is unusual for Dupieux, consoling us with the refreshing perspective that our lives may not have any sense or meaning. And that's okay. (SONIA DROULHIOLE)",
    "directors": [
        "Quentin Dupieux"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/keep-an-eye-out"
    },
    "runtime": 73,
    "synopsis": "An absurd all-night interrogation set in a camp '70s police station, Quentin Dupieux's latest opus, KEEP AN EYE OUT, is a celebration of his own brand of quirky, offbeat humor, performed by France's most refreshing comedic talents.",
    "title": "Keep an Eye Out",
    "year": 2018
}