{
    "countries": [
        "France"
    ],
    "description": "Exploitation cinema may never be more wonderfully gay than it is in Yann Gonzalez's grand follow-up to his debut, YOU AND THE NIGHT. While YOU AND THE NIGHT embraced the questions of motivation and identity that surround an all-genders orgy, KNIFE + HEART is straight-up trashy genre fun. It's told in the recognizable visual and narrative language of European giallos, with kill scenes reminiscent of a William Lustig grindhouse thriller, and a terrific score from Gonzalez's collaborator and brother Anthony Gonzalez (aka M83).\n\nAnne (the always great Vanessa Paradis) is at her wits' end. Not only is her long-term relationship with her lover and editor Lois (Kate Moran) over, but now someone is murdering her actors. An unknown masked killer is laying siege to her low-budget gay porn production company, and while she hasn't a clue why, she can at least make the best of a bad situation and bend the situation into the plot of her newest film, HOMO-CIDE. But as the killings continue, her employees go into hiding, sending Anne on a quest to investigate the motives and history of the monster who strikes from the shadows.\n\nKNIFE + HEART is a joy for genre fans to behold. While Gonzalez embraces the extremes in 1970s exploitation, he goes beyond homage to bring sensitivity and real affection to a film filled with the type of characters who are often absent or simply caricatures in other films of this type. The representation is authentic as this is a horror story only possible with LGBTQ+ characters. It offers a heavy dose of love and heart in a narrative soaked with blood and semen. (JAMES EMANUEL SHAPIRO)\n\nWith Director Yann Gonzalez in Attendance for 2nd half.",
    "directors": [
        "Yann Gonzalez"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/knife-plus-heart"
    },
    "runtime": 102,
    "synopsis": "In Yann Gonzalez's second feature, a masked serial killer stalks a producer and her film company in this love letter to European giallo, American grindhouse cinema, and '70s gay porn.",
    "title": "Knife + Heart",
    "year": 2018
}