{
    "countries": [
        "United States"
    ],
    "description": "LADYWORLD wastes no time plunging us into its surreal apocalyptic world, opening with a black screen and sonic roar before introducing us to its cast of characters: eight teenage girls in varying states of childish dress up, all slowly gathering themselves after a soul-shaking earthquake has buried the house in rubble.\n\nAmanda Kramer's ingenue cast of eight disparate personalities function as a microcosm of America. The girls are divided, all grappling with the terrifying, unknown situation in their own ways. The concerns of teenage girls — the vicious teasing, the painful insecurities, the questions of identity — are exacerbated to a degree that feels painfully familiar yet still hyper-dramatized.\n\nThe girls eventually turn on each other, collapsing into a female-centric \"Lord of the Flies\" power struggle. The director's theatrical background undoubtedly helped her craft this claustrophobic chamber piece that utilizes every corridor, closet and hiding spot to its maximum effectiveness.\n\nThe film's sound design doesn't let up after that first rumbling crescendo. The breathy, jazzy, hallucinogenic soundtrack oscillates between reality and fantasy. Sometimes the score is grounded in the rooms themselves, where dangers and secrets lurk in every corner. Other times, the sounds seem to come from inside our own heads as a panting, panicky whisper. And in some of the most terrifying moments, they're guttural, tribal, animalistic noises like a cat trapped in cage.\n\nLADYWORLD dares to probe the darkest reaches of the teenage female mind, ultimately becoming an existential meditation on the most important values in our society. Even at the tender age of the film's protagonists, they're already well aware of what the world expects of them and where they come up short. It's a heartbreaking scenario made poignant through careful, thoughtful dialogue and pitch-perfect performances across the board. Yet while the film dares to ask these tough questions, many remain unanswered — and really, what could be more lifelike than that? (LOGAN TAYLOR)\n\nWith Director Amanda Kramer, Producers Thomas R. Burke and Leal Naim, Editor/Co-Writer Benjamin Shearn, and Actor/Co-Editor/Production Designer Noel David Taylor in Attendance for 1st half.",
    "directors": [
        "Amanda Kramer"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/ladyworld"
    },
    "runtime": 93,
    "synopsis": "In Amanda Kramer's daring low-budget debut LADYWORLD, a birthday party quickly devolves into chaos when a mysterious earthquake traps eight teenage girls alone in a house, challenging their friendships, identities, and eventually their grip on reality.",
    "title": "Ladyworld",
    "year": 2018
}