{
    "countries": [
        "Czech Republic"
    ],
    "description": "The historically accurate context is this: In October of 1957, USSR leader Nikita Khrushchev wanted to commemorate the 40th anniversary of the October Revolution by launching Sputnik 2, ignoring the fact that the capsule was nowhere near ready. A three-year-old mutt named Laïka was caught wandering the streets of Moscow. Little did she know that she would be the first dog to ever make it to space... and to meet her destiny there thanks to a failing cooling system that cooked her alive. Her horrible death triggered a movement against animal cruelty and the mutt became pretty famous, even appearing in the Marvel comic GUARDIANS OF THE GALAXY, inspiring the character Cosmo the Spacedog.\n\nBut that's not the story that director Aurel Klimt wants to tell. Klimt's is a charming animated tale full of joy and catchy tunes in which Laïka survives the flight and, via a very funny plot device, ends up on a planet in a parallel universe. After crash-landing, Laïka meets a fleet of other \"beings,\" befriends them, makes a new home for herself, and all is well in the best of all worlds... for a while. The unexpected crash-landing of another visitor disturbs the balance, leading to a comedic stand-off using freeze-guns, bizarre local plants, and bananas.\n\nThe design of the stop-motion puppets is reminiscent of certain '70s children's shows, and the look feels old, dusty, even ugly — and that's the beauty of it! LAIKA is a fantastic animated feature from the Czech Republic filled with funny characters and moments, and it's both a wonder and a shame that it has flown under the radar for so long. Along with the humor, it is also filled with clever socio-political commentary, the strongest being that the only real threat to a society, whether on planet Earth or in another galaxy, is humankind. Banananananana! (ANNICK MAHNERT)\n\nWith Director Aurel Klimt in Attendance for 2nd half.",
    "directors": [
        "Aurel Klimt"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/laika"
    },
    "runtime": 88,
    "synopsis": "This is the story of Laïka the space dog who, unlike in real life, did not die aboard Sputnik 2 in 1957. In this bizarre and charming stop-motion musical, Laïka crashes on a peculiar planet where she meets new friends.",
    "title": "Laika",
    "year": 2017
}