{
    "countries": [
        "Canada"
    ],
    "description": "Canadian filmmaker Danishka Esterhazy proves she has a knack for female-centric storytelling with LEVEL 16, a twist-filled thriller with dark political undertones. The girls of Vestalis Academy have been working hard to enter Level 16, the final level of their training to become the ultimate examples of femininity. They've internalized the four key virtues of being a \"clean girl\": obedience, cleanliness, patience, and humility. All of their training has been leading to this final level, after which they'll be adopted into the home of an upper-class family and their lives can truly begin. Or so they think.\n\nWhen Vivien moves into Rose Hall, she runs into an old friend from the early levels, Sophia. These two girls share secrets from their past, and new secrets as well when Sophia tells Vivien not to take her vitamins one night. What she discovers that evening alters her path forever.\n\nThe Academy may be molding the girls into proper young ladies, but it isn't providing any skills to be more than that. Early on, it's made clear the girls can't read, not even their own names. Those names — given to the girls by the Academy and inspired by famous actresses of the Hollywood Golden Age — are markers of a simpler time, when women were worshipped on screen but rarely encouraged to be educated or outspoken. The girls' internal battle between obedience and rebellion is expressed through stunningly agile performances from fresh-faced talent we are bound to see more of, particularly leads Katie Douglas and Celina Martin.\n\nA cold, dystopian vision with echoes of THE HANDMAID'S TALE, LEVEL 16 is an essential film for our time. Esterhazy explores the values traditionally emphasized when raising young girls — uniformity over originality, beauty over brains, obedience over free-thinking — in a sharp satire, loaded with careful details that flesh out a fully-realized science fiction world. Shot in icy hues and a stark, disorienting one-point perspective, LEVEL 16 is a lesson in both style and substance that is uncomfortably timely and importantly wide-reaching. (LOGAN TAYLOR)\n\nWith Writer/Director Danishka Esterhazy, Actor Sara Canning, and Producers Judy Holm and Michael McNamara in Attendance.",
    "directors": [
        "Danishka Esterhazy"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/level-16"
    },
    "runtime": 102,
    "synopsis": "The teenage girls of Vestalis Academy are meticulously trained in the art of being \"clean girls,\" practicing the virtues of perfect femininity. But what exactly are they being trained for? Vivien intends to find out.",
    "title": "Level 16",
    "year": 2018
}