{
    "countries": [
        "United States"
    ],
    "description": "From Jonas Åkerlund, famed director of music videos by U2, Queens of the Stone Age, Beyonce, Metallica, Lady Gaga, Rammstein, and Madonna, comes the true story of the band Mayhem and the beginning of Black Metal at large. Known for controversial live performances with their lead singer cutting himself onstage, they were implicated in church burnings throughout Norway, along with a pattern of violence by their band members that culminated in a dark coup de grace.\n\nØystein Aarseth, better known as Euronymous (Rory Culkin), forms Mayhem in Oslo in 1984 alongside bandmates Necrobutcher (Jonathan Barnwell) and Metalion (Sam Coleman) to push his own brand of music, Black Metal. Focusing on the faster, darker side of the musical spectrum and a counter to all the \"life metal\" bands (as he dubbed them), he unknowingly sets himself down an ominous path.\n\nMayhem eventually recruits a new singer from Sweden, named simply Dead (Jack Kilmer), a troubled youth with an unhealthy obsession with mortality. Before heading out on tour, Dead buries his clothes to be closer to the afterlife, the first of many signs of a troubled psyche that will lead him to his suicide. Upon finding his friend's body, Euronymous purchases a disposable camera to photograph the corpse for a Mayhem album cover. This embracing of destruction and violence would become their hallmark, drawing others into a legacy of violence and burned churches that would change Norway and musical history forever.\n\nÅkerlund and screenwriter Dennis Magnusson have dazzingly adapted the legendary biography by Michael Moynihan and Didrik Søderlind. Refusing to glorify or condone the musicians' actions, it's a wickedly dark yet humanized tale of talented youth who journeyed down a destructive path. Culkin, Emory Cohen and Valter Skarsgård bring fully fleshed characters to the screen, giving us insight to the motivations of real-life people who are as complex as the music they brought into the world. (NOAH LEE)",
    "directors": [
        "Jonas Åkerlund"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/lords-of-chaos"
    },
    "runtime": 112,
    "synopsis": "Based on the biography of the same name, LORDS OF CHAOS is the tale of an Oslo teenager who launches Norwegian black metal, setting off a chain of events that have made his band, Mayhem, infamous for decades.",
    "title": "Lords of Chaos",
    "year": 2018
}