{
    "countries": [
        "Germany"
    ],
    "description": "Taxi driver Luz enters a brightly lit but mostly deserted police station at night. Simultaneously, Nora is at a local bar attempting to seduce psychotherapist Dr. Rossini, telling the story of how her girlfriend jumped out of a moving taxi. As the conversation and sexual tension swells, Nora shares not only her connection to Luz, but the dark secrets of their past, making it increasingly clear that something evil is stalking Luz. It's when we return to Luz's interrogation that things quickly spiral out of control into a menacing and oftimes surreal series of events.\n\nLUZ, the first feature film from writer and director Tilman Singer, brings to mind the works of Lucio Fulci and Andrzej Zulawski with its ethereal and eerie staging, crossed with a darkly angelic electronic soundtrack that bleats with '80s saxophones. Peppered throughout with eruptions of kinetic violence, sexual tension, and bizarre humanity, Singer bursts onto the festival scene as a filmmaker to watch. LUZ travels beyond the static films of the present, reclaiming a past where atmosphere and emotion drove horror, but unafraid of utilizing a punch of gore to tear through the tension. As Luz relates her narrative under hypnosis, through inventive conversational and audible dualities, we experience the mastery of Singer's storytelling abilities.\n\nFantastic Fest invites you to be drawn into this mesmerizing and frightening film that turns the tired tales of demonic hauntings into a fresh and claustrophobic homage to films that have come before. (NOAH LEE)\n\nWith Director Tilman Singer in Attendance for 1st half.",
    "directors": [
        "Tilman Singer"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/luz"
    },
    "runtime": 70,
    "synopsis": "Luz enters a police station at night to report an assault. As the interrogation progresses, it becomes clear a demonic entity wants to possess her in this audacious, psychotropic horror film shot on 16mm.",
    "title": "Luz",
    "year": 2018
}