{
    "countries": [
        "Israel"
    ],
    "description": "Sophie is getting old. Her beauty is fading faster than she hoped, and with 99 trophies under her belt, she's only one away from becoming a full-fledged Lordess, one of the upper members of MADAM YANKELOVA'S FINE LITERATURE CLUB. Once a Lordess, Sophie can stop luring men into the club's cannibalistic clutches. She could age gracefully and respectfully among her fellow retired temptresses.\n\nBut the Lordesses are tired of Sophie's string of less-than-stellar dates. Her latest offerings are barely fit to look at, let alone grind up into fine hotdog meat. They give Sophie an ultimatum: she either wins the next week's trophy or loses everything, falling to the rank of the unappreciated Sanitation Department. Luckily she meets Yosef, an intelligent man who expresses genuine interest in Sophie's knowledge and passions. As their romance blossoms, Sophie must choose between the man of her dreams and the Literature Club, who firmly and cynically deny the existence of love. Add to the mix a scheming young seductress hellbent on usurping Sophie's place on the throne, and an idealistic maid escaping the club for a better life, and you have one of the most charming, age-diverse, all-female ensemble casts in recent memory.\n\nIt's not every day we find an over-the-top, hyper-stylized genre feature out of Israel. Guilhad Emilio Schenker's debut took us very much by surprise, largely thanks to its richly textured, deeply saturated fantasy world and artful ability to combine dark comedy with a gruesome premise. That's not to say MADAM YANKELOVA'S FINE LITERATURE CLUB is just a quirky escape; it also explores timely questions of a woman's worth in society. Do we lose everything the day our looks start to fade? Can we rise above such superficial concerns and value intellect? Are we destined to the class we're born into no matter how hard we try? And perhaps the most important question of all: how much are we willing to give up for love? (LOGAN TAYLOR)\n\nWith Director Guilhad Emilio Schenker and Cinematographer Yossi Meiri in Attendance for 1st half.",
    "directors": [
        "Guilhad Emilio Schenker"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/madam-yankelovas-fine-literature-club"
    },
    "runtime": 90,
    "synopsis": "Desperate, aging, Sophie only needs to seduce one more handsome victim — excuse me, date — to become a worry-free Lordess in MADAM YANKELOVA'S FINE LITERATURE CLUB, Israeli director Guilhad Emilio Schenker's delightfully twisted debut feature.",
    "title": "Madam Yankelova's Fine Literature Club",
    "year": 2018
}