{
    "countries": [
        "United States"
    ],
    "description": "Easily one of the nastiest slasher films the horror subgenre has ever seen, grindhouse auteur Bill Lustig's MANIAC took a notably inner-city approach to its murderous narrative revolving around a sweaty, abused hulk (pock-faced character actor icon Joe Spinell) who begins collecting pretty women's scalps as trophies in Times Square.\n\nFor those who tire of their body count pictures being set in the safety of suburbia, Lustig and Spinell (who co-wrote the picture) create an environment of diseased atrocity, capturing the Big Apple in all its guttural glory as the freewheeling '70s gave way to a much darker, depraved period in NYC's existence (a pre-Giuliani cinematic experience, set just before crack became king on the corners). Lustig's approach is casually painful, calling in DAWN OF THE DEAD and FRIDAY THE 13TH splatter maestro Tom Savini to deliver some of the gnarliest SFX gags of his already storied career (an exploding, shot-gunned head becoming its Fangoria-ready centerpiece).\n\nMANIAC isn't concerned with your emotional safety as it chronicles the pedestrian existence of its anti-human anti-hero with the cold, unrelenting eye of a hardcore documentarian, unafraid to let the audience peek in on one of society's most disturbed subjects.\n\nThis 4K presentation of Lustig's grimecore masterwork is a solid reminder of why the movie was banned by the BBFC not just once, but twice (for cinema in '81, and again for video in '98), while Roger Ebert and Gene Siskel practically declared a jihad on it via their popular SNEAK PREVIEWS television program. This is horror filmmaking at its most primal, unflinchingly realistic and savage, but also strangely empathetic toward a human being who's expressing himself in possibly the only way he knows how. As the tagline for the notorious theatrical poster cautioned audiences who wandered into its 42nd Street premiere on Christmas Day: \"I warned you not to go out tonight.\" (JACOB KNIGHT)\n\nWith Director William Lustig in Attendance.",
    "directors": [
        "William Lustig"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/maniac"
    },
    "runtime": 88,
    "synopsis": "The 4K restoration of grindhouse auteur Bill Lustig's 1980 slasher landmark features splatter SFX artist Tom Savini's gnarliest work, as well as one of horror's finest, sweatiest performances from legendary character actor/co-writer Joe Spinell.",
    "title": "Maniac",
    "year": 1980
}