{
    "countries": [
        "Indonesia"
    ],
    "description": "Lesmana reluctantly invites a white-robed woman into his home. Proceeding to his creepy basement, she crafts her spell with candles, chanting, mystical runes, and the requisite goat's head. Through the awesome powers of the Devil, the money that Lesmana has long wished for is summoned in a swirling cloud filling the room, and Lesmana's life is destined for greatness... at least until the time comes to pay his dues.\n\nYears later, Lesmana summons his daughter Alfie and her step-siblings to his deathbed where he lies covered in hideous boils. Although she hasn't spoken to him in ten years, Alfie answers the call to discover that she is the sole inheritor of his villa. Hoping that somewhere in the estate might be something of value to stave off their looming bankruptcy, Alfie and her step-family arrive only to meet the Devil as he comes calling for his due, and Alfie's family is drawn into the web of evil her father wove for them years before. Can they break the cycle before the Devil takes them? With super gross-out thrills, an ever-growing sense of freaky discomfort, and an intense soundtrack, this family road trip to hell is one you'll be talking about all year.\n\nTimo Tjahjanto made his name as half of the Mo Brothers with cult horror and action film favorites MACABRE, KILLERS, his V/H/S 2 segment, and the Fantastic Fest 2016 selection HEADSHOT. This year he's covering all the genre bases by bringing the insane action rollercoaster THE NIGHT COMES FOR US as well! MAY THE DEVIL TAKE YOU is an out-of-the-box, gore-soaked, loud, and totally fun popcorn midnighter that brings Raimi-esque levels of blood-spewing, distorted demons, and high levels of tension and chills. MAY THE DEVIL TAKE YOU is yet another sign that Tjahjanto is one of the best directors the world is lucky to have. (NOAH LEE)\n\nWith Director Timo Tjahjanto in Attedance for 1st half.",
    "directors": [
        "Timo Tjahjanto"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/may-the-devil-take-you"
    },
    "runtime": 110,
    "synopsis": "At her father's deathbed, Alfie learns that she and her family must give the Devil his due when he comes to collect on the pact made years before in this electrifying horror film from Indonesian master storyteller Timo Tjahjanto.",
    "title": "May the Devil Take You",
    "year": 2018
}