{
    "countries": [
        "United States"
    ],
    "description": "Consider the Venn diagram of Fantastic Fest attendees and people who \"didn't fit in\" during their awkward early teen years. I have no scientific evidence to support this theory, but my anecdotal data suggest that the intersection of those two circles almost perfectly overlaps.\n\nEarlier this year, A24 introduced us to EIGHTH GRADE-er Kayla (Elsie Fisher), one of our favorite characters in recent film history. Kayla explored the aching challenges of \"being yourself\" when the majority of those around you don't yet know how awesome your \"yourself\" is. Now with MID90s, the directorial debut of Jonah Hill, meet Kayla's skater kindred spirit, the gentle pre-pubescent soul Stevie (brilliantly portrayed by Sunny Suljic). Like Kayla, Stevie is also isolated, lonely, desperately in search of a tribe… and awesome.\n\nAfter lurking in the shadows at a local neighborhood skate shop, Stevie is welcomed into a quartet of misfit skaters led by Ray (pro skater and Odd Future-collaborator Na-kel Smith) and Fuckshit (pro skater Olan Prenatt). The two become the Looney-Tunes-esque devil and angel sitting on Stevie's shoulders as he decides what sort of man he will eventually become. Fuckshit's intoxicating ethos of living to the max in the moment does battle with Ray's more thoughtful pursuit of a better future.\n\nAlthough this is Stevie's story and Suljic is fantastic in the lead role, Smith and Prenatt's supporting characters truly steal the show. Both are natural actors. Although they are clearly playing amplified versions of their real-life skater personalities, they both have a raw charisma that demands your attention every moment they're onscreen.\n\nThis creative effort by Jonah Hill continues his extraordinary recent trajectory. A thoughtful and gifted storyteller, we look forward to a long, satisfying (and almost assuredly multi-faceted) career in the years to come.\n\nWith Writer/Director Jonah Hill, Producer Eli Bush, and Actors Sunny Suljic, Na-Kel Smith, Olan Prenatt, Gio Galicia, and Ryder McLaughlin in Attendance for 1st half.",
    "directors": [
        "Jonah Hill"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/mid90s"
    },
    "runtime": 84,
    "synopsis": "Written and directed by Jonah Hill, MID90s follows Stevie, a thirteen-year-old in '90s-era LA who spends his summer navigating between his troubled home life and a group of new friends that he meets at a Motor Avenue skate shop.",
    "title": "Mid90s",
    "year": 2018
}