{
    "countries": [
        "Argentina",
        "France",
        "Chile"
    ],
    "description": "MURDER ME, MONSTER starts off strong and keeps you riveted, featuring a close-up of a slashed throat as the victim desperately tries to keep the head attached to the neck. We are in rural Argentina, lost somewhere in the Andes Mountains, and there's a serial killer on the loose… apparently. Inspector Cruz is called by the police force to investigate the series of murders exacted in spectacular ways and only on women, with the head always missing. The main suspect is David, the husband of Cruz's lover Francisca, who claims a \"monster\" did it and is communicating with him telepathically, repeating over and over again, '\"Die, monster, die.\" Though Cruz is skeptical, the clues keep adding up: green goo and overgrown teeth found near the victims. He's not sure anymore what's real and what's supernatural. Could there really be a monster on the loose?\n\nIn this dark fairytale, every shot is a carefully composed painting where the action, colors, and visions merge to take you into a strange elsewhere, and provoke a growing sense of unease, disgust and shock. The entangled storylines broach wider subjects as well, and you can't help but be pulled in.\n\nFor his second solo feature, Alejandro Fadel (notably an established screenwriter for Pablo Trapero) decided to come back to Mendoza, where he was born and where the rough and evocative landscapes (literally a real-life Rorschach test) made a lasting imprint on his memory. As much as nature is an active participant in this story, Fadel is principally fascinated by bodies, and that sheer physicality can be seen in this film, built around the way they move and evolve and touch. Special mention for the dancing scene, both unsettling and touching, set to an iconic track, which highlights the troubling gray area that can exist between fantasy and trauma.\n\nWill you understand everything? Probably not. But is the ride worth it? Most definitely. (SONIA DROULHIOLE)\n\nWith Producer Agustina Llambia Campbell in Attendance for 1st half.",
    "directors": [
        "Alejandro Fadel"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/murder-me-monster"
    },
    "runtime": 109,
    "synopsis": "Visual horror masterpiece MURDER ME, MONSTER lures you into the fascinating and opaque underworld of serial murder, supernatural obsession, metaphysical hallucinations, forbidden love — and one nightmarishly gross monster.",
    "title": "Murder Me, Monster",
    "year": 2018
}