{
    "countries": [
        "United States",
        "Serbia"
    ],
    "description": "In a world where we're inundated with dime-a-dozen, throwaway horror films that clutter our streaming services and cinemas, it's refreshing to find a true gem that both honors the films of the past and offers a fiendish ride that escalates the tension to an explosive end. The Fantastic Fest programming team is honored to premiere OPEN 24 HOURS.\n\nMary (Vanessa Grasse of LEATHERFACE) has a criminal background. She has done a short stint in the slammer for setting her serial killer boyfriend on fire, a fact she's not afraid to let people know, especially any creeps that come her way. She is being hounded by her parole officer, but despite having a few unsettling premonitions, Mary gets a break and is hired at a low-rent, all-night convenience store in the middle of nowhere.\n\nAfter being given the quick rundown by the current cashier Bobby (Brendan Fletcher of RAMPAGE and FREDDY VS JASON), Mary's left alone to fend for herself on a damp, ugly night. She's then visited by a few manifestations and a bevy of gas station regulars. As the rain falls, things go off the rails in a serious way.\n\nPadraig Reynolds returns after RITES OF SPRING and THE DEVIL'S DOLLS with a rousing, dark horror film that brings a fresh take on the paranoid delusional protagonist by pairing it with an electric, tension-building roller coaster of a midnighter. There's a clear love of slasher films at work here, but Reynolds circumvents cliché territory. Instead, with a solid cast, a mostly one-location setting, and sharp editing, he brings Fantastic Fest a film that hammers home an exceptionally brutal yet fun thrill ride. (NOAH LEE)\n\nWith Director Padraig Reynolds, Producer Ms Shibani Kapur, and Actor Vanessa Grasse in Attendance.",
    "directors": [
        "Padraig Reynolds"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/open-24-hours"
    },
    "runtime": 100,
    "synopsis": "A young woman who had previously set her serial killer boyfriend on fire is now seeking normalcy by getting a job working the overnight shift at a 24-hour convenience store, where things are most definitely not going to be normal.",
    "title": "Open 24 Hours",
    "year": 2018
}