{
    "countries": [
        "United States"
    ],
    "description": "The genre world has eagerly awaited the second film by Nicolas Pesce following his disturbing 2016 debut, THE EYES OF MY MOTHER. Pesce does not disappoint with PIERCING, which perpetuates his signature melding of haunting visuals and psychological torment. Christopher Abbott (IT COMES AT NIGHT; JAMES WHITE; GIRLS) stars as Reed, a young businessman and first-time father looking for a way to relieve a little stress. When he finds himself inexplicably standing over his newborn baby with a knife, he realizes it's time to come up with a new strategy. What follows is a journey that initially feels familiar — shady husband goes on a \"business trip\" and hires a prostitute — but all familiarity disappears when he unveils a meticulous, torture-filled plan to murder said prostitute. For context, all of this happens in the film's first ten minutes. There are many more twists to come.\n\nAbbott stuns in a demented yet restrained performance that deviates so far from his previous work, you'd be excused for not recognizing him. Get particularly excited for his incredibly accurate murder pantomime, complete with matching sound effects! Mia Wasikowska (CRIMSON PEAK; STOKER) continues her reign as a low-key genre superstar willing and able to take incredible risks as the endearing and enigmatic prostitute, Jackie. Together, these two develop a bonkers brand of sexual chemistry, complete with violent S&M outbursts and a tug of war of lust, tenderness, and power.\n\nPesce's vision is a stunning amalgamation of genre references and touchstones — Grindhouse visuals, De Palma split screens, AMERICAN PSYCHO voiceovers, and Agatha Christie cat and mouse trappings — that still somehow feels wholly fresh and original. Stacked with layers of twists you couldn't possibly see coming and visual hallucinations that will sear themselves in your brain, PIERCING is a tightly contained, rapid-fire rollercoaster of genre mastery. (LOGAN TAYLOR)\n\nWith Director Nicolas Pesce in Attendance for 1st half.",
    "directors": [
        "Nicolas Pesce"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/piercing"
    },
    "runtime": 81,
    "synopsis": "From the twisted mind of Nicolas Pesce (THE EYES OF MY MOTHER) comes a provocative two-hander chamberpiece — a tense battle of wits and desire between prostitute and trick, predator and prey.",
    "title": "Piercing",
    "year": 2018
}