{
    "countries": [
        "Republic of Korea"
    ],
    "description": "With his gravelly voice booming through the screen, lead actor/writer/director Park Nou-sik, a veteran of no less than 900 feature length films, debuted behind the camera in 1971 the only way he knew how to, by barreling forward with brawn and passion and never looking back. Presented for only the second time outside of Korea and for the first time in English, Fantastic Fest has dug up the Korean action gem QUIT YOUR LIFE, a breathless tale of pulpy panache, broiling machismo and the cold, harsh tears of revenge.\n\nA seaside tryst is interrupted when a rope smashes through a car window, setting off a brutal cycle of retribution. The roots of violence date back to the Japanese Colonial Occupation of Korea, when Jeong-su and Cheol-ho engaged in back-breaking work at a mine in Manchuria. There, the nefarious Dal-gyu hatched a plan that saw Jeong-su falsely blamed for stealing gold and sentenced to death at the end of a rope. Later, Cheol-ho returns to Korea where he seeks out Jeong-su's wife, who has become blind since her husband's departure. Unable to tell her the truth, he poses as Jeong-su and thus begins to hatch his plan against the now powerful tycoon Dal-gyu, which includes knocking off his cohorts and seducing his daughter, armed only with his noose, wits, and burly charm.\n\nSneering in the face of subtlety, Park's film emphasizes momentum and melodrama as it seeks to redress the wounds of the past. Long before it was in vogue to do so in Korean films (think THE AGE OF SHADOWS or ASSASSINATION), he mined the pain of the Colonial Era time and again in his films, such as DEVIL! TAKE THE TRAIN TO HELL. Full of psycho-sexual torment and emotional excess, QUIT YOUR LIFE provides a road map to the modern Korean revenge drama. Come discover it for yourself for the very first time in North America! (PIERCE CONRAN)\n\nThank you to our sponsor HI-YAH! — your new favorite martial arts and action movie channel, from your friends at Well Go USA.",
    "directors": [
        "PARK Nou-sik"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/quit-your-life"
    },
    "runtime": 82,
    "synopsis": "Presented in English for the first time, actor-director Park Nou-sik balances the scales of justice as he stalks around Korea with his noose of judgment in the relentless revenge drama QUIT YOUR LIFE.",
    "title": "Quit Your Life",
    "year": 1971
}