{
    "countries": [
        "France"
    ],
    "description": "It's hot in the South of France and our little campground next to the river is a microcosm of summer clichés: infatuations and unrequited puppy love, Miss Camping elections and corny disco parties, disappearing panties and... disappearing men. A leopard on the loose is supposedly to blame for two victims already.\n\nLaura (Lily-Rose Depp) and her cousin (Aloïse Sauvage) occupy their days with petty theft and fantasizing about boys. Yann, the self-proclaimed local teenage heartthrob, sets his sights on Laura, but after a brief make-out session and her subsequent rejection, he goes missing. Socially weird and disconnected, Laura becomes the focus of police suspicions, but when they come to question her, she's obsessing about the brooding horror writer next door, Paul (a creepy Laurent Lafitte). Given the man-eating animal situation, and convinced that something about him seems off, Laura decides to investigate further and sets a game of cat and mouse in motion, not realizing just how dangerous he could be.\n\nVincent Mariette changes register for his second feature, co-penning this summer sun-soaked thriller with Marie Amachoukeli, and leaving his usual brand of moving buddy comedy for a deep coming of age tale served by France's most interesting up-and-coming talents. His tour-de-force serves us a universal story about first love in a very unsettling way, slowly building tension through an ever-moving camera, disturbing personas, and an amazingly dread-infused score. SAVAGE brings typical teenage angst to a whole other level, and leaves us unsure of just how much of these relationships are real.\n\nOne thing is certain: this summer will leave its mark on everyone. (SONIA DROULHIOLE)\n\nWith Director Vincent Mariette in Attendance for 1st half.",
    "directors": [
        "Vincent Mariette"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/savage"
    },
    "runtime": 83,
    "synopsis": "Summer is in full swing and men are going missing. People are talking about a leopard on the loose in the area. A mysterious horror writer is in the bungalow next door. And Laura's most disturbing summer has only just begun.",
    "title": "Savage",
    "year": 2018
}