{
    "countries": [
        "France"
    ],
    "description": "SCHOOL'S OUT is the second feature from Sébastien Marnier, director of the slow-burn 2016 Fantastic Fest thriller, FAULTLESS. His newest film opens with the sudden in-class suicide of a high school French teacher — a jarring scene made all the more shocking by one group of students' calm, almost expectant reactions. Enter Pierre Hoffman, a rookie substitute given the impossible task of maintaining classroom normalcy over the stressful last weeks of the school year for his ambitious, gifted, and strikingly mature students. Played by the handsome, charming, and mysterious Laurence Lafitte of ELLE fame (or perhaps notoriety), Pierre becomes a relatable yet unreliable stand-in for the audience's doubts when he starts to sense something off about his students. His growing paranoia slowly devolves into an obsession exacerbated by the hypnotic hold the students seem to have over the rest of the administration, not to mention the violent tendencies the students exhibit outside school grounds.\n\nMarnier's film unfolds with patience and intricate character development, proving that his debut's cleverly escalating thrills were no beginner's luck. His sharp writing and careful directing are further elevated by incredible performances across the board, particularly from Lafitte as he struggles to prove his suspicions without implicating himself in the process, and from the supporting cast of hauntingly stoic, wiser-than-their-years teenagers that are well-loved by the rest of their community.\n\nThough on the surface it may feel like a familiar story of potentially misguided paranoia, SCHOOL'S OUT refuses to be pigeonholed into any cliché thriller framework. Instead, it defies every audience assumption by extending its narrative far beyond the walls of the prestigious private school, ultimately becoming a broader existential meditation on contemporary society. An exercise in slow, intentional build-up of philosophical dread, SCHOOL'S OUT is impossible to tear your eyes from and equally impossible to predict. (LOGAN TAYLOR)",
    "directors": [
        "Sébastien Marnier"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/schools-out"
    },
    "runtime": 103,
    "synopsis": "In this dread-soaked cerebral thriller, a handsome young substitute teacher gets in over his head when taking on a class of gifted students after their former teacher's dramatic in-class suicide.",
    "title": "School's Out",
    "year": 2018
}