{
    "countries": [
        "Canada"
    ],
    "description": "Charlotte is in love, determined to do whatever she can to please her boyfriend Samuel. So when Samuel confesses he's gay, her world's turned upside down, and her friends Mégane and Aube rush in with plenty of pot and alcohol (and seriously question how she didn't know he was gay). Stumbling into the local toy store one night, the girls discover a cornucopia of hot guys working there. That's reason enough to fill out applications, and the three girls land their first jobs. The staff is mostly older guys, each attractive in his own way. Thefew other female employees are welcoming at first, until Charlotte starts sleeping her way through every male employee of the store. Her casual rebounds will eventually set everyone against her, including her friends, and soon the whole store explodes in a war of sex.\n\nIn only her second feature film, actress-turned-director Sophie Lorain has made something truly special. Flowing easily and effortlessly, this coming-of-age story feels familiar, yet fresh and new. Presented in black and white with a smooth, silky glow to the highlights and a slight softness to the focus, Alexis Durand-Brault's cinematography gives the film a sense of innocence as well as a dreamlike quality that complements the story. With its frank and open take on sexuality, friendly ribbing between the three girls, and a good amount of pot-smoking at their minimum wage job, the film calls to mind early Kevin Smith but with female leads. Touching on serious societal issues like sexual double standards without ever feeling preachy, SLUT IN A GOOD WAY is an incredibly entertaining sex-positive comedy that's charming enough to warm — and win over — even the coldest hearts. (LUKE MULLEN)",
    "directors": [
        "Sophie Lorain"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/slut-in-a-good-way"
    },
    "runtime": 89,
    "synopsis": "Charlotte and her best friends Mégane and Aube must navigate their first times, first jobs, and first loves in this hilarious and touching Quebecois sex comedy.",
    "title": "Slut in a Good Way",
    "year": 2018
}