{
    "countries": [
        "United Kingdom",
        "United States"
    ],
    "description": "Fantastic Fest receives hundreds of submissions annually, and this year STARFISH was one of the finest discoveries to come across our screens. From first time filmmaker Al White, lead singer of the UK band Ghostlight, comes an unorthodox horror film that meshes an honest portrayal of loss with music, its effect on the world around us, and its connection to the end of the world.\n\nAubrey is still reeling from the loss of her best friend, Grace. Having attended an awkward wake, she leaves early and assuages her grief by breaking into her friend's flat in hopes of filling the hole in her heart, even if only for a while. Rummaging through the apartment and taking care of Grace's abandoned pets, Aubrey eventually dozes off, but not before playing a mixtape left behind in a tape deck, and being visited by a benevolent vision of her beloved friend.\n\nAubrey wakes to a world almost unrecognizable. Snow covers the ground outside, the streets are littered with wrecked and abandoned cars, fires burn unabated, and the few people left are running for their lives or hiding behind locked doors. With the help of a mysterious voice on a walkie talkie and a series of hidden mixtapes left behind by Grace, Aubrey seeks to unravel the mystery of what's been unleashed, hoping that the journey will bring her some closure... and maybe save the world along the way.\n\nSTARFISH is not your average chiller by any means. While the scares are here, White instead chooses to address the horror of grief, an emotion every human must eventually face. Not afraid to meld science fiction, indie rock, Lovecraftian creature designs, moments of pure solitude, one outstanding animation sequence, and so much more, the film is a wholly refreshing journey towards the apocalypse. Anchoring the film is an extraordinary performance from Virginia Gardner (RUNAWAYS) who, as Aubrey, does all the heavy lifting in the film. Her quiet despair deftly intertwined with the soundtrack are the emotional testament that both grief and music have the power to change the course of people's lives and possibly the world around us. (NOAH LEE)\n\nWith Director A.T. White, 1st A.D./Co-Producer Nathan Hertz, Producers Edgar Romero and Tanroh Ishida, and Actor Christina Masterson in Attendance.",
    "directors": [
        "A.T. White"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/starfish"
    },
    "runtime": 99,
    "synopsis": "A girl. A mixtape. And Armageddon. A uniquely honest portrayal of loss as a young woman struggles with the death of her best friend while dealing with the horrific Lovecraftian end of the world, driven by a beautiful indie music soundtrack.",
    "title": "Starfish",
    "year": 2018
}