{
    "countries": [
        "United States"
    ],
    "description": "Fantastic Fest has always endeavored to seek out idiosyncratic auteurs, particular those who ply away in obscurity with meager resources and inspired imaginations. Endearing in part by virtue of their shrewd ingenuity, these productions are foremost beguiling reminders that the mettle of a movie is best measured not by its grasp, but rather its ambition to reach for an indelible and individual identity.\n\nEnter underground Oklahoma filmmaker Mickey Reece. Since 2008, this veritable \"Soderbergh of the Sticks\" has written, directed, and produced over twenty undistributed no-budget feature films, each one a unique experiment in form, genre and aesthetic, and most of which feature the same cast of eccentric actors culled from his local arts community. As dexterous a creator as he is a compulsive one, Reece's latest opus marries much of his signature proclivities — misfit protagonists, off-kilter performances, rigorous compositions, and discordant melodrama — as he conjures up a wholly wackadoo psychodrama inspired in part by both Ingmar Bergman's AUTUMN SONATA and The Velvet Underground's \"Venus in Furs.\"\n\nProceeding with a detached and dryly hilarious severity reminiscent of Yorgos Lanthimos, STRIKE DEAR MISTRESS, AND CURE HIS HEART chiefly concerns the acidic reunion of a famous pianist (Mary Buss) and her estranged daughter (Audrey Wagner) within the uncanny corridors of a run-down Victorian hotel. As Reece envelopes these characters in a pervasively unnerving atmosphere, rife with theatrical explosions of emotion and the discordant timbre of Nicholas Poss's magnificently manic score, he also confidently weaves in a surreal parade of peculiar digressions that deliriously teeter from comic pantomime to tableaus of abject horror. The result is an offbeat and oft-chilling confluence of ingredients that's guaranteed to simultaneously baffle, delight, and captivate those with an appetite for the strange and unusual.\n\nAll fans of the experimental genre shorts that populate Fantastic Fest's SHORTS WITH LEGS sidebar need definitely apply. (PETER KUPLOWSKY)\n\nWith Director Mickey Reece in Attendance.",
    "directors": [
        "Mickey Reece"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/strike-dear-mistress-and-cure-his-heart"
    },
    "runtime": 71,
    "synopsis": "Inspired by Ingmar Bergman's AUTUMN SONATA and conjured by a remarkably prolific obscure auteur who's been averaging two feature films a year since 2008, this offbeat and oft-chilling indie discovery depicts the uncanny psychological duress endured by the newlywed proprietors of an ancient hotel following the arrival of an estranged matriarch.",
    "title": "Strike, Dear Mistress, and Cure His Heart",
    "year": 2018
}