{
    "countries": [
        "Canada"
    ],
    "description": "On the rocks and on the open road of rural Ontario, a crummy husband and his weary wife find themselves careening off a bridge when a petty squabble over a get-rich-quick scheme accelerates into a revelation of infidelity. Both survive, but when the husband discovers his wife's critical condition, he plans to leave her to die in a calculated ploy to collect a hefty life insurance payout. However, his cruel intentions are complicated when a good samaritan happens by the accident and offers to help. What ensues is a wickedly taut and unpredictable cat-and-mouse thriller that evokes the likes of the Coen Brothers' BLOOD SIMPLE as it confidently crackles towards its nerve-shredding climax.\n\nWhile the ill-advised moustaches on display belie campy but indelibly berserk performances, it is one-and-done filmmaker Brian Damude's skillful direction that leaves the biggest impression. An editor by trade, Damude deftly ratchets the tension as his characters contort themselves confronting sustained moral transgressions that anxiously play out with scant dialogue and a weave of judicious cross-cutting and decisive 16mm photography.\n\nSUDDEN FURY was a critical and commercial hit when it was first released at the start of the great white north's infamous Tax-Shelter Era of exploitation cinema, but the lack of a subsequent home video release led to the film being unfairly forgotten in the intervening decades. Recently rescued from Canadian obscurity and restored by Vinegar Syndrome, this brilliant maple-syrup nail-biter can finally be re-embraced as a bonafide genre classic of suspense and pitch black morality. (PETER KUPLOWSKY)\n\nWith Director Brian Damude in Attendance.",
    "directors": [
        "Brian Damude"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/sudden-fury"
    },
    "runtime": 91,
    "synopsis": "When a well-intentioned bystander rushes to the scene of a violent car wreck, he finds himself embroiled in a hot mess of desperate homicide in this wickedly taut and unpredictable thriller, recently rescued from Canadian obscurity and restored by exploitation video label Vinegar Syndrome.",
    "title": "Sudden Fury",
    "year": 1975
}