{
    "countries": [
        "Argentina"
    ],
    "description": "A quiet street in a Buenos Aires neighborhood is disturbed by a series of mysterious and unsettling events. A woman hears hostile voices coming from the sink. Her husband is being driven crazy by his neighbor's 5am remodeling projects. That neighbor — whom nobody has seen recently — has been desperately attempting to get in touch with a paranormal investigator to explain some disconcerting activity in his house. Across the street, a grieving mother makes her own horrific discovery prompting an investigation from a soon-to-retire detective known for his interest in the occult.\n\nThe clever ways in which the pieces of TERRIFIED's plot are revealed and woven together are just the beginning of the bountiful joys in store for horror fans. It announces its singular goal clearly from the beginning scenes: to scare the shit out of everyone in the audience. And its commitment to that goal is relentless.\n\nDirector Demián Rugna does not constrain himself to a single type of horror in TERRIFIED and culls influences from several other genres. This has the effect of tricking the audience into thinking they know what might happen next. Rugna is obviously well-versed in horror tropes and audiences' expectations of them, and his ability to play with those and turn them inside out is the greatest revelation of the film. If you ever have the notion that you know what TERRIFIED has waiting for you up its sleeve, trust us... you don't.\n\nTERRIFIED is not just a new landmark for Argentine horror, it's a calling card for director Rugna on the international horror stage. From its score, its precisely tuned sound design, and its excellent special effects, to its absolute refusal to keep any character safe, it is expertly crafted to fulfill the horror fan's truest desire: to be totally and deeply terrified. (BRIAN KELLEY)\n\nWith Director Demián Rugna in Attendance for 1st half.",
    "directors": [
        "Demián Rugna"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/terrified"
    },
    "runtime": 87,
    "synopsis": "Strange things are going on in a Buenos Aires neighborhood. Demián Rugna's constantly surprising and truly spine-chilling horror film has one goal: to scare the shit out of everyone.",
    "title": "Terrified",
    "year": 2017
}