{
    "countries": [
        "United States"
    ],
    "description": "To refer to a notorious New York Grindhouse cinema strip: this flick goes all the way to 42nd street. Consider that a sincere warning.\n\nA former cello prodigy (Allison Williams) seeks out both her mentor (Steven Weber) and his new star pupil (Logan Browning) with enigmatic intent in this twisty and undeniably twisted midnighter. Co-writing with Eric C. Charmelo and Nicole Snyder, stalwart television director Richard Shepard (also known for outrageous dark comedies like DOM HEMINGWAY and THE MATADOR) brings the pervasive menace he evoked in his critically acclaimed \"American Bitch\" episode of HBO's GIRLS and magnifies it to De Palma-level proportions of sensationalism and suspense as he ratchets the film's initial mysterious conceit to delirious and disturbing heights.\n\nFrom an agonizingly uncomfortable incident on a slow bus through China to a nail-biting cello performance with vile stakes within a remote Massachusetts estate, both Browning and Williams remain fearless in their high-wire act performances, and effectively anchor the severe and relevant thematics that underlie the film's ultimate trajectory with a bed of emotional integrity.\n\nDivided into four movements, each adopting a distinct genre flavor from lurid erotic thriller to high anxiety body horror, Shepard consistently modulates the increasingly high-concept melodrama to maddeningly unpredictable crescendos, peeling back revelation after revelation before finally arriving at a shocking climax guaranteed to leave the audience gobsmacked. (PETER KUPLOWSKY)\n\nWith Director Richard Shepard and Actors Allison Williams and Logan Browning in Attendance.",
    "directors": [
        "Richard Shepard"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-perfection"
    },
    "runtime": 90,
    "synopsis": "A former cello prodigy (Allison Williams) seeks out both her mentor (Steven Weber) and his new star pupil (Logan Browning) with enigmatic intent in this twisty and undeniably twisted midnighter.",
    "title": "The Perfection",
    "year": 2018
}