{
    "countries": [
        "Denmark"
    ],
    "description": "I can't tell you very much about what happens in Gustav Möller's feature debut, THE GUILTY. The spoiler-free premise I will share is rather simple: Jakob Cedergren, who is on screen for seemingly every single frame of the film, plays an emergency responder stressed to his breaking point. On this fateful night, he takes an assortment of calls from drug addicts and drunks, either getting into fights at bars or falling off their bikes and scraping their knees. Then he takes a call from someone who has been kidnapped. The victim is in a van but doesn't know where they are or where they are going. Cedergren's character, Asger, must use what wits he has left to find them before his call reaches a potentially violent conclusion.\n\nHere's what else I can tell you: there's almost nothing a director can show on screen that's more effective than what you'll imagine in your own head with the right prompting. Möller's THE GUILTY is the latest example of taking a straightforward conflict, keeping the setting in one contained location, working with a terrific acting talent, and pushing everything else into the audience's head.\n\nMöller keeps the running time here at a brisk 85 minutes, and even if Cedergren dominates the screen, Möller and director of photography Jasper J. Spanning keep things interesting inside the frame, finding every tense angle possible to shoot their main actor. The sound design in THE GUILTY is equally as impressive as the audience desperately seeks out any sound over the phone that can help both them and Asger get closer to finding a safe resolution to the crime. Finally, Möller proves that the further we rely on our own imagination and our own expectations, the easier it is to keep the twists and turns coming. (JAMES EMANUEL SHAPIRO)\n\nWith Writer/Director Gustav Möller in Attendance for 1st half.",
    "directors": [
        "Gustav Möller"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-guilty"
    },
    "runtime": 85,
    "synopsis": "A horrific crime; an emergency responder struggling to stay off the edge; a kidnapping victim calling in for help. This is all we're going to tell you about first-time feature filmmaker Gustav Möller's unmissable and gripping debut thriller.",
    "title": "The Guilty",
    "year": 2018
}