{
    "countries": [
        "Chile"
    ],
    "description": "Directors Cristóbal León and Joaquín Cociña's THE WOLF HOUSE marks their transition into feature animation from the many shorts and artwork they've previously produced, building upon their solid foundation of striking imagery and inventive storytelling.\n\nFramed by a coda that sells the film as a restored piece of history from the archives of a German colony that exists in the Chilean countryside, THE WOLF HOUSE immediately establishes a sense of unease that gradually snowballs into an endless journey of existential dread as we watch the alleged vintage film. It's seemingly a children's story that recounts what happens to Maria who, as a punishment, is forced to spend a hundred days and hundred nights alone in a cabin in the woods.\n\nTo reveal more would take away from the breathtaking storytelling on display. Utilizing a wholly individual animation style, the co-directors construct a world of horror that feels like the kind of evil that we somehow suspect underpins our society, an unsettling human condition buried deep within our psyche. The visual detail on display is astounding, with shadows blending into the walls which crumble and roll into creatures both familiar and unrecognizable whilst the environment is perpetually shifting and morphing, inventing a frightening but beautiful setting that traps the audience as well as Maria.\n\nIt is not often we encounter a piece of filmmaking that is so assured in its intentions and so astute in how to achieve them. THE WOLF HOUSE is a compelling, enigmatic, and evil puzzle box that continues to burrow into your subconscious long after the film has ended and there's nothing but shadows left in the cinema. (EVRIM ERSOY)\n\nWith Director Cristóbal León in Attendance for 2nd half.",
    "directors": [
        "Cristóbal León",
        "Joaquín Cociña"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-wolf-house"
    },
    "runtime": 73,
    "synopsis": "An animated tale, supposedly restored from the archives of a German colony by the Chilean government, THE WOLF HOUSE is the unsettling story of Maria, punished with a hundred nights alone in a cabin in the woods.",
    "title": "The Wolf House",
    "year": 2018
}