{
    "countries": [
        "Switzerland",
        "Germany"
    ],
    "description": "Last year we introduced you to Swiss filmmaker Lisa Brühlmann, who \"blue\" your mind with her tale about female body transformation. Switzerland seems to have spawned a new breed of filmmakers who are no longer interested in rural dramas or in showing our beautiful landscapes. Instead, they dig deep into the darkness that inhabits us, and they manage to create tales that will unsettle you and make you wonder about your own existence.\n\nEnter Simon Jaquemet with his second feature, THE INNOCENT. Already creating a buzz with 2014's furious tale about youth (CHRIEG a.k.a. WAR), here Jaquemet takes us on an unforgettable journey into the heart of religion, God, and the Devil, in which a woman's faith is tested when her ex-lover comes back to visit her after twenty years in prison.\n\nRuth is a seemingly happy wife and mother stuck in her routines, both occupational and religious. Her job at a neuroscience lab requires her to turn a blind eye to the ways the doctors play God with monkeys, and it's becoming more and more difficult for her to keep everything on an even keel. Her fragile reality starts to crumble when her ex-lover Andreas pays her a short visit, and her resulting questioning of reality and erratic behavior pushes her family and her church to extreme measures.\n\nTHE INNOCENT takes its time but it will creep up on you, plunging you into a cinematic nightmare where science and religion clash. Backed by the fantastic cinematography of Gabriel Sandu and featuring an outstanding performance by Judith Hofmann as Ruth, THE INNOCENT is probably the best film to come out of Switzerland in a very long time, and it should establish Simon Jaquemet as a solid new player in the film panorama. (ANNICK MAHNERT)\n\nWith Director Simon Jaquemet in Attendance for 2nd half.",
    "directors": [
        "Simon Jaquemet"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-innocent"
    },
    "runtime": 113,
    "synopsis": "In this dark and fantastical tale about religion versus science and good versus evil, a woman's faith is being tested as her ex-lover reappears in her life after twenty years in jail.",
    "title": "The Innocent",
    "year": 2018
}