{
    "countries": [
        "Spain",
        "France",
        "Belgium",
        "Portugal"
    ],
    "description": "Given the almost Grecian levels of tragedy that have plagued the production of this film, finally seeing that THE MAN WHO KILLED DON QUIXOTE is exactly the film we all hoped for is a pleasure that's impossible to deny.\n\nAdam Driver is Toby, a young filmmaker working in advertising who has lost his love for his job along with any real artistic ambition. When he stumbles on a film he made as a student a decade ago, he decides to revisit the shooting location and discovers that his work has had a deep effect on the tiny village. The shoemaker he cast in the film now actually believes he's Don Quixote and is convinced that Toby is his Sancho Panza.\n\nAs the two men set off on a weird and magical journey across Spain, Toby must come to terms with who he is, the consequences of his actions, and most importantly, the nature of reality.\n\nTeeming with inventive ideas from the first frame onwards, Terry Gilliam's magnum opus imitates its source material with glee. Taking on the structure of the classic tales of Don Quixote, the director uses the film as an incisive commentary on the nature of art, the responsibility of the artist, and the madness of the world that surrounds us all. With masterful performances from both Jonathan Pryce and Adam Driver, Gilliam's penchant for chaos is indulged in the most whimsical and wonderful ways, with sequences that elicit gasps of both astonishment and wonder in plentiful supply.\n\nWhile a testament to the dogged determination of its director, THE MAN WHO KILLED DON QUIXOTE surges beyond the legend of its own inception to form a magical fantasy that's as much about its creator's attitude towards art as its characters' battle for what is true within a false world. (EVRIM ERSOY)",
    "directors": [
        "Terry Gilliam"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-man-who-killed-don-quixote"
    },
    "runtime": 132,
    "synopsis": "Once-ambitious advertising man Toby finds himself revisiting a student film he made long before his world became monochrome. Re-teaming with the Spanish cobbler he cast in the film who genuinely believes he's Don Quixote, Toby embarks on a soul-searching journey of magical proportions.",
    "title": "The Man Who Killed Don Quixote",
    "year": 2018
}