{
    "countries": [
        "Japan"
    ],
    "description": "Director Kazuya Shiraishi's loose homage to Kinji Fukasaku's BATTLES WITHOUT HONOR AND HUMANITY is the kind of cops vs. yakuza flick that has been long lacking in current Japanese cinema. Full of tough-as-nails characters and doused in wall-to-wall violence, this brilliant creation is sure to please lovers of the genre. Based on the book by Yûko Yuzuki, THE BLOOD OF WOLVES is an assault on the senses elevated by amazing performances.\n\nOgami Shogo is an old hand at police work on the streets of Hiroshima. Tougher than tough, his unorthodox methods ensure a fragile balance between the different yakuza gangs vying for control of the city. When he's unexpectedly partnered with newcomer Hioka Shuichi, Ogami is less than pleased. However, a rapport slowly develops in these two opposing characters as they follow the thread of a routine disappearance case which hides more secrets than either of them can imagine. As the heat rises and the gangs start howling for blood, the two detectives are the only thing standing in the way of Hiroshima's streets drowning in blood.\n\nStarring Kôji Yakusho as the rogue cop Ogami, THE BLOOD OF WOLVES is at once a tribute and re-invention of the classic yakuza film. Smart casting of some of the most prolific Japanese actors in side roles gives the film a well-established lived-in feeling, while the gorgeous cinematography draws every inch of atmosphere from Hiroshima. When the violence comes, it's sharp and brutal, and the danger that these men face is visceral thanks to great action sequences.\n\nProving that there's still life left in the genre, Kazuya Shiraishi delivers one of the most explosive titles at Fantastic Fest, a full-blown vicious attack on the senses that will remind you the power of the big screen. (EVRIM ERSOY)",
    "directors": [
        "Kazuya Shiraishi"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-blood-of-wolves"
    },
    "runtime": 126,
    "synopsis": "In the neon-soaked streets of 1988 Hiroshima, experienced detective Ogami Shogo is forced to partner with greenhorn Hioka Shuichi to investigate a routine disappearance case. Soon they're in the midst of a full-blown yakuza war that threatens to destroy all that the two men hold dear.",
    "title": "The Blood of Wolves",
    "year": 2018
}