{
    "countries": [
        "France"
    ],
    "description": "François (Karim Leklou) is no Scarface. More lovable than your ordinary drug dealer, he inserts lottery tickets in his drug bags to increase sales, and he dreams of opening a Mr. Freeze franchise in North Africa. One problem: his safe-cracking con artist of a mother (the perfect Isabelle Adjani) has gambled away his seed money. Now, François has no choice but to collect one last delivery of product from a Scottish drug lord with his best friend (Vincent Cassel), his love interest (Oulaya Amamra), and two bumbling idiots who are both named Muhammad.\n\nElaborate heist films are among the most satisfying cinematic genres, especially when they're filled with incredible actors. THE WORLD IS YOURS has a cast so pitch perfect that every single one of them steals every single scene, often all at the same time. We expect Adjani to blow us away, and Cassel prompts a full body laugh with almost every line he speaks, but everyone in this movie keeps up. Even François' wacko crime boss — on screen for maybe seven minutes total — is captured so perfectly that you may never forget him. However, it's the central performance of Leklou as François that elevates the film to one of the year's best. You see how driven he is, how smart he is, but most importantly, how big his heart is. He just wants a house and a pool, and you root like hell for him to get it.\n\nTHE WORLD IS YOURS is an embarrassment of acting riches, but Romain Gavras also directs the ever-living hell out of the script. It's perfectly paced, beautiful to look at, and it carries a soundtrack and score that is probably my favorite of the year. This movie is alive, and it certainly has the best needle drop I've seen so far. I beg of you: find room in your schedule for this gem. (JAMES EMANUEL SHAPIRO)",
    "directors": [
        "Romain Gavras"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-world-is-yours"
    },
    "runtime": 100,
    "synopsis": "Nothing goes as planned when a Parisian mid-level dealer must complete one last delivery to escape the drug life and open a Mr. Freeze franchise in Romain Gavras' (OUR DAY WILL COME) instant heist-comedy classic.",
    "title": "The World Is Yours",
    "year": 2018
}