{
    "countries": [
        "Spain"
    ],
    "description": "In THE BASTARDS' FIG TREE, Rogelio, a powerful fascist soldier in the Spanish Civil War, ruthlessly hunts down and eliminates Spaniards who dare to go against the new regime. One night, when capturing a man for execution, he locks eyes with the man's ten-year-old son and is overcome with terror and guilt. He becomes convinced this boy will track him down and kill him once he reaches the age of sixteen.\n\nThis moment breaks Rogelio's resolve. Convinced that he must make amends for his crimes, he moves to a small shack in the countryside near his father's gravesite, and becomes a hermit and devout Falangist — a \"Soldier of God\" in his own words. A fig tree blossoms on his father's grave, the success and growth of which soon absorb his focus. Each time he feels his guilt returning, he channels more attention into the tree, losing a piece of his former self with every new branch that grows. At first, his friends and family try to convince him to return to his old life, but soon this Soldier of God becomes a figure of worship in his own right.\n\nProlific Spanish actor Karra Elejalde (ACCIÓN MUTANTE; TIMECRIMES) infuses Rogelio with a complex mix of darkness, sympathy, and quirkiness. Though he begins his role buttoned up and cruel, he eventually proves himself capable of an incredibly warm, humorous, and farcical performance.\n\nMuch like PAN'S LABYRINTH before it, THE BASTARDS' FIG TREE provides a fresh, magical exploration of the horrors of the Spanish Civil War, showing both the brutality of war and its ability to inspire hope and change in a broken society. It's astounding to realize this is only Murugarren's second time directing a feature film. Her work has a clear voice that shifts between fantasy, comedy, and drama with great ease.\n\nWith its dry humor, sharp political and religious satire, and lushly filmed magical realism, THE BASTARDS' FIG TREE is a unique and absorbing film you won't want to miss. (LOGAN TAYLOR)\n\nWith Director Ana Murugarren and Producer Joaquin Trincado in Attendance.",
    "directors": [
        "Ana Murugarren"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-bastards-fig-tree"
    },
    "runtime": 103,
    "synopsis": "In Ana Murugarren's whimsical THE BASTARDS' FIG TREE, a fascist soldier in the Spanish Civil War becomes a fig-tree obsessed hermit after looking into the vengeful eyes of a young boy whose father and brother he had violently executed.",
    "title": "The Bastards' Fig Tree",
    "year": 2017
}