{
    "countries": [
        "Malta",
        "United Kingdom"
    ],
    "description": "An unnamed fisherman sets out on his daily run but finds himself irredeemably lost when a thick fog suddenly surrounds his boat. However, it is when he crashes into an abandoned sailboat that his troubles really begin. Trapped onboard, he is forced to face an unknown enemy whose sole raison d'etre seems to be the fisherman's destruction.\n\nBuilding on a tradition of eerie, ghostly British tales, THE BOAT is a menacing thrill ride that pits a violent survival drama against the supernatural. In the leading role, Joe Azzopardi excels as the fisherman, a practical man whose quick thinking and sea-faring experience ensure that his fight against the unnatural force is more than even.\n\nIt would be churlish to not mention the role the brilliant cinematography plays in a film that relies on its setting to keep the mood sustained. Winston Azzopardi captures the sea in a duality that is immediately logical. While calm, serene and beautiful, it is also more than capable of turning into a monster ready to devour those who are not prepared. Scenes of storm and chaos are handled with aplomb, relying on practical effects and visual trickery as opposed to endless CGI, drawing the audience further into its world.\n\nA B-movie in the best sense of the phrase, THE BOAT is a brilliant thriller that cleverly highlights the natural in the supernatural. Facing that most unforgiving and vicious enemy, Nature, the fisherman needs to keeps his wits in order to survive. But the mysterious boat and the force that drives it add a superlative genre element to a film that will leave those who see it breathless, entertained, and convinced of the arrival of a new filmmaking duo whose next step they'll want to watch very carefully. (EVRIM ERSOY\n\nWith Director/Co-Writer Winston Azzopardi and Actor/Co-Writer Joe Azzopardi in Attendance.",
    "directors": [
        "Winston Azzopardi"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-boat"
    },
    "runtime": 89,
    "synopsis": "A lone fisherman on his daily run finds himself lost in a thick fog which proves impossible to navigate. The worst is yet to come when his encounter with a seemingly abandoned sailboat becomes a fight for survival against an enemy unknown.",
    "title": "The Boat",
    "year": 2018
}