{
    "countries": [
        "United States"
    ],
    "description": "Henry Dunham's tense, taut, breathtaking debut feels like the lovechild of David Mamet and a dime-store pulp thriller. Set over the course of one night, ex-cop Gannon becomes embroiled in the investigation of a mass shooting when that investigation leads to the same militia he joined after quitting the force.\n\nMaking the most of its limited setting, both in location and time, Dunham strips the story to its bones, creating a thriller which is as sharp as it is vicious. The characters don't speak as much as bark in staccato pulpy rhythm, and when the violence arrives, it's brutal and very real.\n\nBehind all the bravado, Dunham explores the dynamics of masculinity amid a roster of disenchanted characters, representing that fragment of society who feel themselves at odds with their surroundings. As Gannon utilizes his skills as an investigator and interrogator to get inside the skin of these men, the revelations of what makes them tick reflect back its own understanding of where Gannon's life has taken him: living in a trailer in the middle of nowhere, isolated and wary.\n\nTHE STANDOFF AT SPARROW CREEK may be sparse but that does not mean it is simplistic. The cinematography is often astounding, and Dunham's use of long shots to frame the action in a painterly fashion creates an otherworldly beauty that only enhances the central mystery. He understands the limitations of his single location, using it to his advantage as he builds visual layers that serve the film incredibly well.\n\nTHE STANDOFF AT SPARROW CREEK is both a throwback and a revelation. Combining the best of single-location thrillers with a new and unwavering eye, Dunham crafts one of the most exciting films of the year. (EVRIM ERSOY)\n\nWith Director Henry Dunham in Attendance.",
    "directors": [
        "Henry Dunham"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-standoff-at-sparrow-creek"
    },
    "runtime": 88,
    "synopsis": "Over the course of one grueling night, a militia tears itself apart as it searches for the perpetrator of a mass shooting among its own.",
    "title": "The Standoff At Sparrow Creek",
    "year": 2018
}