{
    "countries": [
        "Indonesia"
    ],
    "description": "For years, Ito and his crew were like family. A family of drug-runners and criminals, sure, but a family. But when Ito mysteriously disappears, the balances shifts. His crew splinters, Bobby loses a foot in the ensuing violence, and Arian takes a position in Triad upper management running nightclubs in Macau. Thinking him dead, his girlfriend Shinta moves on with her life.\n\nSo when Ito shows up years later with a young girl in tow and the Triads after him, there's a lot to catch up on. The old crew reassembles and tells him about Yohan, the psychotic butcher who took over the drug trade when Ito's crew imploded. Yohan also happens to have a stash of cash that Ito left behind, and he wants it back. Then there's Arian to deal with, after his Triad boss Chien Wu orders him to hunt and kill the child and his old friends. But Chien Wu isn't placing all his faith in Arian and sends an unbelievable onslaught of machete-wielding low-level wannabes to make sure the job gets done.\n\nDirector Timo Tjahjanto is back with a vengeance. One half of the creative powerhouse known as The Mo Brothers, a team responsible for MACABRE, KILLERS and Fantastic Fest 2016's HEADSHOT, as well as a killer segment in V/H/S 2, Timo is certainly no stranger to body counts. And yet he seems to be driven to constantly one-up himself, delivering more action set pieces and a higher death toll in this single film than most entire franchises can boast. Starring HEADSHOT's Sunny Pang, THE RAID 2's Zack Lee and Iko Uwais and Joe Taslim from THE RAID with Iko coordinating the action, the film is a veritable who's who of Southeast Asian martial arts superstars. Hold on to your ass because life is truly cheap in this insane roller coaster ride that'll hit you like a shot of adrenaline to your synapses. (LUKE MULLEN)\n\nWith Director Timo Tjahjanto and Actor Joe Taslim in Attendance for 1st half.",
    "directors": [
        "Timo Tjahjanto"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-night-comes-for-us"
    },
    "runtime": 121,
    "synopsis": "A former triad enforcer must protect a young girl while trying to escape his former gang, setting off a violent battle on the streets of Jakarta.",
    "title": "The Night Comes for Us",
    "year": 2018
}