{
    "countries": [
        "Argentina",
        "Spain"
    ],
    "description": "Luis Ortega's aesthetically stunning tale of Carlitos' crimes marries violent underworld drama with a tense character study, underlining the homoerotic subtext that is the crux of the relationship between its central characters. From the first brutal encounter between Carlitos and his schoolmate Ramon, sparks are flying. As Carlitos finds himself integrated into Ramon's working class criminal family, he embarks on a journey of self-discovery and felonies.\n\nBorrowing liberally from producer Pedro Almodóvar's palette, Ortega contrasts the violent realism of an Argentina under a dictatorship with the fantasy world of Carlitos, a place where dance, music, and lust rule supreme. Thus a television contest becomes a music video fantasy sequence, and all the crimes are punctuated by flights of fancy.\n\nThe central performance by Lorenzo Ferro delves into our fascination with violent, charismatic figures. His Carlos is the pinnacle of a middle-class boy — handsome, well-spoken, typical — whose psychopathic tendencies and lack of a moral compass create a dimension of uncertainty which threatens to spill into violence at any given moment. His moral detachment infects the very fabric of the film, imbuing all the crimes with a dark hilarity that's as brilliant as it is disturbing.\n\nSubversive, astute, and as enjoyable as they come, THE ANGEL is a whirlwind ride of crime, passion and dark humor. It's an unblinking look at a criminal whose psychology we may not quite understand, but whose electric charm enthralls us as much as it does his victims. (EVRIM ERSOY)",
    "directors": [
        "Luis Ortega"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-angel"
    },
    "runtime": 120,
    "synopsis": "In 1971 Argentina, Carlitos is a baby-faced youth whose good looks match his confident swagger. Carlitos' passion is stealing; the things he covets, he takes. But when he meets Ramon at his school, he embarks on his true calling: armed robberies and violent crimes.",
    "title": "The Angel",
    "year": 2018
}