{
    "countries": [
        "United States"
    ],
    "description": "On the surface, prairie life in the late 1800s looks simple enough for Lizzy. She's only expected to be a good wife, take care of the home, and have children. But something in those wide open plains is after her. Maybe it's just the wind, maybe it's an animal, maybe it's something more sinister. Whatever it is, it's slowly driving her mad. When a young woman appears on her doorstep, Lizzy feels she finally has someone to talk to and share her fears with. Soon, however, it becomes clear this new force in her life may not be a positive one.\n\nThe film unfolds out of order, with the ultimate chronology slowly unveiling itself as though it were a series of memories. The very first scene makes clear that something awful is in store for everyone on screen, and that incredible sense of dread never lets up.\n\nConsisting of very little spoken dialogue and stunning panoramas of the wide open plains, THE WIND presents a meditative, sun-soaked world that is unexpected and under-explored in supernatural horror films. Director Emma Tammi, however, has no problem finding atmospheric terror hidden in these vistas and lurking around the family's modest farm home. Largely, she relies on a soundscape consisting of amorphous howls of wind — and maybe something more animalistic — to unhinge both her characters and the audience.\n\nFeaturing grounded, restrained, yet dynamic performances by Caitlin Gerard (INSIDIOUS: THE LAST KEY) and Julia Goldani Telles (SLENDER MAN), plus supporting turns by male actors that echo contemporary examples of toxic masculinity, it's a timely exploration of the larger issues at hand for expectant mothers and women in domestic spaces. And though there are folkloric, supernatural elements at play, the story works just as effectively as a bold, fresh, and important tale of gender-based psychological destruction and perceived hysteria. (LOGAN TAYLOR)\n\nWith Director Emma Tammi and Producers Christopher Alender and David Viste in Attendance for 1st half.",
    "directors": [
        "Emma Tammi"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-wind"
    },
    "runtime": 89,
    "synopsis": "In Emma Tammi's narrative debut THE WIND, the forces of nature in the isolated prairies of the American Wild West are playing tricks on Lizzy. Her paranoia only grows with the arrival of a mysterious young woman.",
    "title": "The Wind",
    "year": 2018
}