{
    "countries": [
        "Brazil"
    ],
    "description": "Stênio can't catch a break. At home, his wife berates him constantly, showing open disdain for him, his hopes of financial stability, and the smell he carries home from his job. At work in the morgue, things are busy and the paramedics don't pass up any opportunities to pull pranks on him, spoiling what little time he might get to himself. If that weren't enough, he can't get the recently departed to shut up.\n\nOne day while talking with a newly dead acquaintance, Stênio learns a startling bit of information. Angered by what he has discovered and armed with a city's worth of dead men's secrets, Stênio chooses to use his forbidden knowledge for vengeance. This sets off a series of events that will threaten to destroy Stênio and his family.\n\nFantastic Fest first welcomed Brazilian filmmaker Dennison Ramalho (writer and chief assistant director of the final Coffin Joe film, EMBODIMENT OF EVIL) in 2010 with his stunning arthouse exploitation short film NINJAS. He most recently returned in 2014 with the equally brutal J IS FOR JESUS segment of ABCS OF DEATH 2. Having proven his absolute willingness to go all-in on the most disturbing and depraved of subjects and imagery, THE NIGHT SHIFTER marks his feature film debut and, not surprisingly, it is a masterfully dark, twisted, and gory genre-blend with a mean spirit.\n\nAs Stênio tries to contain the forces he has unleashed, nobody close to him is safe from metaphysical wrath, and soon children in peril becomes as routine as chatty stiffs during a long night at the city morgue. Ramalho injects the frightening-fantasy-turned-supernatural-horror with a razor-thin streak of humor, so dark you'd be forgiven if you completely missed it. As THE NIGHT SHIFTER ratchets up the terror, setting stakes higher and higher, it never skimps on the scares and gooey special effects.\n\nAs one wise corpse tells Stênio — too late, unfortunately — \"a dead man's secret is a deadly secret.\" And as it turns out, sometimes the fire of someone's rage and the depths of their evil nature become apparent only after they are dead. (BRIAN KELLEY)\n\nWith Actor Daniel de Oliveira in Attendance.",
    "directors": [
        "Dennison Ramalho"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-night-shifter"
    },
    "runtime": 110,
    "synopsis": "An attendant at a busy morgue who can also converse with the dead puts his loved ones in peril using his forbidden knowledge for vengeance in Dennison Ramalho's (NINJAS; ABCS OF DEATH 2) twisted and gleefully icky feature debut.",
    "title": "The Night Shifter",
    "year": 2018
}