{
    "countries": [
        "France",
        "Belgium"
    ],
    "description": "Lukas (Jean-Claude Van Damme) used to be a bodyguard. Now he lives in Brussels, and while he works at a nightclub as a bouncer, his real job is being a father. He does his best to give his 8-year-old daughtera normal life; she's clearly his everything. After an incident at work, he loses his job and almost his parental rights. The solution is working for a strip club owned by a Flemish gang kingpin — thanks to a hiring process that is literally last man standing — and collaborating with the police as an informant on said crime lord. Lukas finds himself embroiled in the organization and in a double game that's hard to navigate in the grimy Belgian underground, especially when they involve his family.\n\nTHE BOUNCER delivers the goods, thanks to a solid script by Jérémie Guez and taut direction by Julien Leclercq, who has consistently shown his proficiency at delivering efficient thrillers that hit hard and leave a mark. This slow-paced, moody noir successfully combines tense long takes, off-screen violence, car chases in a realistic and violent setting, and gun fights, all while providing the necessary emotion. JCVD, anti-hero extraordinaire, gives a quiet, nuanced and powerful performance as a father who'd pretty much do anything for his offspring — but still likes to tie off every loose end. This film feels like the natural sequel to the usual JCVD flick; the character and the actor merge to deliver a raw slice of life, a taste of realness. At one point, fascinated by the ferocity he shows when fighting these younger men, Lukas is asked if he's insane or just desperately wants to survive, and he admits one needs to be a bit of both. Here his rage feels justified, and we follow along, completely immersed, fascinated by his face and the story it tells. JCVD reminds us once again that he can still surely and successfully punch above his weight. (SONIA DROULHIOLE)\n\nWith Director Julien Leclercq in Attendance for 1st half.",
    "directors": [
        "Julien Leclercq"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-bouncer"
    },
    "runtime": 82,
    "synopsis": "Representing the moody, grimy, realistic return of JCVD to more dramatic roles, THE BOUNCER wows with a taut, contained approach to crime and violence, and one father's fight to save his daughter.",
    "title": "The Bouncer",
    "year": 2018
}