{
    "countries": [
        "Norway"
    ],
    "description": "Two years ago in THE WAVE, you were introduced to a little Norwegian town that got swept away after a landslide caused a tsunami. To quickly recap, our geologist hero and his family made it out alive in a very dramatic way. Some years later, we find the couple separated. Geologist Kristian, who still lives in the small town of Geiranger, suffered a mental breakdown and still struggles to cope with the loss of so many lives. His wife and two kids have moved to Oslo to start over.\n\nWhen a former colleague is crushed while working in a tunnel in Oslo, Kristian arrives to investigate and discovers that — of course — history is about to repeat itself and — also of course — it's going to be bigger than anyone anticipates. The rest is the classic game of \"you need to warn the population\" versus \"we have everything under control.\" While the tropes are familiar, the schadenfreude is still so delicious as we scream \"He told you so!\" at the stupid men on screen while Oslo crumbles. We're all suckers for catastrophe films where regular people arise as heroes to save the day, but unlike a big budget American spectacle, there's a humanity that anchors the story, supported by amazing special effects produced by Northmen who can hold their own against Hollywood.\n\nThe Scandinavians clearly see a dark future for their countries, and if you want to go the whole nine yards, you should pair THE QUAKE with its Swedish cousin THE UNTHINKABLE and drown your despair in Brännvin or Akevitt. You may also want to rethink your reservation at the Radisson and ask for a room on a lower floor. (ANNICK MAHNERT)",
    "directors": [
        "John Andreas Anderson"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-quake"
    },
    "runtime": 105,
    "synopsis": "This sequel to THE WAVE follows the same family, off to Oslo where the earth will shake again. The experts warned that it would! Expect death, drama, and awesome SFX. 'Nuff said.",
    "title": "The Quake",
    "year": 2018
}