{
    "countries": [
        "India"
    ],
    "description": "In the rural village of Tumbbad, young Vinayak has heard the stories of an ancient fortune held by his family for years, but is warned against attempting to attain the treasure lest he fall victim to the demon who guards it. He instead cares for his great-grandmother, a decrepit crone who must remain sated or her appetites might just claim them all. When she dies and he inherits the treasures housed inside a decaying estate, Vinayak discovers that they are not exactly what he expected, but instead an endless bounty protected by a vengeful and ravenous fallen god.\n\nYears later, adult Vinayak (Sohum Shah) has learned to manipulate the god so he can sneak out his boundless fortune one coin at a time. However, it's not enough, and soon a cycle of greed envelops his family. Their avarice threatens to destroy what he has built with the fortune stolen from the terrible creature that lives in the bowels of the castle, and soon enough he learns the terrible, violent secrets of Tumbbad.\n\nNo song and dance here, TUMBBAD is an ambitious period film that will turn any preconceived notion of Indian horror on its head. Producer, star, and primary creative force Sohum Shah delivers what is undoubtedly the most exciting pure horror film made in India in at least thirty years. TUMBBAD is the story of a legacy of greed and avarice that spans India's colonial history from the early part of the 20th century, through its independence in 1947 and beyond. This one will stick with you. (JOSH HURTADO)\n\nWith Composer Jesper Kyd in Attendance for 1st half.",
    "directors": [
        "Rahi Anil Barve",
        "Adesh Prasad"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/tumbbad"
    },
    "runtime": 108,
    "synopsis": "In the rural village of Tumbbad, a decaying castle hides an immeasurable ancestral fortune guarded by something ancient, sinister, and monstrous. Vinayak thinks he can control it, but how long will it be until his own greed destroys everything he's built?",
    "title": "Tumbbad",
    "year": 2018
}