{
    "countries": [
        "United States"
    ],
    "description": "Bursting onto the scene in Austin, TX with his first feature film THE MYTH OF THE AMERICAN SLEEPOVER, which was then superseded by the critically successful horror flick IT FOLLOWS, David Robert Mitchell displayed effortless skill at plunging into the murky waters of suburban America. Venturing outside those streets and into the apartment complexes of the shiny Hollywood hills, he again highlights the nebulous shadows lurking beyond our neighbors' doors.\n\nSam (Andrew Garfield) is not without his wiles, but his rent is past due, he's days away from being evicted, and he has no job to speak of. Spending his days having casual sex, smoking on his balcony, and spying on his neighbors, Sam spots a beautiful blonde decked out in a stark white bikini and matching sun hat. He goes out of his way to meet Sarah (Riley Keough), and is rewarded by spending the evening watching her favorite film, HOW TO MARRY A MILLIONAIRE. When the next day dawns, her apartment is abandoned, leaving Sam obsessed with discovering what's become of her. Is she connected to an underground comic book about the Silver Lake? Or maybe the dog killer terrorizing the neighborhood? And what exactly does the band Jesus and the Brides of Frankenstein have to do with her disappearance?\n\nUNDER THE SILVER LAKE is an entertaining take on modern noir films, following beats of that genre yet remaining fresh, giving us one kaleidoscopic mystery after another. With a soundtrack from Mitchell collaborator Disasterpiece and an absorbing performance from Garfield, the film is a riveting and often funny mystery that will keep you guessing to the end. When all is said and done, it's an exciting world that will quickly become a cult favorite. (NOAH LEE)\n\nWith Director David Robert Mitchell in Attendance.",
    "directors": [
        "David Robert Mitchell"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/under-the-silver-lake"
    },
    "runtime": 139,
    "synopsis": "From the dazzling imagination that brought you IT FOLLOWS comes a delirious neo-noir fever dream about one man's search for the truth behind the mysterious crimes, murders, and disappearances in his East L.A. neighborhood.",
    "title": "Under the Silver Lake",
    "year": 2018
}