{
    "countries": [
        "Japan"
    ],
    "description": "Ujicha's second feature returns to the animation technique of \"Gekimation,\" which he also employed with his debut film THE BURNING BUDDHA MAN five years ago. Doing almost everything himself (animation, visual concept, cinematography, editing), this tale set in the present-day Japanese countryside has a plot so bizarre that it borders on the fucked up.\n\nTwo kids, an American expat named Bobby (and after this film, you will never want to hear the name Bobby again) and his Japanese friend Akkun, want to visit a friend in a village on the other side of the mountain. While looking for a legendary shortcut, they stumble upon an amusement park called Violence Voyager. The kids are blissfully unconcerned at the lack of other children, and even the discovery of a mummified girl doesn't set off any internal alarms. Their adventure descends into a nightmare involving naked humanoid robots and suspicious adults leading to a metamorphosis for each of our young heroes.\n\nThe Gekimation technique on display is absolutely fascinating, and the work behind it is mind-blowing. Using painstakingly detailed hand-painted paper cutouts and adding real fluids (and doesn't that sound disturbing?) gives VIOLENCE VOYAGER a layer of visceral realism. The comparisons to Cronenberg and Otomo are inevitable due to the body transformations, but Ujicha's story ideas are uniquely his own. This doubtlessly makes him one of the most interesting animators around, and we should all keep an eye out for his future works. (ANNICK MAHNERT)",
    "directors": [
        "Ujicha"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/violence-voyager"
    },
    "runtime": 83,
    "synopsis": "En route to visit a friend in another village, two kids go looking for a fabled shortcut through the mountain. Instead, they stumble upon an amusement park called Violence Voyager, and that's when everything goes to shit.",
    "title": "Violence Voyager",
    "year": 2018
}