{
    "countries": [
        "Poland",
        "Netherlands",
        "Germany"
    ],
    "description": "February 1945, Concentration Camp Gross-Rosen: The war may be over, but for one group of young survivors, the ordeal is not. Taken by the Russian soldiers who freed them to an abandoned palace in the middle of the woods, they are welcomed by an older woman, jaded by years of deprivation, who is to take care of them. Our protagonists are a pack of wild things from all ages, kids without names or identity, a dysfunctional family welded together by horror more than love, and their re-entry into a semblance of normality proves to be no easy feat. Waiting for supplies that do not come from the Russians, they decide to forage in the woods for food, but instead find the matriarch dead, her face devoured. Soon their orphanage is beset by a pack of dogs, feral ravenous creatures — the same dogs used by the prison guards at the camp. Once disciplined, they've since been driven mad by hunger. Hanna, one of the older children, takes charge as they do their best to survive the monsters outside...and those inside too.\n\nAdrian Panek's second feature chews on tough questions about man-made monsters and civilization vs. wilderness. Once freed, our group of nameless children celebrate by stomping a rat to death in a dark communal ritual, evidence of how they have been shaped by the atrocities they've survived. Having been debased to the level of animals, how do they re-enter the \"normal\" world? It can't just be about cutlery and table manners. The orphanage symbolizes a sort of purgatory, a limbo where they're stuck, imprisoned again by those snarling teeth. They can only escape and return to the normal world once they've conquered the dogs, their pasts and their own characters.\n\nThrough stark images, gorgeously shot landscapes, and amazing actors, the director forces us to confront the inevitability of horror, the gruesomeness of the survival instinct, and the battle to reclaim one's humanity. (SONIA DROULHIOLE)\n\nWith Director Adrian Panek in Attendance for 2nd half.",
    "directors": [
        "Adrian Panek"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/werewolf"
    },
    "runtime": 88,
    "synopsis": "In a makeshift orphanage forgotten by most, a group of children who just survived the Holocaust find themselves preyed upon by a pack of wolf dogs. Their fight for freedom has only just begun.",
    "title": "Werewolf",
    "year": 2018
}