{
  "countries": [
    "Ukraine",
    "Poland",
    "Macedonia"
  ],
  "description": "Writer-director Marysia Nikitiuk's feature debut is an explosion of energy that fuses several genres to create a film which heralds the arrival of a new and exciting voice on the moviemaking scene.\n\nSomewhere within the Ukraine, Scar and Larysa are teenage lovers suffocated by their surroundings. Their village is governed by tradition and archaic rules, and ex-jailbird Scar is not a welcome presence. Larya's aging grandmother insists that she settle down and live her life in the prescribed ways. As these outside demands intrude ever more into their sensual inner world, Scar and Larysa must each take up a challenge: Scar to take on a big criminal job that requires him to travel to the crumbling city of Lozova, and Larysa to wait for him while an arranged marriage threatens to undermine her resolve. As each faces their own battle, change will force everyone to re-evaluate their existence.\n\nFusing magical realism and straight drama, WHEN THE TREES FALL is an exploration of life within post-Soviet Ukraine that explodes in bravura sequences which suggest a much richer inner life for the trapped characters. Nature is an uncontrollable force of power and beauty, reflected in our young leads and denied by the rest of the village. Blending the supernatural with the mundane, the film creates a world in which everything may be possible.\n\nNikitiuk's debut is a film designed to confound, outrage, and inspire, a film that demands to be re-watched and will spur debate long after the credits have rolled. Visually stunning, expertly edited, and brilliantly engaging, it is a piece of cinema that makes you sit up, take notice and never forget. (EVRIM ERSOY)\n\nWith Director Marysia Nikitiuk in Attendance for 1st half.",
  "directors": [
    "Marysia Nikitiuk"
  ],
  "meta": {
    "source_url": "https://fantasticfest.com/films/when-the-trees-fall"
  },
  "runtime": 88,
  "synopsis": "Scar and Larysa are desperately in love and suffocating under the tradition and archaic demands of their Ukrainian village. When the frustrations of each finally detonate, their world and the lives of those surrounding them are tragically shattered.",
  "title": "When the Trees Fall",
  "year": 2018
}
