{
    "countries": [
        "France",
        "Turkey",
        "United Kingdom"
    ],
    "description": "Bo Donnelly has a pretty sweet life. After barely escaping the soldiers who killed their family, he and his sister Ingrid have built a comfortable home in Istanbul. Oh, and they run an elite squad that risks life and limb to smuggle diamonds. Their world is turned upside down when a chance encounter reveals the location of the incredible White Fire Diamond. The stuff of legend, the jewel is massive, nearly 2,000 carats, and — a bizarre but important detail — it paranormally burns people. But when other enterprising criminal groups find out about it, Bo and his crew will find that this particular diamond might just be too hot for them to handle.\n\nStarring Robert Ginty and the great Fred \"The Hammer\" Williamson, WHITE FIRE is an odd mishmash of action scenes, attempts at comedy, and surprisingly brutal and gory deaths. Sprinkle in a bizarre quasi-romantic subplot between Bo and Ingrid (yes, the brother and sister), and this thing is just packed to the gills with crazy. It features montages, flamethrowers, jarring edits, plastic surgery, and its own theme song from British rock group Limelight dropped in whenever they aren't sure what else to do — not to mention plenty of Williamson's signature swagger. Did I mention that its vaguely futuristic production design is never explained? Maybe it takes place in 2029 or in an alternate universe. Who knows? And who the hell knows why the diamond burns anyone who touches it.\n\nAlso called VIVRE POUR SURVIVRE and LE DIAMANT, WHITE FIRE is a forgotten gem (haha) that calls to mind everything from THE BLUE LAGOON to FACE/OFF. We are so excited to bring you, our discerning audience, this 2K restoration of 1985's wildly off-the-wall diamond heist joyride. (LUKE MULLEN)",
    "directors": [
        "Jean-Marie Pallardy"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/white-fire"
    },
    "runtime": 98,
    "synopsis": "A small team of diamond smugglers stumbles upon the location of the supernatural white fire diamond, but competing criminals pose deadly challenges in this forgotten and truly bizarre gem from 1985.",
    "title": "White Fire",
    "year": 1984
}