{
    "countries": [
        "United States"
    ],
    "description": "YOU MIGHT BE THE KILLER opens with a bang. Screams, gore, and slasher mayhem tear across the screen with vibrant title cards counting out the total number of dead counselors (current score: A LOT). Sam (Fran Kranz), the head counselor at this remote camp, is safely cooped up in a cabin with a working cell phone, but instead of contacting the police, he calls his friend Chuck (the always-delightful Alyson Hannigan) in a panic.\n\nChuck is well-versed in slasher movie tropes and leads Sam through all the necessary steps to survive the night while also helping him remember each step that has led to this point. Told from the perspective of the third act looking back upon the horrors and plot twists through flashback, it's a full reversal of the beats one expects in this subgenre. Rather than endearing us to the characters slowly so we fear for their deaths, we're shown their deaths almost immediately upon meeting them. Ultimately, instead of being about one-dimensional sexy teens meeting their demise, it's about the joys of both the kill and the genre itself. Similarly, the film's secrets are unveiled in an unexpected order: we learn the killer's identity before we're told who's dead. But really, this reveal is just the start of the fun.\n\nIn the vein of some of the great meta-horror-comedies of the last decade like THE CABIN IN THE WOODS and FINAL GIRLS, YOU MIGHT BE THE KILLER is a colorful, goofy, self-aware film loaded with spunky performances from some of the most recognizable faces of the Whedonesque world of horror-comedy. Director Brett Simmons takes his initial inspiration from a viral Twitter conversation between NY Times bestselling authors Sam Sykes and Chuck Wendig, and spins it into a fresh new take on the slasher genre, brimming with clever kills, demented humor, and refreshing subversions of expectations. (LOGAN TAYLOR)\n\nWith Director Brett Simmons in Attendance for 1st half & Actor Fran Kranz in Attendance for 2nd half.",
    "directors": [
        "Brett Simmons"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/you-might-be-the-killer"
    },
    "runtime": 92,
    "synopsis": "Counselors are being killed off at summer camp, and Sam (Fran Kranz) is stuck in the middle of it. Instead of contacting the cops, he calls his friend and slasher-film expert (Alyson Hannigan) to discuss his options.",
    "title": "You Might Be the Killer",
    "year": 2018
}