{
    "countries": [],
    "runtime": 119,
    "title": "Confession of Murder",
    "directors": [
        "Jeong Byeong Gil"
    ],
    "year": 2012,
    "synopsis": "After the statute of limitations expires on a series of high profile murders, a man writes a book claiming to be the killer, setting off a firestorm of media attention as the families of the dead and the cop in charge of the case hunt for justice.",
    "description": "Strap yourselves in, kids, because this is a crazy one. Having made a name for himself as the director of stuntman documentary ACTION BOYS, Jung Byung-gil returns with his first narrative feature and he seems determined to put every stuntman from his doc in some sort of grave mortal peril.\n\nDetective Choi is a broken man, a tough guy cop whose lasting legacy is to be the one who almost captured a vicious serial killer ten years earlier. His failure left him physically and mentally scarred while the killer was left to walk free. He may have thought that was as bad as it could get, but it's about to get a whole lot worse thanks to a quirk of the Korean legal system which sets a statute of limitations on murder cases. And that time limit arrives with a shocking new bestseller on its heels – a book whose author claims to be the killer.\n\nThe book of course sparks a media frenzy, with Choi and the families of the dead left to watch impotently as the killer becomes a massive media darling. But the fact that the law can't touch him doesn't mean Choi and the others can't …\n\nCONFESSION OF MURDER is a gonzo exercise in excess, a film that pays only scant attention to plausibility and character development while choosing to instead leap from one seemingly un-toppable set piece to the next which, of course, immediately tops the one previous. Loaded with top notch action, the sort of heightened melodrama we've come to expect and love from Korea, and a handful of truly magnetic performances from its leads, CONFESSION OF MURDER is simply fabulous entertainment. (Todd Brown)"
}