{
    "countries": [
        "India"
    ],
    "description": "Kamal Hassan is a national treasure in India, one of the nation's most respected actors and writers. In 2001 he made a film that may not have set the box office on fire, but it certainly set a new bar for craziness in Indian genre cinema, AALAVANDHAN. The film grew from a novel Hassan wrote and tried to film in the '80s, but the world wasn't ready. Twenty years later, the world still wasn't ready for this manic piece of genre brilliance, but that didn't stop him and director Suresh Krissna from making what is still one of the most insane action films in Indian history.\n\nAALAVANDHAN stars Hassan in a dual role as both a commando named Vijay and his insane serial killer twin brother Nandhu. When Vijay goes to introduce his new fiancee Tejaswini to Nandhu in a maximum security prison (which has been his home since he murdered their stepmother at the age of 12), Nandhu doesn't take it well and breaks out of prison to get rid of Tejaswini once and for all.\n\nAs if Kamal Hassan playing twins in the film wasn't bonkers enough, AALAVANDHAN employs every cinematic device in the book — as well as a few new ones — to tell its crazy story. Nandhu busts out of prison and encounters a seven-foot-tall Ronald McDonald with whom he shares a dance after a heroin binge. He barrels through several drug-fueled murders, often depicted on screen in technicolor animations rumored to have influenced Tarantino's KILL BILL anime sequences. Exploding cars, decapitations, hallucinations, Kanye shades, mesh muscle shirts, and facial tattoos make AALAVANDHAN a unique experience that is not to be missed.\n\nAALAVANDHAN will be presented in a brand new director-supervised DCP created specifically for Fantastic Fest. (Josh Hurtado)",
    "directors": [
        "Suresh Krissna"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/aalavandhalan"
    },
    "runtime": 178,
    "synopsis": "Kamal Hassan stars in this ridiculously entertaining tale of an Indian commando pitted against his own serial killer twin brother in a deadly race to save the beautiful Tejaswini from certain death.",
    "title": "Aalavandhan",
    "year": 2001
}