{
    "countries": [
        "Republic of Korea"
    ],
    "description": "Kim Jee-Woon is back! The director behind some of the most exciting films to come out of Korea in recent decades returns to the screen with a spy tale that is dense in both betrayal and action! Assembling some of the best in Korean acting talent, this is a classic tale of espionage that is both visually stunning and endlessly breathtaking.\n\nLee Jung-Chool is the head of the Japanese Police Bureau tasked with catching members of the resistance; especially the leader Jung Chae-San. His loyalties lay with whoever \"extends their hand\" and he seems to be a man without direction.\n\nHowever, an encounter with Chae-San and Lieutenant Woo-Jin will find Jung-Chool becoming a double agent in the middle of the deadliest war imaginable. On one side is the Japanese army, ready to torture and execute without a moment's hesitation, and on the other; the resistance, ready to sacrifice anything to get back their country's independence. Jung-Chool must play both sides if he's to survive, and when the final bell rings, his choices may even end up determining the fate of a nation.\n\nAlthough inspired by historical facts, events and characters, Kim Jee-Woon's tale is an old school, rip-roaring spy tale, the likes of which we've not seen for a long while. Full of endless double-, triple- and quadruple-crosses, violent action set pieces and an array of characters that'd make John Le Carre proud, this is a heady trip through 1920s Korea. There are explosions, stabbings, shootings, chases and more in a tale that's so relentless that everyone stepping out of the theater will need a moment to steady their nerves.\n\nWith incredible sets, a classically rousing soundtrack and top-notch acting, Jee-Woon's creation is bound to take its deserving place in the spy canon of spy genre. Having been chosen as this year's official Oscar entry for Korea, there's no doubt the film's going places. Do not miss the chance to see this thrill ride on the big screen. (Evrim Ersoy)",
    "directors": [
        "KIM Jee-woon"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/age-of-shadows"
    },
    "runtime": 140,
    "synopsis": "Korea, during the Japanese occupation. Police Chief Lee Jung-Chool is hunting members of the resistance under strict orders from the Japanese overlords. However, a chance encounter with Jung Chae-San will have him questioning his loyalties…",
    "title": "Age of Shadows",
    "year": 2016
}