{
    "countries": [
        "Switzerland",
        "France"
    ],
    "description": "A heartbreaking treaty on the nature of isolation, Aloys tells the story of Aloys Adorn, a lonely private investigator who has lived his entire life in isolation, with only his father for company. When his father dies, thus severing Aloys' only connection to the world, he withdraws further and further into himself.\n\nHowever, a chance encounter on a bus brought on by an alcoholic blackout will see Aloys being stalked by a mysterious woman who will stop at nothing until he starts playing the mysterious \"telephone walking\" game with her.\n\nSlowly, Aloys will discover just how much harder it can be to destroy the walls that isolate us rather than to reinforce them as he gets closer to his mysterious friend/tormentor.\n\nMoving, humane and crafted with a deft sense of humor, Aloys is the kind of film that master Charlie Kaufman would approve of. If last year's Anomalisa reinforced the dark truths about human nature, then Aloys is the counter-argument, strongly suggesting that sometimes loneliness can be conquered. Sure to become one of the most moving favorites of this year's Fantastic Fest, Aloys represents the arrival of a new and exciting talent in the form of Tobias Nölle, who not only understands human nature like none other but also brings an exciting new visual style to the dark isolation of the world he has created. It's not hyperbolic to claim that there'll be few scenes as intriguing and masterful as the party in Aloys, created with not much more than the power of his imagination. (Evrim Ersoy)",
    "directors": [
        "Tobias Nolle"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/aloys"
    },
    "runtime": 91,
    "synopsis": "Aloys Adorn is a lonely private investigator who, after the death of his father, finds himself sucked into a mysterious \"telephone walking\" game with a mysterious woman who might be his only hope.",
    "title": "Aloys",
    "year": 2016
}