{
    "countries": [
        "United States"
    ],
    "description": "Andrea Arnold has given us four films now (Red Road, 2009's beloved Fish Tank, andWuthering Heights being the previous three) and American Honey may be her grittiest and lyrical best. It's certainly her most provocative and seductive. Her trademarks are all present: Academy aspect ratio, rich photography by regular cinematographer Robbie Ryan, tight close-ups and her focused lock on a central female character. But with American Honey, Arnold frees herself from the traditional structure of Wuthering Heights and gives her protagonist open-ended freedom to move the film in any way she wishes. Both Star and the actress behind the breakout role, Sasha Lane, bring the movie to fascinating heights and, most importantly, it's a movie that functions at full force in each singular moment. It captures the magnetism and rebellion of youth that have no responsibility except to their unpredictable nature, and only through experiencing everything can Star find out who she really is.\n\nIt's a journey that both Arnold and Lane, who feel as closely linked as a director and lead actress can be, take to places where the sheer energy of the film, almost plotless and structureless, feels special. It's not unlike the energy in Spring Breakers or Gus Van Sant's Death Trilogy and his Paranoid Park. Add in an exceptional supporting cast which includes a never better Shia LeBeouf, Riley Keough, McCaul Lombardi and Arielle Holmes – who's semi-autobiographical film Heaven Knows What could make an interesting companion piece with American Honey – and you're left with one of the unforgettable film experiences of 2016. (James Shapiro)",
    "directors": [
        "Andrea Arnold"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/american-honey"
    },
    "runtime": 158,
    "synopsis": "Andrea Arnold's first US feature follows 18-year-old Star as she leaves her home in Oklahoma and goes in search of adventure, adulthood and America.",
    "title": "American Honey",
    "year": 2016
}