{
    "countries": [
        "Canada"
    ],
    "description": "After saving Woodhaven from a gang of evil reptilian shapeshifters, alcoholic werewolf cop Lou Garou is finding it hard to keep a low profile. Instead, he roams the street at night, gleefully and violently disposing of criminals and stealing boxes of Liquor Donuts causing all sorts of problems for his former-partner-turned-chief Tina.\n\nThings begin to look up for the loser residents of Woodhaven when a billionaire businessman announces he's reopening the local brewery to produce Chicken Milk Stout, as well as gifting the town with its very own hockey team, the Darkstars. However, the unexpected return of an old friend (who now sports a large foul-mouthed mustachioed phallus) and a strip joint bloodbath alert Wolfcop to the rise of something evil to the town.\n\nWhen following up a film about occultist lizard shapeshifters and an alcoholic lycanthrope cop, crazier, gorier and even more Canadian seems like a fairly good way to go. And that's exactly what writer/director Lowell Dean does in ANOTHER WOLFCOP, starting things off at a crazy pace and never allowing them to slow down.\n\nContinuing a commitment to practical creature and gore effects, ANOTHER WOLFCOP retains its predecessor's near-reckless narrative style, taking a kitchen sink approach at joke and gag delivery. There's not a serious bone in this beast's body and that's just fine. Culminating in an epic combined brewery opening/hockey game, ANOTHER WOLFCOP is here to quench your over-the-top horror-comedy thirst. So grab a cold cock, a box of Liquor Donuts and prepare yourself for another wild romp through the great white North's shittiest yet wildest little town. (Brian Kelley)",
    "directors": [
        "Lowell Dean"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/another-wolfcop"
    },
    "runtime": 82,
    "synopsis": "Alcoholic werewolf cop Lou Garou springs into action when an eccentric businessman with evil intentions seduces Woodhaven's residents with a new brewery and hockey team in this outrageous horror-comedy sequel.",
    "title": "Another Wolfcop",
    "year": 2016
}