{
    "countries": [
        "United States"
    ],
    "description": "If you think it's too soon to start including Denis Villeneuve in the lofty pantheon of our greatest living filmmakers, ARRIVAL will give you swift reason to change your mind. Working predominantly in the shadows of the Canadian art-house for just over a decade, Villeneuve alerted wider audiences to his precisely ferocious skill with INCENDIES, earning a Best Foreign Language Film nom in the process. Following the wave of critical acclaim, Villeneuve retreated, sharpening his tools for the back-to-back straight jab, right hook combo of ENEMY and PRISONERS, pinning Jake Gyllenhall and audiences on the ropes in quick succession. Two years later he delivered another headshot with SICARIO, a visceral excursion into the hyper-violent underworld of Mexico's brutal drug cartel.\n\nBased on Villeneuve's more recent arc it would be easy to think that he would hold with the tough tones he's been cultivating over the past decade, but in every sense ARRIVAL marks an important departure; yet, it is one that feels supremely aligned with his oeuvre to date. Unlike his previous work, ARRIVAL is a big film with a big story -- the terrifying global panic that accompanies the mysterious arrival of extraterrestrials on earth -- however, in keeping with his pattern, it is told through the most personal, intimate lens and centered on a single, emotionally exposed character.\n\nBy now, you've already seen the trailer with spacecrafts hovering ominously overhead and you're desperate to know what's next. Well, Villeneuve didn't make this most human of films for me to surmise in 300 words; he made it for you to experience and to wash over you.\n\nYou're in the hands of a master filmmaker and ARRIVAL marks another important moment in his trajectory. Like the film itself, don't fight it, embrace it. (Christian Parkes)",
    "directors": [
        "Denis Villeneuve"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/arrival"
    },
    "runtime": 115,
    "synopsis": "When mysterious spacecraft touch down across the globe, an elite team - lead by expert linguist Louise Banks (Amy Adams) - are brought together to investigate. As mankind teeters on the verge of global war, Banks and the team race against time for answers – and to find them, she will take a chance that could threaten her life, and quite possibly humanity.",
    "title": "Arrival",
    "year": 2016
}