{
    "countries": [
        "Japan"
    ],
    "description": "Last year's ASSASSINATION CLASSROOM introduced us to Koro-sensei, a seven-foot tall yellow talking octopus with a permanent shit-eating grin. In it, he has already destroyed 70% of the moon and threatens to completely eliminate Earth unless a class of underachievers, whom he will teach, can assassinate him by the end of the year. In ASSASSINATION CLASSROOM: THE GRADUATION, the deadline is quickly approaching.\n\nAs with the first film, Koro-sensei slowly reveals his true expectations of his students by unveiling more information about his past and why he must destroy Earth. Instead of going bigger, it goes deeper, milking a rather impressive amount of emotion out of its absurd concept and characters. Koro-sensei's backstory reshapes what we understand about his intentions and the true lessons for his students.\n\nThat's not to say this sequel is by any means a slog. Following the manga source material fairly closely, ASSASSINATION CLASSROOM: THE GRADUATION sees the Ministry of Defense continue to deploy its own assassins to take down Koro-sensei, resulting in the tentacle-crazy battles one would expect. Koro-sensei dons some increasingly ridiculous disguises as various wacky only-in-Japan subplots provide the laughs needed to balance out some of the more emotionally-heavy moments. And as the students learn more about their Earth-destroying teacher, a divide begins to forms in Class-E, with some questioning the need to kill Koro-sensei at all.\n\nASSASSINATION CLASSROOM: THE GRADUATION is the sequel we've all been waiting for since last year. In many ways, it delivers what we wanted, but it also takes plenty of time to further develop its characters and its backstory in a way many sequels fail to do. So set your sights on fun, pull the trigger on some Japanese young adult insanity and hats off to this graduating class of assassins. (Brian Kelley)",
    "directors": [
        "Eiichiro Hasumi"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/assassination-classroom-graduation"
    },
    "runtime": 118,
    "synopsis": "This conclusion to last year's hit finds Class-E running out of time in their efforts to assassinate Koro-sensei, their yellow octopus smiley-faced teacher who is about to destroy Earth.",
    "title": "Assassination Classroom: Graduation",
    "year": 2016
}