{
    "countries": [
        "Republic of Korea"
    ],
    "description": "Get ready for the meanest, nastiest slice of Korean noir since Lee Byung-Hun disobeyed his boss's orders way back when. Kim Sung-soo's crazy crime tale is such a vicious maelstrom of violence that it becomes almost poetic in its extensive insanity.\n\nDetective Han is a corrupt cop. He protects Mayor Park's interests at any costs, intimidating witnesses, frightening the opposition and even staging protests to make Park look like a hero. He does all of this so he can continue to get paid for his wife's hospital bills following a terminal cancer diagnosis. When the routine intimidation of a witness who is about to testify goes violently wrong, Han finds himself facing the prosecutor's office, who will stop at nothing to nail Park. Now Han is stuck between two violent factions who will go to any extreme in pursuit of their goals – including torture. He must walk the razor's edge if he's to survive the longest week of his life.\n\nShot with a sense of kinetic urgency, Kim Sung-Soo's hard-boiled noir depicts the city of Annam as a sort of purgatory for the corrupt souls trapped within. No denizen of this burgeoning metropolis is innocent or even marginally good. From the crazy mayor to his murderous aides to even the supposedly pure prosecutor's agents, every character's soul is black enough to commit stomach-turningly vicious acts without as much as a blink. The temperature seems to be permanently set to scalding, with sweat pouring out of the characters' brows day and night. Within this setting, Jung Woo-Sung gives the performance of a lifetime as Detective Han, a bad man caught in a worse situation. Woo-Sung portrays Han with an ever-sharpening edge; a morally bankrupt protagonist who still somehow elicits sympathy.\n\nAdd to this a score that is all low-key guitars and jangling notes, dynamic camerawork that heightens the action and a finale which will leave you breathless, and what you have is the most over-the-top Korean film of the last few years. Watch this big and loud to let the madness seep into the very pores of your soul. (Evrim Ersoy)",
    "directors": [
        "KIM Sung-soo"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/asura-the-city-of-madness"
    },
    "runtime": 136,
    "synopsis": "Corrupt police detective Han protects Mayor Park's interests while he saves up to pay for his wife's terminal cancer treatment. When intimidation of a witness goes wrong, they're all thrown into a violent storm.",
    "title": "Asura: The City of Madness",
    "year": 2016
}