{
    "countries": [
        "Uganda"
    ],
    "description": "Welcome to Wakaliwood: home to \"da best of da best movies!\" and the vanguards of action-packed off-the-grid DIY commando cinema. Under the guidance of writer/director/producer Nabwana Isaac Godfrey Geoffrey (IGG), this crack crew of self-taught filmmakers and kung fu aficionados have made dozens of exuberant and exhilarating action films in the ghetto outside Kampala, Uganda for budgets of $200 US a movie. Despite props, computers and gear all being built from scrap parts (including a full-size Huey helicopter!) and the ludicrously cheap but infectiously endearing CG explosions/muzzle-flashes, Wakaliwood cinema's reckless abandon manages to inspire more heart, grit and soul than a thousand Hollywood blockbusters.\n\nAt Fantastic Fest, you will witness their latest crime epic: BAD BLACK, where a mild-mannered doctor, portrayed by real-life Wakaliwood producer Alan Hofmanis, is trained in the art of ass-kicking commando vengeance by a no-nonsense ghetto kid named Wesley Snipes (!) in an effort to steal back a family heirloom from Uganda's toughest gang. A multitude of subplots ensue at a breakneck pace as Nabwana hurls his charismatic cast through bombastic firefights, dizzying motorcycle chases, and an absolutely madcap prison riot – all photographed with a thrilling gonzo panache and seeped in gleefully silly, self-deprecating humor. Per the oral tradition of Ugandan storytelling, all the aforementioned mayhem is miraculously made coherent by the acerbic wit of the film's narrator / video-joker (think a Ugandan Tom Servo), whom at one point aptly distills this delirious hour and change to a single sentiment: \"It is a love story... LOVE OF ACTION!\" (Peter Kuplowsky)",
    "directors": [
        "Nabwana IGG"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/bad-black"
    },
    "runtime": 65,
    "synopsis": "A mild-mannered doctor is trained in the art of ass-kicking commando vengeance by a no-nonsense ghetto kid named Wesley Snipes (!). This is only one of the many delirious action-packed stories that converge in this exuberant DIY extravaganza from the home of \"da best of da best movies\": WAKALIWOOD, UGANDA!!!",
    "title": "Bad Black",
    "year": 2016
}