{
    "countries": [
        "New Zealand"
    ],
    "description": "In 2007, faith, culture and family collided to tragic ends in the small New Zealand community of Wainuiomata. Recognizing that one of their own – the titular Janet Moses – was in severe emotional distress, her loving family sought out the advice of their elders, desperate for any help. Eventually coming to believe that Janet had been placed under a curse, the family undertook a days-long improvised exorcism ceremony, one that not only failed to heal the beloved woman, but left her tragically deceased.\n\nComing to be known as \"The Wainuiomata Exorcism,\" the death of Janet Moses would dominate the local media as observers struggled to understand what had happened and how this could even be possible. Had something sinister taken place or – an even worse and more unthinkable possibility – had Janet been killed by a legitimately loving family seeking only to help her?\n\nThis true story provides the basis of David Stubbs' debut feature documentary, a hauntingly poetic exploration of the murky areas between faith and reason, the gaps between cultures, and how it is possible for an act of love to turn so horribly and tragically wrong. Blending interviews with family, those involved in the court case and cultural experts with extensive and artfully executed reconstructions of the actual events leading to Moses' death, Stubbs creates a truly haunting portrait; not just of one woman's life but also of one of the most emotionally complex tragedies imaginable. (Todd Brown)",
    "directors": [
        "David Stubbs"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/belief-the-possession-of-janet-moses"
    },
    "runtime": 89,
    "synopsis": "The true story of the Wainuiomata exorcism provides the basis for David Stubbs' striking debut feature, a documentary exploring the tragic death of young Māori woman Janet Moses in an improvised exorcism ceremony.",
    "title": "Belief: The Possession of Janet Moses",
    "year": 2015
}