{
    "countries": [
        "United States"
    ],
    "description": "After the magnificence of THE MIDNIGHT SWIM, it's no exaggeration to say that excitement levels were ultra high for Sarah Adina Smith's new feature. And the fact that she had partnered with Travis Stevens, a man responsible for many of FF favorites, made the prospect even more intriguing.\n\nBUSTER'S MAL HEART proves to be everything that we ever expected and more. A mind-bending time-twisting tale of a man split in two, of prophecies, of conspiracies and love; it's cinematic beauty of the highest order.\n\nRami Malek is Buster, a mountain man on the run from the authorities who survives the harsh winters by breaking into empty homes. Between these on-the-run moments, Buster will cook himself simple meals, call a radio show to deliver rants about Y2K and think about the past. Because once upon a time, Buster was Jonah, a straight-laced man with a family he loved. Hard-working an loyal, all he wanted was to get his family a home. However, the arrival of an unnamed prophet of a Y2K prophecy will throw Jonah's live into disarray and start him on a path from which there is no return. How does a man split in two? Well, Jonah will soon find out.\n\nWith gorgeous cinematography and a simple structure which explores complex issues, Smith's film is a masterpiece of tapestry, of strands and ideas which deftly weave around each other, building a world of marvel and horror, both equal and infinite. Rami Malek shines as the titular character, frightening in his single-mindedness and heart-breaking in his desperation, a lonely human being that resonates with each emotional turn.\n\nAt once a psychological drama, a conspiracy thriller and an emotionally astute discourse on loss, Smith's film will challenge and delight those who choose to follow its neural pathways. Guaranteed to blast into the deepest crevices on your mind. (Evrim Ersoy)",
    "directors": [
        "Sarah Adina Smith"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/busters-mal-heart"
    },
    "runtime": 96,
    "synopsis": "This is the story of a mountain man on the run, surviving the winter by breaking into empty homes. This is also the story of a man lost at sea. The thing is... they're the same man.",
    "title": "Buster's Mal Heart",
    "year": 2016
}