{
    "countries": [
        "Hong Kong"
    ],
    "description": "Carefully mixing together classic westerns and old school wuxia films, Benny Chan's crazy tale is a visually stunning piece of kung-fu filmmaking guaranteed to become a favorite from this point onwards. Eschewing the current trend for modern day police stories, Chan sets his sight on Chinese history and mines a rich and action-packed tale.\n\nIt's the Warlord era in early 20th century China. Battling factions plague the land, bringing the denizens into poverty and misery. Warlord Cao, a cruel and vicious man, has seized Stone City and set his sights on the small village of Pucheng. Sheriff Yang tries to keep law and order with a small group of men, dispelling panic. However, the arrival of Caos' son Shaolin (Louis Koo in major villain mode) finds them caught directly in the firing line.\n\nYang arrests Shaolin for the crime of murder and swears to hold him prisoner until justice can be delivered in the form of his execution. But Cao's army will lay waste to village and slaughter everyone unless Shaolin is released. The inevitable showdown will be deadly, bloody and brutal.\n\nBenny Chan's latest effort is the perfect wuxia take on the western genre. It's the story of a small group of just, determined men holding out until they can serve justice to a large, vicious army. It's a setup as old as time, but it's given new life by a brilliant and acrobatic cast. Add to this mix Sammo Hung serving as the action director, and what you have is two hours of non-stop, kinetic, eye-popping action peppered with wild stunts, crazy fights, every weapon conceivable and much, much more.\n\nCulminating in a showdown that sees the ragtag band take on an ENTIRE army, CALL OF HEROES is the throwback wuxia film we've all been waiting for, and acts as a stark reminder of how good the genre can be when done right. (Evrim Ersoy)",
    "directors": [
        "Benny Chan"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/call-of-heroes"
    },
    "runtime": 120,
    "synopsis": "During China's Warlord era, in the village of Pucheng, a sheriff and his ragtag band of men must make sure the cruel general Cal's son Shaolin faces justice in this brilliant blend of wuxia and westerns!",
    "title": "Call of Heroes",
    "year": 2016
}