{
    "countries": [
        "Japan"
    ],
    "description": "The first word uttered in Yudai Yamaguchi's Chinyuki is \"penis,\" and is used in reference to an assassin named Taro Yamada (Ken'ichi Matsuyama) and his two weapons. The other being his anus. Taking Taro under his wing in an effort to rehabilitate him is a monk named Genzo, who's on a pilgrimage to Tianzhu. Off the two set, from The Land of the Doggy Bagg in the 2nd Year of the Pussy Dynasty, on their important pilgrimage filled with pork bun-based kung fu and farts.\n\nBased on the manga of the same name, Chinyuki takes as much liberty with its source material as Man Gatarou's does in his parody of the ancient Chinese novel \"Journey to the West.\" The road trip format provides a perfect framework for Yamaguchi to stage increasingly ridiculous comedic sequences populated with way-past-over-the-top characters. Yudai Yamagachi has practically built a career on seeing if there exists an upper-limit to Japanese wackiness in a single film and uses every trick he has in Chinyuki to bring his singular, toilet humor-filled vision to life.\n\nIf Yamaguchi's previous work, starting with his unclassifiable 2003 debut Battlefield Baseball, often has the feeling of behind held loosely together with duct tape, Chinyuki at times feels assembled with the dollar store knockoff Scotch variety. But, as with his other films, the true adhesive that holds together all the wild ideas, outrageous characters and effects with varying levels of questionableness is Yamaguchi's commitment to his own oft-dumbfounding brand of humor. If he's willing to take an alarming number of jokes a step too far in Chinyuki he's more often than not eager to push it two steps more. (Brian Kelley)",
    "directors": [
        "Yudai Yamaguchi"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/chin-yu-ki"
    },
    "runtime": 100,
    "synopsis": "Yudai Yamaguchi's Chinyuki is one of those rare films where its own subtitle tells you everything you need to know about the movie: A journey to the West with farts.",
    "title": "Chin-Yu-Ki",
    "year": 2016
}