{
    "countries": [
        "Canada"
    ],
    "description": "When Gloria (Anne Hathaway) drinks too much, other people pay for it... at the very least with their patience. Exasperated by her behavior, her posh boyfriend (Dan Stevens) puts his foot down and throws her out, an act that sends her meekly returning to her hometown, without a plan and with even less prospects. Despite reconnecting with childhood friend Oscar (Jason Sudeikis), who is all too happy to help her attain a fresh start (and perhaps inspire a fresh relationship), Gloria gravitates back to the booze, and before long resumes her routine of stumbling home blackout drunk. Only this time, her morning hangover comes with the news that a giant lizard has rampaged through Seoul's downtown core, and the sneaking suspicion that she's somehow connected to this remarkable event.\n\nSo begins this extraordinarily potent allegory for personal responsibility that could only have emerged from the eccentric mind of Fantastic Fest favorite (and festival mascot) Nacho Vigalondo. And in keeping with his oeuvre, where it goes is both wildly original and sublimely unpredictable.\n\nNo stranger to stories of the self-destructive, Nacho again deftly deploys science fiction tropes in service of nuanced character studies, and the brilliantly cast Gloria and Oscar are among his most complex screen personalities to date. Anchored by an outlandish conceit that could have easily teetered into camp, Hathaway brings exceptional pathos to a perpetual adolescence that might have otherwise irritated, while Sudeikis' amicable demeanor brims with a hidden toxicity that, when fully revealed, profoundly expands the thematic scope of the film in perfect tandem with the ever-escalating kaiju mayhem happening halfway across the world. Genre filmmaking does not come more creative or inspired. (Peter Kuplowsky)",
    "directors": [
        "Nacho Vigalondo"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/colossal"
    },
    "runtime": 110,
    "synopsis": "Fantastic Fest favorite Nacho Vigalondo (TIMECRIMES) wrings an extraordinarily potent allegory for personal responsibility and emotional toxicity in this witty and absorbing drama about an alcoholic (Anne Hathaway) who discovers an improbable connection between herself and a giant monster ravaging South Korea.",
    "title": "Colossal",
    "year": 2016
}