{
    "countries": [
        "Lao People's Democratic Republic",
        "France",
        "Estonia"
    ],
    "description": "Fantastic Fest has a long traditional of showcasing filmmakers who make entertaining work while overcoming whatever obstacles are placed in front of them. Consider then the achievements of second-time Fantastic Fest director Mattie Do. Mattie hails from Laos and Dearest Sister is Laos' 13th film. Not this year, but EVER. Mattie is Laos' only horror filmmaker and also its only female filmmaker. In her own words, she's \"the crazy horror chick that's calculating how much pig blood I can buy for the cash I've got in my pocket.\"\n\nLaos has no production infrastructure and no distribution options. It has one movie theater. Again, in Mattie's own words, \"every Lao film is a historic event. Every film made here breaks ground in a totally new film industry.\" Consider that Laos a Marxist state governed by a single-party regime, and it makes what she's doing one of the most significant endeavors in world cinema today. When her native audience sees her movies, they are seeing the only horror films they've ever seen. And the films they're watching from Mattie happen to be great.\n\nDearest Sister mixes traditional ghost story elements with both local folklore and real events while providing both social and gender commentary in the face of local censorship. Sister uses familiar elements from supernatural stories, but not only is its narrative uniquely Mattie Do but its uniquely a product of her culture. It's a great film and the type of accomplishment that Fantastic Fest was made to celebrate. (James Shapiro)",
    "directors": [
        "Mattie Do"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/dearest-sister"
    },
    "runtime": 100,
    "synopsis": "After moving to the city, a poor woman realizes her recently blinded cousin can not only commune with the dead, but they can provide a path to much-needed wealth.",
    "title": "Dearest Sister",
    "year": 2016
}