{
    "countries": [
        "United States"
    ],
    "description": "Troy, Mad Dog and Diesel are buddies from way back in the slammer. When Troy is released after a lengthy time served, the three reunite. They're all on their last chance under the dreaded three-strike law of California, and the last thing they need is to think up any further schemes.\n\nBut these men are not willing to settle down or find the straight and narrow. They're going to get what they want and they're going to get it their own way. When Troy constructs the perfect crime for them to hit that big jackpot, you can be sure there'll be a lot of bodies piling up. You're either with this rabid trio or you're in the way!\n\nAdapting Edward Bunker's seminal pulp underground classic, Schrader proves that there's no time limit on invention. He employs a gonzo, guerrilla approach to create this brilliantly funny, scattershot noir, which takes us to the underbelly of California with endless bloodbaths, morally corrupt characters and a sadistic sense of fun.\n\nLeading the charge are two electric performances from Nicolas Cage and Willem Defoe, who let loose like never before. Troy and Mad Dog are brutal beasts, growling and snarling their way to the life they think they deserve, and nothing can stand in their way.\n\nOpening with a vicious, brutal, unexpected family massacre and ending with the most audacious setup you're likely to see in a long while, DOG EAT DOG is brutally brilliant filmmaking at its most unhinged. Get on this ride cause you're never likely to find one as wild and entertaining. (Evrim Ersoy)",
    "directors": [
        "Paul Schrader"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/dog-eat-dog"
    },
    "runtime": 93,
    "synopsis": "From the brilliant minds of Edward Bunker and Paul Schrader comes this unhinged pulp comedy at a million miles an hour; the story of three hardened criminals and the final, simple crime which will bring them all down.",
    "title": "Dog Eat Dog",
    "year": 2016
}