{
    "countries": [
        "United States"
    ],
    "description": "After giving us a BIG ASS SPIDER to contend with, Mike Mendez returns to the screen with a midnight movie guaranteed to please even the most ardent B-movie lover. Teaming up with the fantastic Dolph Lungdren and genre favorite Kristina Klebe, he brings to the screen a tale teeming with blood, guts and demonic possession!\n\nIn a small, sparsely populated corner of Mississippi, an ancient demon is released. The creature can take over the body of whoever kills its previous host, causing havoc, mayhem and murder in its wake. These strange murders attract the attention of FBI agent Evelyn Pierce, who was born in the town and is assigned to investigate.\n\nBefore she can even settle into the investigation, her paths cross Jebediah Woodley, a rip-roaring, whisky-sozzled traveler who claims to be a demon hunter and has encountered this particular spirit before. At first, Evelyn doesn't believe this outlandish character, but as the body count rises and each murder increasingly defies logic, she comes to realize that the man might be the only hope of humanity.\n\nStarting with the dial turned up to ten and only pushing further, Mike Mendez relishes the midnight genre with glee in this over-the-top and entertaining flick. His ability to combine excessive set pieces, eye-popping physical gore and a constant sense of momentum creates a film that is consistently entertaining. Add to the mix the ever-brilliant Dolph Lundgren and it almost literally pops out of the screen.\n\nGuaranteed to entertain anyone who even remotely enjoyed his previous work, Mendez's take on the classic demonic possession tale is full of wonderful touches. His manic sense of comedic timing serves to highlight how easy he makes these pitch-perfect moments seem, and the performance he draws out of Lundgren is probably the best we've seen from a man who has given us much to admire over the course of his career.\n\nSo settle back, order a drink or three and get lost in a world gone crazy in the way that only this team could've made happen. A brilliant blast! (Evrim Ersoy)",
    "directors": [
        "Mike Mendez"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/dont-kill-it"
    },
    "runtime": 93,
    "synopsis": "An ancient demon is unleashed in a Mississippi town and the only people who can stop it are FBI agent Evelyn Pierce and grizzled, cynical demon hunter Jebediah Woodley.",
    "title": "Don't Kill It",
    "year": 2016
}