{
    "countries": [
        "Australia"
    ],
    "description": "Jason is not happy. Lebs and wogs have taken over the beach and if they would just stay where they belonged, the thousands-strong brawl that spun out of control yesterday would never have happened. And now that it has happened, clearly the thing to do is drive around with as many like-minded folk as possible and make sure none of them come back. Oh. And he needs to get some kebab for his girlfriend. That's important too.\n\nAnd Nick? Nick is also not happy. Not happy about being treated like a second class citizen. Not happy about being told where he can go and what he can do. And definitely not happy about the violence poured out towards his culture the day before, never mind the fact that it's a culture he's pretty much entirely disavowed himself. Dialog? Who needs it? Clearly the thing to do is get down to the beach and knock some heads. Better go get some weapons first.\n\nSet against the backdrop of the 2005 Cronulla race riots – an actual massive brawl that broke out just before Christmas in the Sydney beachfront suburb, with violence continuing over the next several nights – Abe Forsythe's Down Under is, in many ways, the Four Lions of race movies. Utterly fearless, brilliantly pointed and flat out hysterical, Forsythe takes a gleeful delight in skewering the alpha male meatheads on both sides of the divide that led to the explosion of violence in the first place, and he does so without ever losing sight of the actual human cost of the real events. Already well known locally for his extensive work in television, Down Under marks the introduction of a simply massive young talent to the rest of the world. (Todd Brown)",
    "directors": [
        "Abraham Forsythe"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/down-under"
    },
    "runtime": 87,
    "synopsis": "In the aftermath of massive race riots, two carloads of dim-witted alpha males set off to defend their respective territory with outrageous results in this sharp edged Australian satire.",
    "title": "Down Under",
    "year": 2016
}