{
    "countries": [
        "France"
    ],
    "description": "Helen of Troy had the face that could launch a thousand ships, and Paul Verhoeven and Isabelle Huppert have the movie that will probably launch a thousand think pieces. The implications of liking this subject matter are daring, but what about laughing at them? Verhoeven hasn't made a movie in ten years (since his utterly entertaining WWII espionage drama BLACK BOOK), so it's possible that we've forgotten that he's been the master of transforming expectations and genres for decades. Maybe it's easier to remember how funny STARSHIP TROOPERS and ROBOCOP were while they were first and foremost action narratives, but he's really been doing it throughout his whole career, even since TURKISH DELIGHT and SPETTERS.\n\nBut this is really Huppert's movie in a lot of ways. It feels like the culmination of her career as so much of her character is both familiar and fresh. After all, Huppert was doing fearless acting before anyone thought of calling acting fearless. Huppert's Leblanc is a woman who has been attacked, but goes to dinner with friends that night. Her attacker is probably around her all the time, but she has a video game to produce, a son to support, an affair to manage and a mother to suffer through. The assault just sits there a while in her mind until it doesn't.\n\nHuppert fills this role with such fury and indifference to anyone, including the audience, one comes to realize that only Huppert could pull this off. Only Huppert can be victim and a perpetrator like this. Forget awards; this woman deserves a monument. (James Emanuel Shapiro)",
    "directors": [
        "Paul Verhoeven"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/elle"
    },
    "runtime": 131,
    "synopsis": "Paul Verhoeven's debut in French cinema highlights an incredible Isabelle Huppert in a dramedy that first subverts then transgresses the rape-revenge narrative.",
    "title": "Elle",
    "year": 2016
}