{
    "countries": [
        "United States"
    ],
    "description": "It's with great delight that we welcome FF alumni Simon Rumley back with his brand new FASHIONISTA, a title that astounds and delights and proves once again that he's one of the best directors working today.\n\nApril loves clothes. But more so, she loves Eric, with whom she owns a second-hand vintage store in Texas. Their lives are idyllic, spent in a house rammed to the rafters with vintage ware. Eric has dreams; he wants to open new stores, but April isn't so sure about the idea.\n\nHowever, as Eric gets closer to new employee Sherry, April's jealousy and paranoia start to spiral out of control. She finds herself turning more to the clothes as a crutch to get her through the day. All will come undone when Eric's one deadly mistake is revealed and their lives hurtle towards a conclusion that none could expect.\n\nWith a stellar cast including Ethan Embry, Amanda Fuller, Eric Balfour and the wonderful Alex Essoe, Rumley concocts a terrifying, tightly constructed tale that never reveals its hand until the very last moment. Cut together in sequences that slyly echo what's to come, disorientating sequences which suddenly connect to the story to create a logical whole and an emotional intensity that seems to gather momentum with each passing moment, this finely crafted tale of madness and mayhem works as a testament to the director's masterful ability to catalogue oddball outsiders. With intense use of color and space, Rumley throws us into a place where the familiar becomes frightening. Within each glimpse of the uncanny madness, there's a piece of us, the audience, visible. Do not miss the opportunity to experience this striking, shocking piece of cinema and encounter its hypnotic, deadly spell, bound to hold you in its wake for days afterwards. (Evrim Ersoy)",
    "directors": [
        "Simon Rumley"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/fashionista"
    },
    "runtime": 108,
    "synopsis": "April and Eric own a clothing store together and are happily in love. April will have to rely on her fashion obsession for survival when everything unexpectedly crumbles after Eric makes a single destructive mistake.",
    "title": "Fashionista",
    "year": 2016
}