{
    "countries": [
        "France"
    ],
    "description": "Constance, a single woman in her mid-40s, is a bit frazzled. After burning out in Paris, she's returning to her home town under the guise of needing to take care of her mother. With no job and no place to live, she has no other choice but to move back in with her sick mother. Constance burned all her bridges when she rushed off to Paris, leaving her old job at a small real estate company where she worked alongside her old flame, Philippe, with an air of pretentiousness and almost no notice.\n\nEver the bold optimist (or perhaps a bit delusional), Constance meets with her old boss and asks for her job back. While he does have a position open, he's still sore about how things went. He ends up hiring Audrey, a young and ambitious local. Constance is surprised and hurt and desperate, and those emotions make for a potent mixture. She becomes obsessed with Audrey and eventually befriends her, introducing herself as a potential client with a fake name. Her games with Audrey continue as her jealousy turns dangerous.\n\nFor his debut feature film, writer/director Sebastien Marnier has crafted an elegant portrayal of a woman struggling to put her life back together. She appears normal to avoid the judgment of others as her mental state unravels. Constance is certainly a liar, perhaps pathological, as well as a stalker and a meddler, but her behavior is born of her desperation and lack of options. Faultless is a slow-burn meditation on how quickly we can find ourselves at wits' end and the lengths to which we'll go to get what we want and need. (Luke Mullen)",
    "directors": [
        "Sébastien Marnier"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/faultless"
    },
    "runtime": 103,
    "synopsis": "After burning out in Paris, Constance returns to her home town only to find herself in lethal competition with a younger girl for her old job.",
    "title": "Faultless",
    "year": 2016
}