{
    "countries": [
        "United States"
    ],
    "description": "Drowning in debt but driven by an insatiable hunger for material wealth and instant gratification, a working class family concocts a plot to perpetuate their unsustainable lifestyle, even if it means pulling up their stakes and fleeing across the country to escape the consequences of their duplicity. It's a sensational story worthy of a tabloid or a dime-store pulp fiction, but filmmaker Dean Fleischer-Camp plays out this cautionary tale through a kaleidoscopic cacophony of hundreds of innocuous clips culled from the family's seemingly banal YouTube channel. The result is a mesmerizing and chilling meta-fiction whose very construction is as disturbing as its narrative conceit. Through its sophisticated remediation of \"found footage,\" it foregrounds the question of whether the artifacts of our own lives, which so many of us perpetuate on the Internet through various social media platforms, are similarly susceptible to such manipulation.\n\nTo conjure this staggeringly provocative parable of the pursuit of happiness and the infidelity of the moving image, Fleischer-Camp employs extraordinary cinematic sleight of hand, from subtle visual juxtapositions, minute re-framings and the implied authority of date stamps among a multitude of techniques. An attentive viewer may grow wise to such strategies early on, but that the complex conspiracy that underlines the film holds together at all is a genuine marvel, especially when one considers its scope in relation to the arbitrary nature of the source material. In adopting a manic, almost impressionistic rhythm to its aggressive cutting, the film also pursues a compelling symbolic register reminiscent of the work of American avant-garde artists like Stan Brakhage and Bruce Conner, as it ruminates on American iconography, from the Stars and Stripes to the latest and greatest iPhone.\n\nFraud not only explodes our very understanding of the mode of documentary filmmaking to the point of redefinition; it is a cultural mirror and it invites recognition. O say can you see. (Peter Kuplowsky)",
    "directors": [
        "Dean Fleischer-Camp"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/fraud"
    },
    "runtime": 53,
    "synopsis": "A family's home movies document a desperate crime, and the subsequent bid to escape the consequences in this impressionistic meta-fiction born from the manipulation of hundreds of hours of innocuous uploads to YouTube. An extraordinary feat of editing, a provocative parable of the pursuit of happiness and a disturbing demonstration of the mutability of the stories we share in the Internet age.",
    "title": "Fraud",
    "year": 2015
}