{
    "countries": [
        "Japan"
    ],
    "description": "In the late '60s, venerable Japanese production studio Shochiku turned its attention from the standard melodrama that had become its expected output to new, gooier and more gruesome fare. Case in point is the 1968 low-budget alien invasion gem GOKE: BODY SNATCHER FROM HELL. Director Hajime Satô brings this delightfully pulpy and deliriously earnest example of Japanese horror to the screen with nothing but the best of intentions, creating a remarkable example of what a filmmaker can do with a few bucks, a model airplane and some silly putty.\n\nOn a routine business trip, a gun merchant and his wife, a Japanese senator, the bereaved bride of a recently deceased American G.I., and a sleazy looking ne'er-do-well find themselves holding on for dear life as their airplane crash lands in the middle of nowhere. They miraculously all survive, but before long, the sleazy white-suited Hirofumi disappears into the desert, only to return with a thirst for blood and what can only be described as a disturbingly vaginal gash across his forehead. The rest of the survivors desperately fight for survival as the mysterious gelatinous force possessing Hirofumi sets about eradicating the human race one piece at a time.\n\nLargely remembered for its low-budget effects work and surprisingly avant garde settings, GOKE: BODY SNATCHER FROM HELL is a minor miracle of a horror film. Comparable both to contemporaneous films like Nobuo Nakagawa's 1960 masterpiece JIGOKU and latter day splatter fare such as 1986's NIGHT OF THE CREEPS, Sato's film splits the difference in creating a uniquely atmospheric chamber piece about the end of the world.\n\nGOKE: BODY SNATCHER FROM HELL is screening from a rare 35mm print provided by the American Genre Film Archive in conjunction with the release of American Cinematheque's Dennis Bartok's new book A Thousand Cuts. The book explores the unspoken history of underground 35mm film collectors and their many brushes with the law and history. (Josh Hurtado)",
    "directors": [
        "Hajime Satô"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/goke-body-snatcher-from-hell"
    },
    "runtime": 84,
    "synopsis": "An airplane crashes under mysterious circumstances and the survivors find themselves stalked by an evil blobby presence bent on world domination.",
    "title": "Goke: Body Snatcher From Hell",
    "year": 1968
}