{
    "countries": [
        "Indonesia"
    ],
    "description": "Iko Kuwais continues to demonstrate why he's the best in the business with this over-the-top love letter to violent martial art movies from the bone-crunchingly wonderful minds of the delectable Mo Brothers, who have disturbed us before with KILLERS and the wonderful MACABRE.\n\nIko plays Ishmael, a young man with amnesia discovered washed ashore by Dr. Rika, who takes on his care personally at the hospital where she works. It's not long before bad men start looking for Ishmael; bad men who know him and want to stop him before he regains his memory. .\n\nIt won't be long before Ishmael is forced to defend the doctor he's harboring feelings for and unravel the truth about his own identity in the most audacious, eye-gouging, head-spinningly entertaining action set-pieces seen on the screen for a very long time. Ishmael WANTS the truth and he will stop at nothing and no one until he has destroyed all the obstacles in increasingly violent, inventive and squirm-worthy ways standing between him and the final, ugly result. .\n\nCombining hand-to-hand combat with brilliant fight choreography, this film is an epic of violence delivered in searingly hot set pieces which increase with intensity every new turn. .\n\nIf crazy, adrenaline-pumping action is your jam, then settle down for what is going to be all of your Christmases rolled into one. Try not to scream in mad joy as you encounter what is bound to be one of the most unforgettable screenings Fantastic Fest has ever hosted, and say hello to your new favorite action movie. (Evrim Ersoy)",
    "directors": [
        "Kimo Stamboel"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/headshot"
    },
    "runtime": 117,
    "synopsis": "The bone-crunching, soul-crushing, face-breaking story of an amnesiac young man named Ishmael, the doctor named Rika who cares for him and the bad men who all need to die in a maelstrom of sweet violence.",
    "title": "Headshot",
    "year": 2016
}