{
    "countries": [
        "Japan"
    ],
    "description": "After graduating from high school, Kyosuke Shikijo and his girlfriend Aiko Himeno move on to college. But Aiko wants to move on in other ways too. With the death of Tamao Ogane, Aiko sees no threat and thus no reason for Kyosuke to continue turning into the perverted superhero Hentai Kamen. Kyosuke, stuck between wanting to do good and wanting to please Aiko, reluctantly agrees and gives Aiko back her panties, the source of his perverted powers. His situation is further complicated when his beautiful new biology professor comes on to him.\n\nWhen the panties of all the girls disappear after P.E. class, Aiko suspects Kyosuke. She has her suspicions confirmed when she stumbles on him seemingly stealing another girl's undies. With Aiko mad at him and his professor being persistent, Kyosuke is torn. Aiko had the wrong idea; in reality he was trying to save the panties from some kind of machine, designed to suck in all of the underwear in Tokyo. Who could be behind such a dastardly plot? And with Aiko furious and no panties to rely on, will Kyosuke be able to turn into Hentai Kamen once more to stop them?\n\nWriter/director Yuichi Fukuda is back with the second live-action adaption of the Hentai Kamen manga series. Fukuda has filled his film to the brim with all manner of hilarious insanity. Audiences will be treated to vacuum villains, human spider robot hybrids, giant dinosaur monsters and plenty of panties and perversion and punishment. Nothing is sacred in this ridiculous, over-the-top epic. Hentai Kamen 2 is everything you could possibly want in a movie about a superhero who gets his power from wearing panties on his head. (Luke Mullen)",
    "directors": [
        "Yuichi Fukuda"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/hentai-kamen-2-the-abnormal-crisis"
    },
    "runtime": 118,
    "synopsis": "At the request of his girlfriend Aiko, Kyosuke Shikijo agrees to retire Hentai Kamen. But when a new threat starts stealing panties, who will the people of Tokyo call on?",
    "title": "Hentai Kamen 2: The Abnormal Crisis",
    "year": 2016
}