{
    "countries": [],
    "description": "Murderous ghost warriors...\nDiabolical elderly bellboys...\nAlcoholic airplane pilots...\nJUNGLE TRAP.\n\nThis rampaging slab of shot-on-video horror anti-sanity was directed by exploitation auteur James Bryan in 1990, but remained unedited, unscored and unseen by human eyes... UNTIL NOW.\n\nBeginning in the '70s, James Bryan moved from adult movies to action epics like Lady Street Fighter to drive-in horror masterpieces like Don't Go In the Woods. But the straight-to-video distribution market was gradually evaporating, a realization he had only after he'd completed principal photography on Jungle Trap, a particularly bizarre undertaking that he'd tackled with his longtime creative partner, producer/actress Renee Harmon. Distributors were folding across the industry and those remaining were not adventurous enough to handle the project. Heartbroken, cinematic legend Bryan shelved his movie and never directed again.\n\nWe at Bleeding Skull were devoted fans of James Bryan's work, but had no idea that Jungle Trap had even been attempted. We were shocked that he had an entirely unseen feature just waiting to be pieced together. We watched it and confirmed that all the parts were there. And they were UNBELIEVABLE.\n\nUnder Bryan's guidance, we hired film editor Don Swaynos to assemble the movie, as well as cover a final reconstructing and mastering of the audio by Joseph A. Ziemba. Also, a new score was recorded by Taken By Savages, using '80s synthesizers and perfectly emulating the era's sound.\n\nIn its raw state, the movie was HUGELY entertaining, but it's a monumental video era triumph in its long-delayed final form. It was not only James Bryan's final directorial effort (to date), but his last collaboration with the mighty Renee Harmon. The duo spent decades together in the exploitation trenches and Jungle Trap ranks among their best work. It had to be completed so it could be deeply enjoyed by the world's most adventurous viewers. That's you. (Zack Carlson)",
    "directors": [
        "James Bryan"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/jungle-trap-presented-by-bleeding-skull"
    },
    "runtime": 80,
    "synopsis": "Exploitation demigod James Bryan's massively entertaining, decapitation-fueled shot-on-video horror masterpiece about a jungle hotel haunted by kill-crazy ghosts in loin cloths, shot in 1990 and unreleased until THIS VERY MOMENT.",
    "title": "Jungle Trap: Presented by Bleeding Skull",
    "year": 2016
}