{
    "countries": [
        "India"
    ],
    "description": "Rajeev Ravi's KAMMATIPAADAM is among the most engaging and electrifying works of 21st century Indian cinema. This Kerala-set riff on ONCE UPON A TIME IN AMERICA is a bold and bracing work of art that will have the audience riveted from beginning to end. Ravi cut his teeth as the cinematographer of choice to Anurag Kashyap and was behind the camera for his GANGS OF WASSEYPUR in 2012, but KAMMATIPAADAM definitely holds its own as one of the finest underworld epics ever made in India.\n\nMalayalam language movie star Dulquer Salman is Krishnan, a handsome and brooding security guard living in Mumbai, who makes his living guarding Bollywood film sets. When he receives a desperate phone call from his childhood friend Ganga, played by the mesmerizing Vinayakan, he rushes back to his hometown to find out what's going on, setting in motion an enthralling series of vignettes from their pasts that never cease to amaze. Action, violence, love, loss and betrayal are all on the menu as some of the most brilliantly engaging characters ever put on screen fight for their lives.\n\nKAMMATIPAADAM borrows from the structure of the great non-linear stories of cinema past to tell a gripping story that somehow manages to remain commercially viable, in spite of its expansive scope. Ravi creates fascinating, complete and complex characters that beg for the audience's attention. This synecdoche for the rapid economic growth and resulting rampant corruption of modern India cannot, and will not, be ignored. KAMMATIPAADAM is a briskly paced tour of the historical back alleys of Kerala, all of the dirty deeds that propped up a nation, and you won't want to miss a minute of it. (Josh Hurtado)",
    "directors": [
        "Rajeev Ravi"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/kammattipadam"
    },
    "runtime": 240,
    "synopsis": "Aging gangster Krishnan returns to his hometown after receiving a distressing phone call from a friend, only to find that he's picking up the pieces after thirty years of bloody gang war.",
    "title": "Kammattipadam",
    "year": 2016
}