{
    "countries": [
        "India"
    ],
    "description": "Khalnayak is an ultra-stylish turn for Indian cinema, an oddity that somehow became a huge hit. Iconic Bollywood filmmaker Subhash Ghai focuses on terrifying gangster Ballu (an alluringly sinister Sanjay Dutt in a career-defining performance), who embraces everything that being a bad man entails. Khalnayak is the story of Ballu's journey toward redemption, filled with tense moments, songs to die for, and a plethora of characters ranging from his childhood sweetheart to the upright friend who is his counterpart. However, at the end of the day, the film belongs to Ballu – the \"Khalnayak\" of the title and one of Bollywood's most iconic villains.\n\nFilled with amazing fights, killer fashion, and some of Bollywood's most famous musical numbers, the film is the very definition of a Bollywood masala movie. However, the idea of the anti-hero brought to his current status by circumstances of youth is an idea that is both fresh and exciting.\n\nOriginally conceived as a crime drama for Hollywood, Subhash Ghai's unique take on the genre features all the tropes of a blockbuster: handsome leads, sacrifice and violence. Lots and LOTS of violence. The film even features songs that celebrate these acts of bone-crunching madness.\n\nVoted as one of the top 100 films of World Cinema by Sight and Sound at the turn of the century, Khalnayak has not lost any of its raw power with the passage of time. Its central figure, the larger-than-life Ballu, still ranks as one of the cinema's finest villains: proud, loud, violent and brilliant. It's no wonder that Khalnayak has entered the modern shorthand for Bollywood fans; it is a certified classic. (Evrim Ersoy)",
    "directors": [
        "Subhash Ghai"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/khal-nayak"
    },
    "runtime": 190,
    "synopsis": "Ballu is an unrepentant gangster who has dedicated his life to the celebration of villainy. He is a bad, bad man and not ashamed one bit. However, with the help of his mother and a sympathetic cop, Ballu will rise above his circumstances to gain satisfying redemption.",
    "title": "Khal Nayak",
    "year": 1993
}