{
    "countries": [
        "India"
    ],
    "description": "Before Fantastic Fest favorite Eega, director SS Rajamouli made Magadheera, a masterpiece of modern masala epic filmmaking. This tale-within-a-tale taking place over 400 years is a surefire hit with anyone who digs the kind of balls-to-the-wall experience he previously brought to Fantastic Fest.\n\nHarsha is a bad boy dirt bike racer whose chance encounter with college student Indu leads to a lovelorn pursuit. He feels a deep connection that he cannot understand and needs to know why. Indu's initial suspicion at Harsha's sudden affection soon softens and she begins to fall for him too. Meanwhile, the villainous Raghuveer covets Indu and will stop at nothing to clear any obstacles to his objective.\n\nSoon the truth behind their connection – a 400 year bond of love, loss, and betrayal – is revealed, and Magadheera really kicks into gear. A small crew of central characters become larger than life as their past lives are revealed as those of warrior kings and royal blood. Intimate moments intertwine with expansive action set pieces, turning this contemporary love story into one for the ages. Did we mention the one-vs-one-hundred fight scene? Yeah, that's a killer.\n\nNo one in the world makes films like SS Rajamouli. His unabashed affinity for spectacle and a unique ability to spin romance from the thinnest of threads is unparalleled. Magadheera was a blockbuster in Indian cinemas in 2009, and it returns to the big screen for the first time for Fantastic Fest. Rajamouli is one of the most innovative voices in Indian cinema, using modern tools to tell timeless tales, and Magadheera is as ambitious as they come. (Josh Hurtado)",
    "directors": [
        "S.S. Rajamouli"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/magadheera"
    },
    "runtime": 157,
    "synopsis": "Harsha, a dirt bike racer, lives for thrills. One day he crosses paths with Indu, a girl with whom he feels strangely connected. Through this bond, Harsha discovers his hidden identity: a reincarnated warrior king.",
    "title": "Magadheera",
    "year": 2009
}