{
    "countries": [
        "United States"
    ],
    "description": "Dash (Jason Schwartzman), a punchy sophomore with a thirst for truth and high hopes for the new year, writes the school newspaper with his friend Assaf (Reggie Watts). After stumbling upon some shocking documents in the archives, Dash tries to warn his uninterested classmates of impending doom. When an earthquake strikes, he's quickly proven right as the entire high school begins to sink into the sea. Now Dash and his friends must defends themselves against sharks, fire and gangs of seniors in order to survive.\n\nMY ENTIRE HIGH SCHOOL SINKING INTO THE SEA, the feature debut of famed graphic novelist Dash Shaw, is a dazzlingly inventive animated adventure. Utilizing the gouache paint techniques for which he's known and a series of surprising and creative tricks, Shaw brings his adventure to life in a way that is never anything less than delightful. The impressive cast featuring Susan Sarandon, Lena Dunham, Maya Rudolph and John Cameron Mitchell gives life to Shaw's images and uniquely dry humor.\n\nAs Dash and his crew make their way through the floors of the sinking school, they must mature quickly to overcome increasingly outrageous obstacles. Shaw fills MY ENTIRE HIGH SCHOOL SINKING INTO THE SEA with a surprising remarkable number of keen observations both grand and small, from the nature of truth in storytelling to the appeal of cleaning one's ears with Q-tips. The students of Tides High may have started the day as teenagers, but by the end they will either die or graduate to adulthood. (Brian Kelley)",
    "directors": [
        "Dash Shaw"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/my-entire-high-school-sinking-into-the-sea"
    },
    "runtime": 74,
    "synopsis": "Jason Schwartzman voices a young, hopeful writer who jumps into action during a disaster in this dazzling and hilarious animated adventure from famed graphic novelist Dash Shaw.",
    "title": "My Entire High School Sinking Into the Sea",
    "year": 2016
}