{
    "countries": [
        "Canada"
    ],
    "description": "Audiences were first introduced to the meta-mayhem of Matt Johnson with his sardonic school-shooting faux-doc THE DIRTIES, and with the imminent release of his studio-backed, conspiracy-baked fusion of paranoid thriller and high-concept comedy OPERATION AVALANCHE, his star and that of his ragtag roving duo of camera operators (Jared Raab & Andy Appelle) is on the rise. \n\nHowever, for a select audience, their true introduction to Johnson and company's infectious comic sensibility began with a modest web-series that ran from 2007 - 2009 and \"documented\" the misadventures of Nirvanna the Band, a hapless two-piece trying to book a show at a popular rock club, but perpetually disappearing up their own outlandish fame-chasing schemes. It was funny, anarchic, oddly heartfelt, and by and large the aesthetic stew in which Johnson's subsequent features were born out of. Now thanks to VICE and the participation of Spike Jonze as an executive producer, the saga continues, funnier than ever and with its scope and ambition expanded tenfold.\n\nMatt is once more Matt Johnson and series co-creator Jay McCarrol is once more Jay, as the two friends engage in a host of harebrained plots to land a gig, including the construction of an unlicensed float for a Christmas parade, disrupting  a screening of THE FORCE AWAKENS, and sneaking a film into the Sundance Film Festival. What raises the stakes and heightens the comedy in all these scenarios are that Matt and Jay's fictional antics play out in the real world, interacting with real people caught unaware, much like the Johnny Knoxville and Sacha Baron Cohen's respective comic projects. It is a bonafide high-wire act at times, but don't mistake the series for mere stunt-comedy. The show's true magic emerges from the chemistry and friendship of Matt and Jay. Their relationship is as volatile as the cast of IT'S ALWAYS SUNNY IN PHILADELPHIA, yet simultaneously as endearing as the BFFs of BROAD CITY, and steeped in a soup of deep-cut film and TV references, it's also a pairing whose exploits are guaranteed to leave you breathless from laughter. Extinguish the air from your lungs across three madcap episodes at this special presentation of the upcoming series at Fantastic Fest! (Peter Kuplowsky)",
    "directors": [
        "Matt Johnson",
        "Jay McCarrol"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/nirvanna-the-band-show"
    },
    "runtime": 75,
    "synopsis": "Two friends will go to the most inane, self-destructive lengths to rise to musical fame in this new series from Matt Johnson of THE DIRTIES.",
    "title": "Nirvanna the Band Show",
    "year": 2016
}