{
    "countries": [
        "Japan",
        "Canada"
    ],
    "description": "As if plucked from the era of MTV's LIQUID TELEVISION, NOVA SEED is both a propulsive menagerie of pulp sci-fi eclecticism, and an extraordinary testament to the audacity and dedication of its creator Nick DiLiberto. In conjuring a vibrant post-apocalyptic adventure as imaginative as those of Moebius or Miyazaki (and no doubt inspired by both artists), every character, backdrop and frame of animation of this film was born from DiLiberto's brain and rendered by his single tireless hand across 60,000 sheets of paper over four years. Even the sound design springs directly from the artist, as many of the effects are vocalized a cappella by DiLiberto himself in lieu of traditional foley. It is a remarkable and endearing feat of DIY discipline, one that anecdotally even required bandaging his hands to prevent his paper cuts from bleeding onto the page as he drew.\n\nSet in the aftermath of a devastating global war, one fought on behalf of mankind by armies of gene-spliced animal/human hybrids known as NACs (Neo Animal Combatants), a malevolent scientist plots to subjugate the remnants of civilization through the wielding of the Nova Seed, an entity that holds the power to restore the planet's debilitated eco-system. (Think WRATH OF KHAN's Project Genesis meets THE FIFTH ELEMENT.) To combat this threat, humanity's last vestige of government desperately enlists the reluctant aid of a lion-man NAC in a bid to destroy both the Nova Seed and its power-hungry creator, the sublimely named Dr. Mindskull. Everybody got that?\n\nWhile the story and setting are decidedly familiar with respect to its genre, DiLiberto peppers the plot with wonderfully eccentric details that tease a much larger canvas as he catapults the audience from thrilling air battles to eerie subterranean railroads and storm-ridden wastelands. He may be consciously evoking both 1980s Saturday morning cartoons and Heavy Metal comics, but it is not an exercise in ironic nostalgia. There is a refreshing radiance and gleeful elasticity to DiLiberto's aesthetic. It is at once sincere, unique and in the context of the film's means of production, wholly inspiring. (Peter Kuplowsky)",
    "directors": [
        "Nick DiLiberto"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/nova-seed"
    },
    "runtime": 64,
    "synopsis": "Painstakingly hand-drawn by a single animator over four years, this saturated slice of lo-fi sci-fi pulp recalls both Moebius and Miyazaki as it ambitiously realizes an eclectic post-apocalyptic future populated by lion-men, brain-leeching slugs and Saturday Morning Cartoon villainy, the latter most memorably personified by the sublimely named Dr. Mindskull.",
    "title": "Nova Seed",
    "year": 2016
}