{
    "countries": [
        "India"
    ],
    "description": "It's with distinct pleasure that Fantastic Fest presents the notorious first feature by the enfant terrible of Indian cinema, Anurag Kashyap. Considered too extreme at the time of its release, the film was never granted a classification and effectively was never available theatrically or on home video. \n\nPAANCH concerns the five members of a rock band who overindulge in every aspect possible: drugs, smoking, casual sex and alcohol. It doesn't help that the band dynamics are stretched at best, with sexual tension and bullying rife amongst the members of the band. However, none of them can see the disaster looming ahead for them. As their lives spiral out of control and their actions get more and more violent, a supposedly simple kidnapping plot will lead them down a terrible path which can only end in misery, tragedy and worse.\n\nStructurally inspired by Rafal Zielinski's terrific 1994 film FUN, Kashyap's debut is an assured piece of filmmaking that establishes many of the themes that were to become the filmmaker's trademark. Focusing on the seedier underbelly of the city, Kashyap carefully shows a different view of India; full of disillusioned youth who try to feel better at the expense of each other. The gritty landscape is augmented by a sense of anger, which is brought to life by the terrific performances of the five leads. The film always manages to balance its elements at play and create a worrying, vicious critique of modern life.\n\nNot seen on the big screen since its initial ban, this screening provides the chance for a new audience to discover the mesmerizing underworld of Kashyap's imagination and discover a seedier, sleazier side to India than they've ever seen. A must on the big screen and a great introduction to one of the finest filmmaking talents of this century. (Evrim Ersoy)",
    "directors": [
        "Anurag Kashyap"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/paanch"
    },
    "runtime": 130,
    "synopsis": "Anurag Kashyap's notorious first feature focuses on the five members of a rock band who indulge in sex, drugs, rock n' roll, and before long…crime! Their lives will never be the same.",
    "title": "Paanch",
    "year": 2003
}