{
    "countries": [
        "Republic of Korea"
    ],
    "description": "Lee Sang-Woo returns! After last year's brilliant double bill of SPEED and DIRTY ROMANCE, he's back with another twisted tale of modern Korea. His unique exploration of the outcasts and the oddballs present within his native society this time focuses on a very odd family.\n\nSung-gi is a pervert. His sexual deviations range far and wide, but at heart he's a good boy, living with his brother in small hut away from the city. However, his sexual indiscretions mean that his brother is constantly having to find money to keep those affected quiet. And as these bills rack up, the siblings find themselves having to give up their home and move to Seoul to settle with their oldest brother, a distant, cold man who does not care about them. As tensions rise and the dynamic between the trio changes, the reappearance of their mother and a surprise family member will throw everything into chaos.\n\nFestival alumni Lee Sang-Woo is a unique voice in Korea and it gives us endless delight to be able to welcome his latest to this year's edition of FF. His exploration of the dark, odd, perverted corners of Korea, always with characters who are twisted, broken, weird, and – above all – human, continues with this dissection of a very strange family and their stilted relationships. It's to Sang-Woo's credit that his creations never feel forced, and his confrontational depictions never comes across as shock tactics, but rather real people whose stories may never go noticed unless he turns his lens on them. His lo-fi aesthetics give everything an urgency and finds us caring more and more for this odd bunch, and when the inevitable tragedy strikes, the effect is all the more strong. A powerful, sometimes unsettling journey. (Evrim Ersoy)",
    "directors": [
        "Lee Sang-woo"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/pervert-boy"
    },
    "runtime": 88,
    "synopsis": "This is the story of four brothers and the inevitable clash between their lives in modern day Seoul. This is the story of a pervert boy and those who surround him.",
    "title": "Pervert Boy",
    "year": 2016
}