{
    "countries": [
        "United States"
    ],
    "description": "Writer-director Don Coscarelli's Phantasm hit the screens in the summer of 1979. A word-of-mouth phenomenon from the jump, film audiences immediately responded to Phantasm's surreal storyline, splatter-punk shocks, and sincere sentiments. A fast-paced, dream logic depiction of a 13-year-old boy's confrontation with mortality, as personified by the towering form of the mortuary-dwelling Tall Man, Phantasm was a massive success and attracted a highly passionate following around the globe, which endures to this day. Over several decades, Phantasm spawned three well-received sequels (with a fourth and final sequel awaiting release this year) and quickly became an early home video staple, earning it even more \"phans.\" The film's proven impact on generations of young viewers has created legions of life-long enthusiasts.\n\nCurrently a meticulous 4K digital restoration of the film and audio has been completed under the auspices of filmmaker (and Phantasm fan) JJ Abrams and his Bad Robot Films. This labor of love will surely delight phandom globally, while bringing a new generation to the Tall Man's clutches. (Don Coscarelli)\n\nThe residents of a small Oregon town have begun dying under mysterious circumstances. Following the passing of a friend, 13-year-old Mike finds himself compelled to investigate. He discovers that the town's mortician (a sinister and malevolent character Mike nicknames \"the Tall Man\") is responsible for murdering and reanimating the populace. The boy seeks help from his older brother and Reggie, a local ice cream man. Working together, the trio must lure and confront the Tall Man, all the while avoiding his rabid minions and his flying chrome killing device, the deadly silver sphere. (James Emanuel Shapiro)",
    "directors": [
        "Don Coscarelli"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/phantasm-remastered"
    },
    "runtime": 88,
    "synopsis": "One of the most influential and important horror films of all time, Don Coscarelli's Phantasm returns to Alamo Drafthouse's screens in a gorgeous 4k remaster.",
    "title": "Phantasm: Remastered",
    "year": 1979
}