{
    "countries": [
        "Poland"
    ],
    "description": "Bartosz M. Kowalski's foray into fiction is a brutal, brilliant affair that is bound to outrage and shock in equal measure. An unexpectedly astute exploration of a country in limbo, this is the film that'll have you questioning a lot of your beliefs.\n\nIt's the final day of school in a small town in Poland. The students are getting ready to break for the summer. 12-year-old Gabyrisa has finally gathered the nerve to tell her classmate Szymesk that she has fallen in love with him. She blackmails the boy to set up a meeting, but what was meant to be an intimate talk spins out of control and soon the entire class is hurtling towards a violent end that no one could expect.\n\nKowalski has previously worked exclusively in documentary and it's easy to see why he'd want to make the jump. His narrative debut is a fierce, ferocious exploration of the state of the nation in Poland that retains a lot of the observational skills he has perfected in the documentary field.\n\nUsing the simple setup of a playground crush, Kowalski turns his unblinking eye on Polish society. The children act as extensions of the adults that surround them, both distant and yet influential.\n\nIt's hard to write about the film without addressing the core issue: the brutal violence which seems to permeate every frame. Just like NOTHING BAD CAN HAPPEN and THE TRIBE, Kowalski's film is not a parade of brutalities for brutality's sake. Instead, it's an exploration of what happens when those that lead a nation fail the generations after them. It's about the nature of terrible acts, the reasons they occur and the sometimes desperate inability to formulate an answer.\n\nThere will be many films that demand your attention at this year's festival but none will have the urgency of this fearless work. Guaranteed to both offend and engage, do not miss the chance to see Kowalski's ambitious masterwork and encounter its raw power first hand on the big screen! (Evrim Ersoy)",
    "directors": [
        "Bartosz M. Kowalski"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/playground"
    },
    "runtime": 81,
    "synopsis": "It's the last day of school in small town Poland and Gabrysia wants to tell her classmate that she loves him. But it will not end well.",
    "title": "Playground",
    "year": 2016
}