{
    "countries": [
        "Netherlands"
    ],
    "description": "Ivo and Randy dream of the big action. Shoot outs. High speed chases. Dramatic takedowns and high profile busts, the rules be damned. After all, it's why they became cops, and for one brief shining moment they think they have it. It's all so perfect. And then it blows up in their faces and the two dim do-gooders find themselves in prison where they ironically uncover the largest crime ring the nation has known. Their careers would be made if they weren't already over.\n\nThe feature-length expansion of Kill Zombie duo Martijn Smits and Erwin van den Eshof's hit action-comedy mini series, Popoz pairs Kill Zombie star Sergio Hasselbaink with New Kids shit disturber Huub Smit with predictably – and hysterically – over-the-top results. Imagine the Jump Street films if they really, REALLY didn't give a shit about political correctness and you're approaching the general level of lunacy on display with Popoz.\n\nGuns, explosions, high speed chases, tight pants, tighter tops, no tops at all, disfigured super villains, prison fight clubs, industrial machinery bizarrely repurposed into super-weapons and lots and lots of cocaine. If you can name it, Popoz probably has it; the entire film plays out like a case of feverish, consequence-free, adolescent wish fulfillment from someone raised on a steady diet of late '80s and early '90s action films. Outrageous, occasionally offensive and deeply, deeply funny, Popoz throws American blockbuster clichés back into our faces and giggles nonstop while doing it. (Todd Brown)",
    "directors": [
        "Erwin van de Eshof",
        "Martijn Smits"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/popoz"
    },
    "runtime": 85,
    "synopsis": "Festival favorite Huub Smit (New Kids Nitro; New Kids Turbo; Bros Before Hos) stars as a Dutch cop raised on far too many American action films in this outrageous action comedy.",
    "title": "Popoz",
    "year": 2015
}