{
    "countries": [
        "India"
    ],
    "description": "India's most notorious filmmaker is back! Anurag Kashyap returns to the big screen with Psycho Raman. Far from the pomp and extravagance of his recent Bombay Velvet, this is a masterpiece of violence and psychological terror, a return to the cinematic oeuvre that made Kashyap famous. This is the dangerous, unpredictable Anurag Kashyap that the West fell in love with after Gangs of Wasseypur… and wait until they get a load of him now.\n\nRamanna (Gangs of Wasseypur star Nawazuddin Siddiqui) is a killer without remorse or regret for the vile things he does. He cuts a bloody swath through the Mumbai slums, leaving corpses behind for the cops to pick up. On his trail is Raghavan (Vicky Kaushal), a cokehead cop with a violent streak and antisocial tendencies. When Ramanna comes face to face with Raghavan during an interrogation, he sees something more than an adversary, and as Raman's homicidal urges begin to ramp up, Raghavan's ability to maintain his mask of sanity deteriorates until the two become inextricably linked like yin and yang.\n\nPsycho Raman arrives at Fantastic Fest in a new director's cut. The film breaks all the rules of conventional thrillers to create something darker and more intense than Indian film fans have ever seen. Intense, mesmerizing performances from Nawazuddin Siddiqui and Vicky Kaushal provide for a rare treat as Kashyap pushes the boundaries of a conventional cat and mouse thriller.\n\nPsycho Raman is a stunning, violent, and complex work of art. This is the film you've been waiting for, and Kashyap and his team have not disappointed. (Josh Hurtado)",
    "directors": [
        "Anurag Kashyap"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/psycho-raman"
    },
    "runtime": 127,
    "synopsis": "Raghavan is a cop: brutal, violent, and drug-addicted. Ramanna is a criminal: psychotic, unpredictable, and vicious. It's only a matter of time before they meet and when they do, Mumbai's slums will be colored deep crimson.",
    "title": "Psycho Raman",
    "year": 2016
}