{
    "countries": [
        "Japan"
    ],
    "description": "It has been a turbulent few years for longtime festival favorite Tak Sakaguchi. After exploding onto the scene as the star of Ryuhei Kitamura's VERSUS back in 2000, Sakaguchi has been one of the go-to action stars and fight choreographers in Japan, with a loyal cadre of fans all around the globe. But Takaguchi's career nearly came to a screeching halt in early 2014 when a bitter business dispute forced him into pseudo-retirement; he halted all appearances in front of the camera and was forced to do his continuing work as action choreographer on Sion Sono's TAG and TOKYO TRIBE under a pseudonym. But with RE: BORN, Tak is back and he's bringing erstwhile collaborator Yuji Shimomura (director of DEATH TRANCE) with him.\n\nWhen an entire squad of Japanese Defense Force soldiers are cut down during a training exercise, it appears the worst is true: the Ghost, a legendary covert operative, has seemingly come back and set his targets on the force that used and abandoned him. His old comrade is now living a quiet life and trying to simply slip by unnoticed as he raises the young girl in his care, but must return to the world he abandoned to stop his former friend turned enemy.\n\nBuilt around a unique fight discipline created by combat supervisor Yoshitaka Inagawa, with a script stripped back to its bare essentials, RE: BORN plays like a sort of FIRST BLOOD reflected back on itself. It's as though Sakaguchi and Shimomura asked themselves, \"What if is there is not just one John Rambo, but two... and they're on a collision course?\" Shimomura – one of the world's most underappreciated action directors and a key member of Donnie Yen's stunt team – shoots vicious segments with a raw elegance while Sakaguchi proves once again that his quiet gravitas makes him one of the most compelling action stars in the world. (Todd Brown)",
    "directors": [
        "Yûji Shimomura"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/re-born"
    },
    "runtime": 106,
    "synopsis": "Tak Sakaguchi is a seemingly untouchable super soldier who must return to the life he left behind when a former colleague threatens his fragile world.",
    "title": "Re: Born",
    "year": 2016
}