{
    "countries": [
        "Hong Kong"
    ],
    "description": "Presented by Nerdist and El Rey Network\n\n\"Arguably the greatest martial arts film of all time.\" - Todd Gilchrist, IGN\n\nAfter 18 months of careful planning, it's finally here. Award-winning musician and film director RZA (founder of the Wu-Tang Clan) is unleashing his hip hop genius on the mother of all martial arts masterpieces, Lau Kar-leung's THE 36th CHAMBER OF SHAOLIN, in a live re-score for the ages.\n\nLong before he was universally acknowledged as a guiding force in hip hop by birthing Staten Island's finest clan, RZA was an obsessive encyclopedia of martial arts cinema, in particular the work of the famed Shaw Brothers studio out of Hong Kong. RZA first saw THE 36th CHAMBER OF SHAOLIN on television when he was 12 years old, and again 2 years later on the big screen of a seedy 42nd Street theater with his cousin, Unique (who went on to become Ol' Dirty Bastard). Dazzled by Kar-leung's rich kung-fu tapestry, RZA (then Robert Diggs) was most profoundly affected by something that ran much deeper: the struggle between oppressed Chinese villagers and the repressive Manchu authority. \"Beyond the kung-fu, it was the reality of the situation that hit me. Growing up as a black kid in America, I didn't know that that kind of story had existed anywhere else,\" said RZA.\n\nIn viewing THE 36th CHAMBER OF SHAOLIN in this allegorical light, RZA was inspired to create a wildly complex mythology, transforming his immediate urban surroundings of Staten Island into a Shaolin and his cousins and childhood friends into the Wu-Tang Clan. The resulting effort is one that stands as one of the most important hip hop albums of all time: Enter the Wu-Tang (36 Chambers).\n\nRZA: LIVE FROM THE 36th CHAMBER OF SHAOLIN features RZA re-scoring the film from opening sequence to closing credit. Every frame of the original film has been revisited and will be re scored by RZA utilizing a Wu-Tang catalog over two decades deep. This new score features a vast array of over forty instrumental tracks, beats and vocals individually crafted and placed to amplify the narrative and electrifying action of Kar-leung's enduring classic. A true, redefining assault on the senses, this is an experienced not to be missed.\n\nNote: Informed by how he saw the film growing up, RZA is performing his re-score with the dubbed version of THE 36th CHAMBER OF SHAOLIN. All original dialog remains intact.\n\nSpecial thanks to Celestial Pictures, The Spellbound Group, Alamo Drafthouse, Tamika Layton and RZA. (Christian Parkes)",
    "directors": [
        "Chia-Liang Liu"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/rza-live-from-the-36th-chamber"
    },
    "runtime": 115,
    "synopsis": "What happens when one of the most influential hip hop artists descends on one of the most influential martial arts movies? There's only one way to find out.",
    "title": "Rza: Live From the 36th Chamber",
    "year": 1978
}