{
    "countries": [
        "Italy"
    ],
    "description": "Stanley Kubrick occupies a hallowed place in the hearts of many cineastes, but he was a deeply private man whose cautious and cynical view of humanity was apparent in almost all his films. Faced with death threats in reaction to A Clockwork Orange, the reclusive filmmaker withdrew completely from public eye, famously building Vietnam and New York in London rather than leaving the protection of dominion he built for himself and his family. Because of his distrust of nearly everyone outside his immediate family, very little is known about the man about whom Steven Spielberg famously said, \"Nobody could make a movie better than Stanley Kubrick – in history.\"\n\nEmilio D'Alessandro knew Kubrick better than any non-family member. Who, you ask? D'Alessandro, a cab driver and aspiring Formula 1 racer was first hired to be Kubrick's chauffeur, and the two connected so well that Kubrick quickly made D'Alessandro his personal assistant. Kubrick came to care so much for D'Alessandro that the two stayed together for more than thirty years and through four films.\n\nS is for Stanley provides a detailed and intimate portrait of both men. The insight into Kubrick's day to day (even seeing his hand written directions to D'Alessandro directing him to pick up movies in downtown London, or dozens of thermometers for Kubrick to test out, or instructions on how to feed all his pets) reinforces and enriches what we know of Kubrick and his gift to make some of the greatest films ever. That's exciting for Kubrick fans, but even more valuable to the movie-goer is a portrait of a man committed to providing whatever is needed to reach absolute perfection. Kubrick was a genius but S is for Stanley's main subject shows another kind of excellence. (James Emanuel Shapiro)",
    "directors": [
        "Alex Infascelli"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/s-is-for-stanley"
    },
    "runtime": 82,
    "synopsis": "Alex Infascelli's documentary about Emilio D'Alessandro, Stanley Kubrick's personal assistant for more than thirty years, which provides never-before-seen insight into the private auteur.",
    "title": "S Is for Stanley",
    "year": 2016
}