{
    "countries": [
        "Australia",
        "United States"
    ],
    "description": "Deandra (Virginia Madsen) and Robert (Patrick Warburton) think nothing of leaving their 12-year-old son Luke (Levi Miller) with their regular babysitter Ashley (Olivia DeJonge) when they go out one snowy evening before Christmas. After all, their neighborhood is a safe one and after they leave, the greatest threat in their home appears to be to Luke's dignity as he attempts to win over Ashley's love. Ashley is every bit as sharp and quick-witted as she is beautiful and expertly avoids making a potentially embarrassing situation worse. She's finally put to the test when she and Luke find themselves in the middle of an unusual home invasion.\n\nDirector Chris Peckover, whose twisted found footage debut shocked Fantastic Fest audiences in 2010, returns with a film seemingly tailor-made for our crowd, and one that immediately earns a spot amongst the best yuletide thrillers. Working from a playful yet increasingly dark script from MAD TV writer Zack Kahn, Peckover nails a particularly difficult tone and the result is a lean, clever and fast-moving crowd-pleaser.\n\nMuch of the credit has to go to Peckover's young cast. Once the parents are out to dinner, a good portion of the film is carried by Miller and DeJonge as well as Ed Oxenbould as Luke's best friend Garrett. These teens are more than up to the task.\n\nIt's hard to say what is going on at other houses on the street as SAFE NEIGHBORHOOD accomplishes all that it does within the confines of a single home. However, one can easily conclude by the end that no neighborhood is really safe from this kind of suburban evil. (Brian Kelley)",
    "directors": [
        "Chris Peckover"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/safe-neighborhood"
    },
    "runtime": 85,
    "synopsis": "Chris Peckover, director of 2010's UNDOCUMENTED, returns to Fantastic Fest with this playfully twisted suburban Christmas thriller in which babysitter Ashley must protect twelve-year-old Luke during an unusual home invasion.",
    "title": "Safe Neighborhood",
    "year": 2017
}