{
    "countries": [
        "Mexico"
    ],
    "description": "Nearly 35 years after achieving cinematic immortality with the incredible tale of a man's obsessive quest through the Peruvian jungle in Fitzcarraldo, Werner Herzog returns to South America for Salt and Fire, a quieter – but no less epic – tale of unchecked corporate greed, inexplicable ecological terror and shuddering existential agony.\n\nJust thirty hours ago, Professor Laura Sommerfeld (Veronica Ferres) and her scientist colleagues (Gael Garcial Bernal and Volker Michalowski) were en route to South America to survey the volcanic Diablo Blanco disaster zone on behalf of the United Nations.\n\nNow, she has been detained, handcuffed, and secreted away to an unknown location under armed guard and the unblinking eye of a pillaging corporate imperialist (Michael Shannon) and a terrifyingly withdrawn, wheelchair-bound, machine gun-toting nihilist (noted cosmologist and theoretical physicist Lawrence Krauss in his acting debut).\n\nSoon, Laura will find herself quite literally at the center of the ecological and political fallout of Diablo Blanco: abandoned and forced to survive with limited provisions in a mysterious and rapidly expanding man-made desert that could one day overrun the world.\n\nReteaming with Shannon for the first time since 2009's David Lynch-produced My Son, My Son, What Have Ye Done?, Herzog continues to gleefully flaunt genre conventions, punctuating his thriller with lyrical monologues, absurd motivations, inexplicable divergences, and fleeting encounters with the poetic and the bizarre – right up to the point of excess. The two films represent challenging, almost frustrating, examples of auteurism come alive and at its most insidious, much like the desert at the heart of Diablo Blanco.\n\nTruly Herzog's most wildly unpredictable film, Salt and Fire is a precision blast by a virtuoso madman at the height of his aspect, and an increasingly outrageous descent into a Hell that we have allowed to be created. (Jon Stobezki)",
    "directors": [
        "Werner Herzog"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/salt-and-fire"
    },
    "runtime": 93,
    "synopsis": "Herzog's most wildly unpredictable film, Salt and Fire is a meticulously slow burning, quasi-ecological thriller punctuated by moments of the lyrically poetic and the inexplicably, outrageously absurd.",
    "title": "Salt and Fire",
    "year": 2016
}