{
    "countries": [
        "Australia"
    ],
    "description": "Alien monsters! Laser-blasting space ships! Prison riots! Australian VFX whiz Shane Abbess (INFINI;, GABRIEL) packs in all of that and more, more, more in his loving ode to pulpy science fiction space operas, THE OSIRIS CHILD.\n\nKane Sommerville (Daniel MacPherson) has pretty much washed out of life. Though talented, his battles with the bottle and a general sense of immaturity have thrust him out to the farthest reaches of the universe. There, he works as a military contractor for a massive corporation running a prison settlement on the surface of the planet far below his orbiting home. But when his employers other money-making ventures and general disinterest in public safety combine to unleash a horde of rampaging aliens across the surface of the planet (with Kane's visiting daughter right in their path), it's time to man up, steal a spaceship and save his little girl, with only a group of escaped prisoners led by Kellan Lutz to help him.\n\nScience fiction is a rarity in the indie film world, and science fiction that sets its sights on sweeping interstellar opera complete with monsters, aliens, laser fights and swooping space fighters blasting away is even rarer, which makes THE OSIRIS CHILD a very unique treat. Writer/director Abbess is a true visual talent, able to achieve studio level scale on an indie budget, and he applies all of his considerable skills here to bring an action-packed, adventure-filled vision of the future to the big screen. Abbess employs an obvious love for '60s and '70s dime store novel visions of the future to the proceedings here, and judging from the impressive cast of heavy weight players involved – Rachel Griffiths, Temuera Morrison and Isabel Lucas all feature prominently – his love for the era is contagious. (Todd Brown)",
    "directors": [
        "Shane Abbess"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/science-fiction-volume-one-the-osiris-child"
    },
    "runtime": 95,
    "synopsis": "A far-future military contractor – and moderately shitty father – must race to save his daughter when his employer's negligence puts her in the path of a rampaging alien race.",
    "title": "Science Fiction Volume One: The Osiris Child",
    "year": 2017
}