{
    "countries": [
        "Japan"
    ],
    "description": "Based on the acclaimed manga series, SHIMAUMA is the story of Dora, a lowlife con who makes his living running a marriage scam with his associates. One day, when a proposed mark turns out to be a yakuza, Dora and his gang find themselves plunging into a world of darkness, via a business which offers to take revenge for their clients on those who harmed them by any means necessary. It's not long before the vicious beast inside Dora is awakened and he becomes a collector for the mysterious SHIMAUMA.\n\nLanding on the screen like a thousand-pound hammer. SHIMAUMA is a nihilistic, brutal journey into the dark heart of modern day Japan. With lo-fi visuals and an operatic sense of excess, it depicts the marginalized collectors that exist on the lowest rung of Japanese society; an imaginary business which, in its own words, feeds on the excrement that filters through those above.\n\nIt's hard to think of another movie which attacks the viewer with such verve. The journey of Dora, from angry, young scammer to brutal, bitter collector is a highly effective critique of the human condition: brittle, brutal and ready to plunge into animal urges at any given moment. As Dora and his cohorts receive assignment after assignment from the mysterious leader Shimauma, they shed their humanity inch by inch. Their methods are ugly, unorthodox and highly worrying and their aim is singular: to give their victims a fate worse than death which breaks their very desire to exist.\n\nCarefully eschewing cheap shock tactics in favor of lingering, effective brutality, there is also a gorgeous sense of excess and humor present. It may be set in modern day Tokyo, but rather than turning down its comic book characters, this film embraces them to brilliant effect, creating a deadpan ride which terrifies as much as it entertains. This is the kind of film to be debated long after the festival ends and one to miss at your own peril. (Evrim Ersoy)",
    "directors": [
        "Hajime Hashimoto"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/shimauma"
    },
    "runtime": 103,
    "synopsis": "Dora is a lowlife con man who runs a marriage scam with his associates. But a badly timed encounter with a yakuza will plunge Dora into a new, deep world of darkness, both ugly and enticing!",
    "title": "Shimauma",
    "year": 2016
}