{
    "countries": [
        "United Kingdom"
    ],
    "description": "Austin Tilden is ready to get out of Grantham, Virginia. With his mom dead and his girlfriend pulling at him, the only thing keeping him is his relationship with his father Tommy, the local coroner. The Tilden morgue has been a staple in Grantham for years and Austin still has plenty to learn from his dad, who may be older but is still as sharp as they come. When the local sheriff brings in a corpse late one night, Austin blows off plans with his girlfriend to stay and help his father with the autopsy.\n\nThe body belongs to a young woman found half-buried at a crime scene. With no ID and her fingerprints not found in the police system, she's classified as a Jane Doe. What's more troubling is that there's no apparent reason for her to have been at the crime scene. And the body is pristine, with no apparent cause of death. As the Tildens start the autopsy, they discover that her eyes have clouded, which would indicate a body that's been dead for days, but the muscles show no rigidity or signs of rigor mortis. And that's just the first anomaly they find. As the strange inconsistencies pile up and a thunderstorm rolls in, the Tildens will find that the body on their table holds plenty of dark and terrifying secrets.\n\nDirector Andre Ovredal is back with this English-language follow up to his 2010 Fantastic Fest hit Troll Hunter. Brian Cox and Emile Hirsch are both spectacular in the lead roles, playing off each other beautifully and selling the mystery and the fear. Ovredal uses slow lingering shots to build tension and create atmosphere to great effect, while the cinematography and production design give the film a look and polish on par with big studio films. The Autopsy of Jane Doe is an enigmatic and ominous descent into hell. (Luke Mullen)",
    "directors": [
        "André Øvredal"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-autopsy-of-jane-doe"
    },
    "runtime": 99,
    "synopsis": "When a mysterious body turns up at a crime scene, the local sheriff turns to the coroner and his son to find the cause of death.",
    "title": "The Autopsy of Jane Doe",
    "year": 2016
}