{
    "countries": [
        "France"
    ],
    "description": "Not a single word of dialogue is spoken throughout Michael Dudok de Wit's debut feature THE RED TURTLE, but its sights and sounds communicate a literal lifetime of emotional peaks and valleys. Born of an unexpected but rewarding collaboration with the legendary animation powerhouse Studio Ghibli (SPIRITED AWAY), who sought out an excuse to work for Dudok de Wit after seeing his Oscar-winning short FATHER AND DAUGHTER, the film weaves an enigmatic fable about a man struggling to escape a deserted tropical island after washing up on its shore.\n\nBuilding a raft, he attempts to journey back across the ocean, but perpetually finds his passage barred by a great red tortoise. This drives the man to both ingenuity and violence, but by some magical providence, he discovers a mysterious islander and her presence resigns him to eke out an existence there. All the while, a chorus of crabs scuttle across the beach, comical witnesses to the man's meager yet moving new life.\n\nIt's an episodic, deliberately paced tale, and one made utterly transfixing by minimalist but sublimely nuanced animation, which was supervised by Jean-Christophe Lie (THE TRIPLETS OF BELLEVILLE) and received close consultation from creative producer Isao Takahata (THE TALE OF THE PRINCESS KAGUYA). Though Ghibli fingerprints are evident throughout, the aesthetic style is a distinct mix of European and Eastern traditions, and its form stark and austere, frequently composing the frame on a proscenium that recalls an illustrated children's storybook or perhaps the visual grammar of French PC adventure games like Éric Chahi's ANOTHER WORLD. It's a style that feels both familiar and innovative all at once.\n\nWith the recent retirement of animation giants such as Hayao Miyazaki and the aforementioned Takahata, it's exciting to see a talent as palpable as Dudok de Wit granted the resources to manifest such a quiet masterpiece; one that assures a future for traditional animation, while embracing the new horizons digital technology affords. It might also break your heart. (Peter Kuplowsky)",
    "directors": [
        "Michaël Dudok De Wit"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-red-turtle"
    },
    "runtime": 81,
    "synopsis": "A castaway ekes out an existence on a deserted tropical island guarded by an enigmatic red tortoise in this magnificent animated fable from the imagination of acclaimed Dutch animator Michael Dudok de Wit (FATHER AND DAUGHTER) and produced in part by the legendary Studio Ghibli.",
    "title": "The Red Turtle",
    "year": 2017
}