{
    "countries": [
        "Poland"
    ],
    "description": "Mateusz's plan was simple enough. To revisit the simplicity of his former life working as a border guard in the remote region along the Poland-Ukraine border, he would take his two teen sons for a winter camping trip in his old stomping grounds. Get back to nature. Throw off the restrictions of urban living. Teach them to be men. It would be simple enough to do. After all, he still has friends there in the border stations, and they'd be happy to let Mateusz and his boys use one of their neglected cabins.\n\nIt all goes according to plan at first. A bit of familial tension, to be sure, as the generation gap looms a little larger in this family than in most, but things are going well until a man stumbles out of the wild. Poorly equipped and half frozen, he simply collapses when he comes through the door, leaving Mateusz with a troubling decision. There's no good reason for this man to be where he is, but he must have come from somewhere which means there may be more people at risk. There is no other help to be had, so Mateusz makes the only decision he can and sets out in search of survivors, counting on his sons' intelligence – and a pair of handcuffs – to protect them should the mysterious stranger wake while Mateusz is gone.\n\nPolish megastar Marcin Dorociński turns in a deliciously villainous performance in this slow-burning thriller from writer/director Wojciech Kasperski. Kasperski makes fabulous use of the stark countryside and hostile natural environment, the barren landscapes matching the increasingly bleak scenario as he ratchets the tension throughout his powerful debut. (Todd Brown)",
    "directors": [
        "Wojciech Kasperski"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-high-frontier"
    },
    "runtime": 97,
    "synopsis": "Father/son bonding time takes an extraordinarily dark turn when a former guard and his two teen boys receive an unexpected guest in their remote cabin along the Poland-Ukraine border.",
    "title": "The High Frontier",
    "year": 2016
}