{
    "countries": [
        "Poland"
    ],
    "description": "Film lovers come from near and far to experience Fantastic Fest's well-established tradition of showcasing the least traditional offerings from the cinematic landscape, and this year's Polish import, THE LURE, combines so many fascinatingly eclectic elements into one improbably cohesive package that it feels like a suicide soda, made up with every different flavor of the strange and bizarre.\n\nOne dark night, two sisters, Golden and Silver, convince a group of musicians to help them get ashore. They need a hand with this; not because they can't swim, but because they're both mermaids. They quickly join the band in performing at a colorful Warsaw nightclub, but agree that Poland is a just a pit stop on the way to America. However, as their act becomes more and more successful, the sisters discover that their goals for the future are slowly diverging. While Silver has been gradually falling in love with the bass player, Golden's thirst for flesh and blood has become increasingly insatiable. And the girls will soon discover that it's not just Golden's desires that could have fatal consequences.\n\nAgnieszka Smoczyńska's debut feature film is a whirlwind of cabaret and carnality punctuated by several beautifully staged musical segments. While it's certainly an odd film, with highly entertaining, over-the-top sequences, Smoczyńska is nonetheless able to keep the characters' relationships grounded, making us care about the sisters as tensions escalate between both them and the outside world.\n\nWritten by Robert Bolesto, who also wrote FF 2014 selection HARDKOR DISKO, the script incorporates a heavy dose of mermaid mythology to flesh out the fantasy elements while driving the plot towards its surprisingly emotional climax. THE LURE is a singular, unforgettable experience; the heartfelt neon-soaked Polish mermaid musical that you never knew you always wanted. (Luke Mullen)",
    "directors": [
        "Agnieszka Smoczynska"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-lure"
    },
    "runtime": 93,
    "synopsis": "Two young mermaids get caught up in the world of a Warsaw nightclub as they navigate human life and love in this Polish musical.",
    "title": "The Lure",
    "year": 2015
}