{
    "countries": [
        "France"
    ],
    "description": "Yanis is one of the best – if not the best – hijackers working the Paris streets, the simple fact that he remains unknown a powerful testament to his skills. Working with a tight, loyal crew of lifetime friends and family, there's seemingly no target they can't knock over. For a high stakes life, theirs is quite stable… until Yanis' brother makes a critical error that leaves them greatly indebted to a powerful local drug lord. Suddenly, their lives are no longer their own and the stakes have never been higher.\n\nSince he burst on to the international scene with 2007 scifi effort Chrysalis, French writer-director Julien Leclerq has quietly built a name for himself as one of the world's leading purveyors of high end thrills. Leclerq is blessed with enormous technical abilities, consistently turning out film that is simply gorgeous to look at, and combines his visual tool set with a knack for cranking up tension and building compelling characters in a manner few can match. And he brings his entire tool kit to bear on his riveting action thriller The Crew.\n\nSami Bouajila (best known to Fantastic Fest audiences as the lead in 2011's Carre Blanc) delivers a typically riveting performance here as Yanis, a bad man pitted against worse men as he works to save his friends and family from a situation of their own creation. Building around Bouajila's performance, Leclerq is smart enough to not attempt to reinvent the wheel here, leaving the core heist structure intact while bringing his own distinct flavor and style to the mix with explosive results. (Todd Brown)",
    "directors": [
        "Julien Leclercq"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-crew"
    },
    "runtime": 81,
    "synopsis": "It's bad men versus worse men as thieves face off against dealers in this super slick French heist thriller from the director of Chrysalis and The Assault.",
    "title": "The Crew",
    "year": 2015
}