{
    "countries": [
        "Canada"
    ],
    "description": "Sheriff Daniel Carter sits alone in his car on the side of a quiet road in the small town he serves, contemplating life's mysteries and cracking jokes over the radio with his dispatcher. It could be one of a thousand nights just like this. That is, until he's startled out of his boredom by a man stumbling out of the woods, crawling into the road. Carter takes the man to nearby Marsh County Memorial Hospital in what will turn out to be a spectacularly bad decision.\n\nOnce there, Carter has to contend with his ex Allison, the head nurse, and the pain that hangs palpably between them. Rounding out the characters are a colorful array of hospital staff and patients. But all hell breaks loose when Carter happens across an insane woman attacking a patient. When he goes out to his car to report the incident, he's attacked by a figure in a long white robe with a white hood bearing a black triangle. The figure is not alone and Carter rushes back to the hospital, where the group now finds themselves trapped. But they'll soon discover that the dangers waiting just outside the doors pale in comparison to what already lurks within the hospital itself.\n\nCo-writers and directors Jeremy Gillespie and Steven Kostanski, who also tag-teamed Father's Day and worked together on Manborg, return to Fantastic Fest with the perfect midnight movie. Drawing inspiration from the likes of Carpenter, Stuart Gordon and Lucio Fulci, Gillespie and Kostanski have taken their influences and crafted something wholly their own, a melting pot thrill ride centered on a mad scientist cult leader who's failed experiments have become actual monsters. Featuring gooey slime-covered practical effects and more than a few buckets of blood, The Void is a tense, action-packed crowd pleaser. (Luke Mullen)",
    "directors": [
        "Jeremy Gillespie"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-void"
    },
    "runtime": 90,
    "synopsis": "Trapped in a hospital with a handful of people, a small town sheriff finds himself caught up in the demented plot of a death-obsessed madman.",
    "title": "The Void",
    "year": 2017
}