{
    "countries": [
        "Ireland"
    ],
    "description": "Bromance can lead a lad to do some foolish things. That seems to be the guiding principal of Conor and Jock's relationship. Growing up poor with no prospects in Cork, the fifteen-year-olds have nothing but each other. And let's be honest; when all you have is someone as dim as either Jock or Conor, that's not saying all that much. Which, of course, leads to some generally foolish behavior.\n\nAn entrepreneur at heart, Jock's latest brilliant idea has literally washed in from the sea. Cornered by the Coast Guard and caught in rough waters, a boatload of drug runners have pitched more than sixty bales of cocaine into the choppy ocean, each of which is valued at more than four million Euro on the street. Surely the police can't have found them all, Jock reasons. And, hell, at fifteen, we're still considered young offenders. Even if caught, they can't do anything to us. Clearly the thing to do is steal a pair of bicycles, pedal the 160 kilometers to the shore and claim a bundle of that wondrous cocaine for themselves. Conor agrees this is a sensible plan. And off they go.\n\nUsing the actual largest drug bust in Irish history as his launching point, writer/director Peter Foott delivers an absolutely hysterical debut feature with THE YOUNG OFFENDERS. Playing like a sort of teen-oriented answer to the portrait of masculine foolishness in the KLOWN films, THE YOUNG OFFENDERS captures its lead characters in those awkward years when boys are foolish enough to believe the stupidest shit imaginable. The film itself is actually very intelligent while still being naïve enough about virtually everything in life to be really kind of sweet. An extreme comedy that loves its characters rather than mocking them, THE YOUNG OFFENDERS is simply one of the most promising debuts of the year. (Todd Brown)",
    "directors": [
        "Peter Foott"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-young-offenders"
    },
    "runtime": 84,
    "synopsis": "The day after the largest drug bust in Irish history, with massive packages of cocaine washing up along the shoreline, two go-nowhere teens make a most sensible decision: They will ride to the coast on stolen bicycles and claim a bundle of that wondrous cocaine for themselves.",
    "title": "The Young Offenders",
    "year": 2015
}