{
    "countries": [
        "Republic of Korea"
    ],
    "description": "A politician and his wife are dealt a blow when their teenage daughter vanishes in the days leading up to the local election. While her evasive father continues his campaign seemingly unfazed, Kim Min-jin's mother devotes herself to uncovering the truth about her daughter's abrupt disappearance. The more Yeon-hong immerses herself in the increasingly unsettling case, the more unraveled she becomes, and is soon faced with the sorrowful realization that her daughter's life is just as much a mystery as her disappearance.\n\nFrom director Lee Kyoung-mi comes THE TRUTH BENEATH, a new thriller that subverts genre expectations by slowly peeling back delicate, thoughtful layers to reveal how little we really know the people closest to us. Lee crafts a dramatic series of twists and turns that continue to escalate right up to the film's intense third act and surprisingly compelling conclusion. South Korea has given us some of the best horror and crime thrillers, but Lee's film defies assumption in its thoughtful approach to an elegantly twisted and tragic narrative. At the heart of this story, beyond its many startling turns, is the friendship between two misfit teenage girls who have been sadly, willfully misunderstood by their parents, their peers, and yes, even you. They also have a pretty amazing noise rock band, if you're into that sort of thing (and you are).\n\nJust when you think you know everything there is to know about South Korean thrillers, THE TRUTH BENEATH comes along to challenge those familiar ideas in ways you might not expect. (Britt Hayes)",
    "directors": [
        "LEE Kyoung-mi"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-truth-beneath"
    },
    "runtime": 103,
    "synopsis": "When a politician's teenage daughter goes missing, a desperate mother takes it upon herself to uncover the truth in this startling Korean thriller.",
    "title": "The Truth Beneath",
    "year": 2016
}