{
    "countries": [
        "Thailand"
    ],
    "description": "One day while hunting for food, a group of villagers dig into a giant bug nest and discover some mysterious elephant fireflies. A few eagerly eat the creatures while the others think it best to stick to their normal diets. Later, the villagers who decided to feast on the fireflies are stricken with painful glowing stomachs and foaming mouths. These symptoms are temporary, as the next phase of their sudden illness causes their heads to detach from their bodies, floating away along with their intestines. Now the remaining villagers must fight off the evil spirits who have one nefarious goal: munch butts.\n\nThe Dwarves Must Be Crazy makes its intentions known right off the batt, taking about two minutes to let loose the first blow of the slide-whistle. The message is clear: this is one movie about a village of little people in the jungles of Thailand that must defend themselves from evil spirits that want to lick, bite or otherwise violate their butts that is NOT to be taken seriously. And there's not a moment one would be inclined to do so, not with floating head-and-guts Krause spirits (the Thai counterpart to the Leyak in the equally confounding Mystics in Bali) displaying Tina Belcher-levels of butt obsession. Butt licking, butt biting, farting, pooping and anything else involving the rear-end is fair game.\n\nAs the villagers come up with more and more ridiculous ways to try to defeat the Krause and save their asses, things become increasingly chaotic and any concerns about tight narrative structure are completely abandoned. Throw in a love subplot complete with a romantic montage set to a song from Thailand's answer to Bonnie Tyler and you have the recipe for one of the most entertaining and delightfully bizarre films on this year's program. (Brian Kelley)",
    "directors": [
        "Bhin Banloerit"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-dwarves-must-be-crazy"
    },
    "runtime": 92,
    "synopsis": "A Thai village of little people is attacked by evil, butt-munching, fart-tracking Krause spirits - floating heads with attached intestines - in this slapstick horror-comedy.",
    "title": "The Dwarves Must Be Crazy",
    "year": 2016
}