{
    "countries": [
        "United States"
    ],
    "description": "With THE EYES OF MY MOTHER, first-time writer/director Nicolas Pesce has crafted a cool and collected character study that incorporates horrific elements without sensationalizing them, almost without acknowledging their brutality at all. It's rare to see a debut feature that feels so self-assured, especially one which strikes such an odd tone.\n\nThe story is relatively simple. After young Francisca witnesses a savage murder, her world is turned upside down. With the murderer caught but not killed, Fran calmly exacts a rather nightmarish vengeance. As her father becomes reclusive and withdrawn, Fran's skewed interpretations of family and friendship grow steadily more disturbing, leading to lethal consequences.\n\nWhat's truly fascinating is the way in which Pesce paints his main character, and the cold, detached performance given by lead actress Kika Magalhaes. Her decisions, her behavior, and even the way she speaks seem more alien than human. It's akin to watching the origin story of a young Patrick Bateman. It would be easy to point to the murder as the cause of Fran's later actions, but Olivia Bond plays young Fran with the same sort of eerie reticence, making you wonder if we were witness to a budding psychopath before the vicious murder even occurs.\n\nThe bold black and white photography adds to the starkness of the film and plays up the themes of isolation and loneliness inherent in the script. With a brisk running time under 80 minutes, the film is constantly moving as Fran is steadily evolving, trying in her own way to find love. A chilling yet strangely beautiful film, THE EYES OF MY MOTHER plays like a dark, blood-soaked poem. (Luke Mullen)",
    "directors": [
        "Nick Pesce"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-eyes-of-my-mother"
    },
    "runtime": 77,
    "synopsis": "After a traumatic event, a young girl begins to associate pain and death with love and friendship in increasingly dangerous ways.",
    "title": "The Eyes of My Mother",
    "year": 2016
}