{
    "countries": [
        "United States"
    ],
    "description": "The less you know about The Greasy Strangler, the better, as its humor really needs to be seen to be believed. But I can tell you that it's the most Fantastic Fest movie ever made. You could make an argument that at least half of the FF icons apply to the movie, but its Fantastic Fest roots go far beyond it content. The madman behind this movie, Jim Hosking, had his short Renegades play in Fantastic Fest in 2010 and he also contributed to 2014's entry The ABCs of Death 2. But interestingly the producing team behind The Greasy Strangler all came to know each other because of Fantastic Fest. All eight producers on the film met at Fantastic Fest: Tim League (founder), Ant Timpson (who produced multiple films that have played here), Ben Wheatley and Andy Starke from Rook Films (their debut film, Down Terrace, premiered at Fantastic and won the Next Wave award in 2000 and they've also played several subsequent films at the fest), Theo Brooks (co-produced Graceland, which played in 2012) and Josh Waller, Daniel Noah and Elijah Wood of Spectrevision (produced several films that have played at FF and gave the keynote at the Fantastic Market last year).\n\nAnt was a fan of Jim's script and convinced the other parties to come onboard. The desire by all was not just to support one of the craziest scripts they had ever read, but to work together to help a Fantastic Fest alumni take the next step in his career. It's likely that no other festival can provide the support needed to create a film both singular and utterly bizarre as The Greasy Strangler. It's not just a celebration of Jim's unique world, but what the best of Fantastic Fest can do when they work together. (James Emanuel Shapiro)",
    "directors": [
        "Jim Hosking"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-greasy-strangler"
    },
    "runtime": 93,
    "synopsis": "Brayden fears his first love affair is turning his father into a bloodthirsty monster who's covered in grease and has an 18-inch penis that looks like a dead chicken.",
    "title": "The Greasy Strangler",
    "year": 2015
}