{
    "countries": [
        "Italy"
    ],
    "description": "Selfish misanthrope Enzo lives a lonely life in his squalid Rome apartment, eating nothing but vanilla pudding, watching nothing but pornography and participating in petty crime whenever offers present themselves. But when Enzo accidentally steps into a barrel of radioactive waste while running from police, everything changes. Suddenly he has super strength. He can withstand great injuries. He heals at an accelerated rate. And he immediately uses these new powers to… rip out an ATM and carry it home.\n\nIf this sounds like a dubious origin for a new superhero, that's because Gabriele Mainetti's They Call Me Jeeg Robot is not your average tale of bravery and heroics. You won't find any spandex here. Instead, this Italian take on the genre offers a gritty, morally compromised version of a story that usually forgoes grime, sex and bloodshed. And yet all the hallmarks are here: Enzo battles goons, falls in love, earns a nemesis, and even finds himself with something approaching a costume. They Call Me Jeeg Robot may not look like a superhero film at first, but by the time the film ends it asserts itself as a vibrant new take on the genre.\n\nIn his feature debut, Mainetti delivers a film just as cool and fun as its Hollywood counterparts, while filling its edges with a myriad of unique details and diversions from the norm. The often repulsive Enzo will challenge your definition of what a \"hero\" can get away with, but this is no cynical condemnation of silly kids films. They Call Me Jeeg Robot explores the genre with a sincere, if occasionally twisted, beating heart and makes a strong case that you don't need a half-billion dollars to make a worthwhile superhero movie. (Evan Saathoff)",
    "directors": [
        "Gabriele Mainetti"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/they-call-me-jeeg-robot"
    },
    "runtime": 118,
    "synopsis": "A lowlife thug finds his grimy, pornography-filled existence disrupted when he accidentally acquires superpowers that force him to become a better man against his will.",
    "title": "They Call Me Jeeg Robot",
    "year": 2015
}