{
    "countries": [
        "Mexico"
    ],
    "description": "Somewhere within the ruined city, a young brother and sister discover an abandoned building. Inside lives a mysterious hermit who makes them an offer: food and shelter in exchange for labor. Although the hermit seems odd and dangerous, his offer is too good to deny. The pair accept and slowly start helping the man build a strange and mysterious room. As the trio spend their time together, they will find all their faiths tested and as new levels of pleasure and pain are slowly revealed, it's almost certain that nothing will ever be the same again for any one of them.\n\nWeird, beautiful, offensive, insane, aggressive, violent, over-explicit, astounding, funny – the list of adjectives that can be used to describe Emiliano Rocha Minter's debut can scroll to infinity. An all-out assault on the senses, We Are the Flesh brings back some of the experimental sensibilities of the '70s within a carefully and cleverly structured narrative. Taking the recent themes apparent within Mexican cinema to next level, Minter puts all his heart and soul on the screen to see, and the end result is likely to cause division, debate and utter enchantment within the audience.\n\nLove it or hate it, there's one thing certain: you will not be able to leave without picking sides once you witness the outrageous finale. Finally, a brilliant film to push all the provocative buttons. Accept the invitation and join us in celebrating all the pleasures and corruption of the flesh in this mind-melting blast of celluloid wonder! (Evrim Ersoy)",
    "directors": [
        "Emiliano Rocha Minter"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/we-are-the-flesh"
    },
    "runtime": 80,
    "synopsis": "Somewhere within a ruined city, a man makes an offer to a pair of siblings who wander into his abandoned building: food and shelter in exchange for building a strange room…",
    "title": "We Are the Flesh",
    "year": 2016
}