{
    "countries": [
        "United States"
    ],
    "description": "If you've ever wanted proof that the world is insane, you've found it.\n\nProduced and directed by Tom Hanson, who had previously owned a chain of Pizza Man restaurants, The Zodiac Killer was made with one goal in mind: to capture the real-life Zodiac Killer. That plan didn't work. Instead, we got the most outrageous and compelling \"tabloid horror\" vortex in the history of planet Earth. And beyond.\n\nDid you know that the Zodiac Killer wore Groucho Marx glasses while stalking his victims? Did you know that the Zodiac's pet rabbits commanded him to kill during black mass rituals? Did you also know that the Zodiac might have been a man named Grover who attempted to kidnap his daughter while brandishing a hand saw? You won't get insight like this by watching a David Fincher movie. But you WILL get it while watching The Zodiac Killer.\n\nBalancing cinéma vérité grimness with outta-this-world absurdity, this movie is an ultra-bizarro time capsule that features authentic recreations of the Zodiac's crimes contrasted with dialogue such as, \"Why are evil people allowed to live, but innocent rabbits must die?\" During theatrical screenings in San Francisco, Hanson and actors from the movie constructed in-theater \"traps\" to lure the killer from hiding. These included the use of an ice cream freezer filled with rent-a-cops and a raffle with a motorcycle as a prize. Because even the Zodiac needs to get around.\n\nAGFA is beyond excited to present a brand new 4K transfer of this crown jewel from the Something Weird archive, which was made possible by the 783 lovable perverts who donated to our Kickstarter campaign. At this screening, we'll be joined by Lisa Petrucci, the incomparable co-founder of Something Weird, in person!\n\nNext step: capture the Zodiac Killer. (Joe Ziemba)",
    "directors": [
        "Tom Hanson"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/zodiac-killer-presented-by-agfa-and-something-strange"
    },
    "runtime": 85,
    "synopsis": "AGFA and Something Weird present a brand new 4K transfer of this sanity-defying, tabloid-horror vortex that was produced with one goal in mind: to capture the real-life Zodiac Killer.",
    "title": "Zodiac Killer - Presented by Agfa and Something Weird",
    "year": 1971
}