{
    "countries": [
        "Germany",
        "France",
        "Russian Federation"
    ],
    "description": "From Russia comes a truly delightful, surprisingly poignant discovery: Zoology, a familiar coming-of-late-age story told from a wholly unique point of view. Director Ivan I. Tverdovskiy's sophomore effort centers on Natasha, a repressed introvert working a monotonous administrative job for a local zoo in her small coastal town. Still living at home with her mother, Natasha feels woefully insecure and often invisible, when she's not being repulsively bullied by her obnoxious coworkers.\n\nFollowing an abrupt and seemingly benign incident, Natasha's life becomes a lot more interesting when she mysteriously grows a tail. Her new appendage is a brilliant symbol not only for the difficulties of living with a disability, but of the female experience in all its singular sorrow. Natasha's insecurities are exacerbated at first, but she gradually comes to embrace the new addition to her life, which transforms her into a more confident person, and even attracts the affections of a handsome doctor. But not everyone feels the same, and the local gossip grows increasingly superstitious as Natasha finds that the very thing that finally makes her feel so special is both a blessing and a curse.\n\nTo say Zoology is Grey Gardens by way of Ginger Snaps and Wetlands (which it sort of is) feels a bit reductive. Tverdovskiy's film certainly has recognizable elements, but Zoology approaches the beauty and tragedy of self-discovery and actualization in a way that feels different and new. Although this is the story of a woman with a tail, it's surprisingly nuanced and painfully relatable. And completely devoid of nauseating whimsy. (Britt Hayes)",
    "directors": [
        "Ivan I. Tverdovsky"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/zoology"
    },
    "runtime": 87,
    "synopsis": "Natasha is a lonely, middle-aged woman who still lives with her mother and feels insecure about her tedious life… until she grows a tail.",
    "title": "Zoology",
    "year": 2016
}