{
    "countries": [
        "United Kingdom"
    ],
    "description": "Director Ben Wheatley LIVE in attendance!\n\n\nBen Wheatley is both one of Fantastic Fest's most cherished sons and one of the world's most exciting filmmakers. Ben's wonderful work was launched into the world in 2009 with an FF world premiere when his debut film about a dysfunctional crime family, DOWN TERRACE, played through the roof and subsequently won the Next Wave award. He followed that up in 2011 with his thriller KILL LIST, which debuted at SXFantastic. It delighted the audience and sparked a distribution bidding war that emptied scotch bottles and shattered dreams. His next film, the black comedy SIGHTSEERS, didn't debut at Fantastic Fest but the Alamo crew was at the crowded Cannes premiere and joined the bidding war for distribution; more scotch, more broken hearts. In fact, the film may or may not have secretly played at the fest last year. Finally, don't forget Ben's memorable horror segment in Alamo's first production, THE ABCs OF DEATH. With A FIELD IN ENGLAND, Wheatley and his producer Andy Starke return to Fantastic Fest with their bravest and most astonishing film yet.\n\n\nIf you ask Ben what A FIELD IN ENGLAND is about,  and if he's being friendly, he will simply be vague. He's compelled first and foremost to recreate a setting where science isn't driven by hypothesis and data, or by measurements and experiments. He's establishing a world where wonder and the unknown were explained by the miracle of imagination. It's a magnificent place to be, as what you're seeing, hearing and experiencing is only limited by where you allow your mind to go. (James Shapiro)",
    "directors": [
        "Ben Wheatley"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/a-field-in-england"
    },
    "runtime": 90,
    "synopsis": "During the British Civil War, when magic was science, an alchemist forces a group of deserters to help him locate buried treasure, and sends them all straight into the mouth of madness.",
    "title": "A Field in England",
    "year": 2013
}