{
    "countries": [
        "United States"
    ],
    "description": "Producers Brian Udovich and Keith Calder LIVE IN attendance!\n\nJust one short summer after a tragic accident shattered her friendship with outcast Emmet, Mandy Lane (Amber Heard) has blossomed into a gorgeous young woman, popular with both boys and girls, and a track star at her high school. She remains shy and reserved, easily brushing off the not-so-subtle advances of her sexually charged classmates. It takes some convincing to get her to agree to join her new friends for a weekend party on a ranch. She gives in and the beer and drugs flow freely. All the while, she must dodge the guys vying for the chance to be the famous Mandy Lane's first, the shallow girls threatened by her perfection and a hooded killer who has stopped by to take out the teens one by one.\n\nJonathan Levine's debut feature is a clever mix of sex-fueled high school drama and bloody slasher. The character dynamics feel real, the group of teens and their friendships hanging in a balance forever threatened by dormant resentments and jealousies, their relationships increasingly strained by the dubious foundations on which they were built. More importantly, all of them are potential victims for an unknown villain, their bodies threatened by knives and shotguns and other implements of death. As the corpses pile up, stakes are raised, surprises are revealed and one starts to wonder if everyone truly does love Mandy Lane. It's an incredibly well-crafted first feature and a deviously fun horror film, one we are excited to finally bring to Fantastic Fest. (Brian Kelley)",
    "directors": [
        "Jonathan Levine"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/all-the-boys-love-mandy-lane"
    },
    "runtime": 98,
    "synopsis": "All the boys love Mandy Lane and all the girls want to be her. There's at least one person, though, that wants Mandy and her friends dead.",
    "title": "All the Boys Love Mandy Lane",
    "year": 2006
}