{
    "countries": [
        "United States"
    ],
    "description": "Writer/Director Jeremy Saulnier, Producer Anish Savjani, and lead actor Macon Blair LIVE in attendance!\n\nDwight is an utterly ruined man. His life, in most respects, ended years ago on the day a man came to his family home and commited an atrocious, murderous act. Dwight has lived rough in the years since, checked out from society and kept to himself, sleeping in his car and making due with the bare essentials. But that all changes the moment Dwight learns that the killer is being released from prison, that simple fact giving him razor sharp focus. Dwight will find the killer and he will take his revenge. But what Dwight has overlooked with his tunnel vision is that just as he had a family himself, the killer still has one. And once certain lines are crossed the only possible end is more blood.\n\nWriter-director Jeremy Saulnier first came to attention back in 2007 with his debut feature MURDER PARTY. And while that film certainly marked Saulnier —along with his leading man Macon Blair—as a talent to watch, it certainly never hinted at the levels reached in his brilliant sophomore outing.\n\nAnchored by a tour-de-force performance from the brilliantly understated Blair as Dwight, BLUE RUIN is a potent reminder of the vibrancy that still exists, tucked away in corners of the American indie scene. Owing nothing at all to the aesthetic of the '80s, '90s or '00s, this is a beautifully written, character driven revenge piece grounded in the anti-heroes of the 1970s, but given a deeply resonant heart. Blair is absolutely astounding, his performance as Dwight exactly the sort of thing that deserves attention at awards time, but which will likely be overlooked because this film is so far away from what the studios are selling. A new American classic? It may very well be. (Todd Brown)",
    "directors": [
        "Jeremy Saulnier"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/blue-ruin"
    },
    "runtime": 90,
    "synopsis": "A classic American revenge story, Blue Ruin follows a mysterious outsider whose quiet life is turned upside down when he returns to his childhood home to carry out an act of vengeance. Proving himself an amateur assassin, he winds up in a brutal fight to protect his estranged family.",
    "title": "Blue Ruin",
    "year": 2013
}