{
    "countries": [
        "Netherlands"
    ],
    "description": "Three armed men, one of them a priest, are out hunting in the woods. Their prey is not sport, but Camiel Borgman, a dirty and unshaven, frail man who sleeps in a makeshift underground bunker below their feet. They seem to know he is underground. They stab the earth with a large metal spear. He barely escapes.\n\nBorgman arrives at Marina and Richard's home. He asks for a bath. He tells Richard he knows his wife. Richard beats him out of jealousy. He later sneaks into their house and is given refuge by Marina. She treats his wounds, feeds him and bathes him. Borgman has installed his presence in the house and her world of plenty begins to crumble. Her reality and her emotions are at the mercy of the stranger in the house, while her husband haunts her dreams at night in the shape of a cruel monster. Two emaciated dogs slink through the house. Borgman tells the children there a story about a white child that floats above the clouds. There are flashes of something evil in the garden. The time has come!\n\nIf BORGMAN is your first introduction to the cinema of Alex van Warmerdam, then welcome and be prepared for a wonderful world where sinister darkness and delight are given equal footing, and his trademark adult fable style has been perfected here. With BORGMAN, the first Dutch film in competition at Cannes in 40 years, van Warmerdam wanted to show that \"evil comes in everyday form, embodied within ordinary, normal, polite men and women who perform their tasks with pride and pleasure, and with ruthless attention to detail. I wanted to show that evil is enacted not just on cold winter nights, but in the optimistic summer, beneath a warm and comforting sun.\" (James Shapiro)",
    "directors": [
        "Alex van Warmerdam"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/borgman"
    },
    "runtime": 113,
    "synopsis": "Something wicked this way comes in the form of the ordinary, the polite and the normal as a drifter and his followers invade the home of a bourgeois family.",
    "title": "Borgman",
    "year": 2013
}