{
    "countries": [
        "Lao People's Democratic Republic"
    ],
    "description": "Director Mattie Do LIVE in attendance!\n\nBeautiful young Chanthaly has scarcely experienced life outside the walls of her family home. Stricken with the same heart condition that claimed the life of her mother while in childbirth, Chanthaly is a fragile creature watched by her overprotective father. And though he means well, Chanthaly chafes against her father's restrictions as any young woman would.\n\nChanthaly's relationship with her father would be normal, except for one thing. Chanthaly has begun to have visions of her dead mother; begun to experience vivid flashbacks of memories she should not have. Her mother died in childbirth, after all, so Chanthaly cannot possibly remember her face. Or has her father been lying this entire time?\n\nThere are two possibilities. Either Chanthaly's father has been lying to her for her entire life and her mother is now reaching out from beyond the grave, or the \"memories\" are nothing but hallucinations brought on as side effects of her powerful medication. Chanthaly must choose, with her own health lying in the balance.\n\nMattie Do's Chanthaly is a different sort of ghost story, a slow burning debut that represents the first feature film ever directed by a woman in Laos, and also the first ever horror picture in the history of a nation that is still under Marxist rule and therefore officially disavows the presence of ghosts or, indeed, anything supernatural at all. The tension between past and present, between parents and children, science and tradition all factor in large here with the limitations of all building to a tragic conclusion.(Todd Brown)",
    "directors": [
        "Mattie Do"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/chanthaly"
    },
    "runtime": 98,
    "synopsis": "A sickly young woman experiences visions of her dead mother. She struggles to determine if the apparition is simply a side effect of her daily medication, or her mother actually reaching out to her from beyond the grave.",
    "title": "Chanthaly",
    "year": 2013
}