{
    "countries": [
        "United States"
    ],
    "description": "Director Evan Katz, Eecutive Producer Gena Wilbur, Producer Travis Stevens and cast members Pat Healy,David Koechner and Ethan Embry LIVE in attendance!\n\n\nIn this directorial debut from E.L. Katz and winner of the SXSW '13 \"Midnighters Audience Award,\" Pat Healy (THE INNKEEPERS; COMPLIANCE) stars as Craig, a newly out-of-work father who's months behind in his rent. In an effort to avoid going home to shamefully face his wife, he heads to a local dive bar and runs into Vince (Ethan Embry), his best friend from high school, now a rough character who makes his money as a debt collector. They discuss their common woes and after one drink, Craig prepares to leave the bar, but is roped into a round of booze with a peculiar wealthy couple; Colin (David Koechner, ANCHORMAN), a perpetually young 40-something wanting to celebrate his beautiful wife Violet's (Sara Paxton, THE INNKEEPERS) birthday.\n\n\nBefore they know it, they've drank the most expensive bottle of tequila at the bar. In order to amuse themselves, Colin engages them all in a series of innocuous bar bets and challenges. A game, just to keep the night lively, with each challenge increasing in both money and outrageousness. After being knocked out in a fight at a strip club parking lot for something he didn't even do, Craig wakes in Colin and Violet's lavish home, where the group has relocated the party. While scoping out the stylish house, Vince discovers a safe filled with cash and ropes a hesitant Craig into a plan to rob them. It seems like an easy task, but there's more to this couple than meets the eye…. Over the next few hours Craig and Vince are going to learn just how far they're willing to go for money and CHEAP THRILLS.",
    "directors": [
        "E.L. Katz"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/cheap-thrills"
    },
    "runtime": 85,
    "synopsis": "A recently fired father facing eviction is paid to take on an escalating series of insane challenges from a rich couple with a twisted sense of humor.",
    "title": "Cheap Thrills",
    "year": 2013
}