{
    "countries": [
        "United States"
    ],
    "description": "Writer/Director James Byrkit, Producer Lene Bausager, Executive Producer Alyssa Byrkit, Co-writer/Actor Alex Manugian, and Actors Emily Foxler, Hugo Armstrong, and Maury Sterling LIVE in attendance!\n\nOn the night that Miller's comet is supposed to pass near the Earth, a group of old friends get together for dinner at the home of hosts Lee and Mike.  Lee works for Skype while Mike is an actor, desperately trying to find new roles and hoping he didn't peak with his appearance as a series regular on the TV series \"Roswell.\" They are joined by power couple Hugh and Beth, each with very different perspectives on science and reality.  Then there's Emily and Kevin, still figuring each other out.  Em is passionate and creative but worried about making the wrong move, while Kevin is a go-getter, chasing what he wants. Finally there's Amir, the lovable bachelor with his squeeze-of-the-week  Laurie, a confident vixen who just happens to have a steamy past with Kevin. Dinner is cut short when the lights go out across the neighborhood, leaving only one strange house with power down the street.\n\nWhat starts as a simple dinner party, quickly turns into a sci-fi meltdown. When Hugh and Amir come back from checking out the illuminated house, Hugh is bleeding from the head and Amir is carrying a locked metal box.  While the group tries to decipher the meaning of the box and its contents, tension rises and emotions get heated.  Another party is dispatched to the strange house only to discover an even stranger phenomenon.\n\nCOHERENCE is cerebral low-budget sci-fi that dives headfirst into a pool of quantum mechanics and theoretical physics. It's a tightly focused, intimately shot film that quickly ratchets up the tension and mystery. COHERENCE is relationship drama turned on its head, giving you plenty to think about without spoon-feeding you any answers. (Luke Mullen)",
    "directors": [
        "James Ward Byrkit"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/coherence"
    },
    "runtime": 89,
    "synopsis": "On the night a comet is passing near Earth, a dinner party takes an odd turn. When the power goes out, eight friends discover that the only house on the street left with power also holds many secrets.",
    "title": "Coherence",
    "year": 2013
}