{
    "runtime": 120,
    "title": "Commando - a One Man Army",
    "year": 2013,
    "directors": [
        "Dilip Ghosh"
    ],
    "countries": [
        "India"
    ],
    "description": "A highly trained living weapon, Vidyut Jamwal is Karanvir Dogra - the titular Commando in Dilip Ghosh's hugely entertaining debut film. Dogra has been betrayed by his country and is out for justice, but first there's a beautiful woman to save, a milky-eyed villain to defeat, and perhaps some time for a dance or two?\n\nLarger than life in every possible way, COMMANDO is a deliriously unlikely blend of classic 1980s beefcake cinema tropes (complete with hilarious one-liners and regular doses of ultra violence), ONG BAK-style all-natural martial arts and good old fashioned Bollywood song and dance. And while it may seem a surprising combination, director Ghosh has recognized the inherent theatricality common to all three styles and - with the help of his hugely charismatic leading man - wedded them into a blast of pure entertainment.\n\nThough Jaideep Alawat gives him a run for his money as scenery chewing villain AK-47, COMMANDO belongs start-to-finish to leading man Vidyut Jamwal whose combination of fashion model good looks, raw power and jaw-dropping martial arts skills marks him as a major international star in the making. Like MANDRILL lead Marko Zaror, Jamwal is a hulking specimen of a man who moves in ways that seem to defy physics. He is simply far faster and more agile than should be possible and, like the best of the new breed action stars - Zaror, Tony Jaa, Johnny Nguyen and Iko Uwais among them - Jamwal executes all of his own fights and stunt work without any wire or CGI assist. So bring your dancing shoes and prepare for a punch in the face. Jamwal is the real deal. (Todd Brown)",
    "synopsis": "Singing! Dancing! Extreme violence and goofy one-liners from Bollywood's answer to Tony Jaa and Marko Zaror! If Cannon Films were to relocate to India, COMMANDO would be the result!"
}