{
    "countries": [
        "Norway"
    ],
    "description": "Director Bård Breien, Actor Svein André Hofsø, and Producers Asle Vatn and Pål Røed LIVE in attendance!\n\n\nRobert Bogerud has all the signifiers of a private eye: a trench coat, a hat cocked over his forehead and a cigarette dangling from his lips. He also has Down Syndrome. DETECTIVE DOWNS weaves a twisty noir tale complete with femme fatales, shocking conspiracies, stunning betrayals and a headstrong hero who will do anything to get to the bottom of his case.\n\n\nWhen a famed speedskater (and notorious con artist) disappears, his family hires Robert to investigate because they simply don't want the victim found. But it turns out that Robert's special method—using his immense empathy to discover the missing man's secret life, which involves penis pumps, cross dressing and fetish models—is the key to the case.\n\n\nDETECTIVE DOWNS skillfully sidesteps both exploitation and schmaltz, largely thanks to the soulful and sweet performance by Svein André Hofsø Myhre as Robert. And Myhre isn't just a fine actor, he's a great hoofer as shown in one of the most unexpected dance scenes this year. Short and adorable, it's easy to see Robert as childlike, but the movie never condescends. It treats him like the grown man he is, complete with a grown man's sexual urges.\n\n\nDETECTIVE DOWNS maintains noir cred while giving us one of the most unique and likable P.I. protagonists in movie history. Make room, Sam Spade and Jef Costello; Robert Bogerud has joined the club. (Devin Faraci)",
    "directors": [
        "Bård Breien"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/detective-downs"
    },
    "runtime": 90,
    "synopsis": "What makes Robert a unique P.I. isn't that he has Down Syndrome; it's that he uses empathy to solve his cases. And empathy will come in handy as he investigates a complicated, conspiracy-laden disappearance.",
    "title": "Detective Downs",
    "year": 2013
}