{
    "countries": [
        "India"
    ],
    "description": "Nani is a simple, sweet guy in love with Bindhu, a micro-artist and the head of a non-profit organization. Unfortunately for Nani, local real estate and construction magnate Sudeep is also smitten with Bindhu. Sudeep usually gets what he wants, and in this case he's not going to let Bindhu get away. The only way to make that happen is to get rid of Nani, but killing him doesn't quite get the job done. Reincarnated as a fly, Nani plots and executes his revenge with spectacular flair. Can a fly really take out a human? You will believe after witnessing the insanity of EEGA.\n\nIn one gobsmackingly executed action set piece after another, EEGA lays down the gauntlet for fantastic cinema and loudly declares that India does crazy like no one else. All of the elements of mainstream Indian films are present - love story, over-the-top action and violence, big production numbers, and heartbreaking melodrama - and EEGA brings them together in a story that will tug at your heartstrings as you root for the little fly that just wants bloody revenge and his girl back.\n\nDirector SS Rajamouli is a visionary artist with a string of major blockbusters under his belt, but nothing with the ambition of EEGA. This is his magnum opus, and the film that will introduce him to the world. Somewhere between DIE HARD, THE FAST AND THE FURIOUS, FINAL DESTINATION, and GHOST is EEGA. With the black and white morality of an old western, Rajamouli shows us that love really does conquer all, for all creatures, great and small. (Josh Hurtado)",
    "directors": [
        "SriSaila Sri Rajamouli"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/eega"
    },
    "runtime": 107,
    "synopsis": "A murdered man reincarnates as a fly to wreak vengeance on the villain who took his life and his lover. EEGA is an inventive, insane take on a revenge story unlike anything you've seen before.",
    "title": "Eega",
    "year": 2012
}