{
    "countries": [
        "Spain"
    ],
    "description": "Director Eugenio Mira, Actors Elijah Wood, Alex Winter and Don McManus, Producers Adrián Guerra and Núria Valls LIVE in attendance!\n\nTaking a page out of the book of incredible film history feats like HIGH NOON, the bulk of the movie takes place in near-real time over the course of a high stakes classical music concert. It's here that our hero makes his long-awaited return to performing after being stricken with stage fright at a show five years ago. Lured by the chance to honor his long-time instructor in a program showcasing some of his hardest works, the reluctant musician accepts the concert, knowing full on that it means tackling the infamous \"unplayable piece.\" The lights go down and the concert begins with a few warm up selections, but something strange is happening inside the score on the piano. As the pages are turned, text begins to appear, defining a very clear threat – \"Play a wrong note and you die.\"\n\nCompletely owning the lunacy of the film's plot, FF favorite Eugenio Mira directs his third feature with incredible cinematic flair. Borrowing from a great bevy of film references belonging to everyone from Hitchcock to Polanski, Mira provides a fast-paced, edge-of-your-seat visual feast of pure popcorn entertainment. Leaving behind the sweeping romantic period stylings of his previous feature AGNOSIA, he creates a new kind of lush world, one with a classy, but contemporary feel. Rounded out by performances from recognizable faces like Kerry Bishé and Alex Winter, the stellar cast is playfully enjoying the ride. About as much fun as you will have at the movies this year, GRAND PIANO is a pitch-perfect thriller that pulls out all the stops. (Michael Lerman)",
    "directors": [
        "Eugenio Mira"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/grand-piano"
    },
    "runtime": 90,
    "synopsis": "A renowned concert pianist (Elijah Wood) returns to the stage for one final performance, only to become the target of a sadistic cat-and-mouse game with a faceless sniper (John Cusack).",
    "title": "Grand Piano",
    "year": 2013
}