{
    "countries": [
        "Mexico",
        "Netherlands"
    ],
    "description": "Director Sebastian Hofmann LIVE in attendance!\n\nBeto has his fair share of problems. He has oozing lesions all over his body, maggots infest his wounds and he must inject himself with embalming fluid just to keep moving. It's no wonder he watches longingly as people exercise their able, undiseased bodies at the gym where he works a security guard. While they strive to improve their physical selves, it's all Beto can do to maintain some sort of presence in his increasingly isolated world. When he quits his job because he's unable to hide his accelerating sickness, his boss Luly takes a sudden interest in him. Though he's embarrassed to do so, he allows her to penetrate his loneliness and grants himself one last glimpse of a life where his body hasn't completely fallen apart.\n\nDirector Sebastian Hofmann's feature film debut is a stunning mixture of grotesque banality and beautiful meditation on the disturbing loss of self that comes with death. Tropes tried and true are subverted in ways that repurpose the impact of familiar horror conventions so that they are both negated and intensified. Alluringly lethargic and containing scant dialogue, HALLEY traps viewers inside Beto's grisly life (or afterlife, as it were), a challenging yet consistently compelling experience.\n\nThe power of the film lies as much in the impressive performance of Alberto Trujillo as it does with Hoffman's unflinching camera. Without Trujillo, Beto wouldn't draw the strong and sometimes confusing audience sympathies needed for the film to avoid becoming simply gross body horror. Fortunately for us, the elements combine to make HALLEY a truly unique, dramatic and downright disturbing entry in the Fantastic Fest lineup. (Brian Kelley)",
    "directors": [
        "Sebastian Hofmann"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/halley"
    },
    "runtime": 83,
    "synopsis": "Though Beto's life may technically be over, he allows himself to experience it one last time before his body completely falls apart in this unique and contemplative horror film.",
    "title": "Halley",
    "year": 2013
}