{
    "countries": [
        "Japan"
    ],
    "description": "Aside from his unusual parentage, Kyosuke Shikijo is just like everybody else. Or at least he would like to be. He struggles to be accepted by his peers. He can't seem to make an impression on the girl he likes. He is ordinary. Average. Nondescript, even. But then everything changes… Aiko, the object of Kyosuke's desire, is taken hostage by robbers and he acts to save her. But when reaching for a mask to cover his identity, he mistakenly grabs a pair of used women's panties and the odor triggers a strange reaction, the thirst for justice imparted by his father's policeman genes mingling with the perversion of his mother's dominatrix genes, transforming him into a new superhero. The Hentai Kamen (Pervert Mask) is born!\n\nWriter-director Yuichi Fukuda (whose KID'S POLICE is also screening at the festival) tackles the popular cult manga with hilarious results, the scantily clad—and incredibly buff—hero subduing his opponents through a series of outlandishly sexualized wrestling poses that invariably end with his scrotum pressed against the villain's face. Yes, it's one joke that gets repeated a lot but it's a DAMN FUNNY JOKE and Fukuda works it for everything its worth.\n\nLeading man Ryohei Suzuki—who also stars in the big budget hero flick GATCHAMAN, thereby providing your moment of cognitive disconnect for the day—is utterly fearless and brings a surprising sense of gravity to the part. Kyosuke's debilitating fear is that he might actually be normal, and his awkwardness around Aiko provides a sincere charm that elevates the film above its supremely trashy origins. A crowd pleaser that took the New York Asian Film Festival's Audience Award, HK is not to be missed. (Todd Brown)",
    "directors": [
        "Yuichi Fukuda"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/hk-forbidden-super-hero"
    },
    "runtime": 105,
    "synopsis": "A new hero has arisen in Japan: One with fishnet stockings, a mankini, and a pair of women's panties over his face. When conventional justice fails, make way for the Hentai Kamen.",
    "title": "Hentai Kamen: Forbidden Super Hero",
    "year": 2013
}