{
    "countries": [
        "Japan"
    ],
    "description": "In the annals of crime, there have been few organizations quite so evil, quite so pernicious as the dastardly Red Venus. Always plotting on a grand scale, always performing acts of evil and violence to build their own power, Red Venus operates in the shadows - seemingly able to strike anywhere without notice before disappearing with only their signature business card left behind as a demeaning taunt to law and order.\n\n\nTo counter the threat of Red Venus, the Tokyo Police have formed their own special task force - a team of the best and brightest. The only team with the skills and fortitude to bring the evil syndicate to its knees. Unfortunately, this force has been rendered very, very young by a gas that has reverted them all back to a childhood state. No matter. They're still on the job. They may be back in primary school but the Kid's Police will get the job done.\n\n\nA feature film extension of the cult hit television series he also wrote and directed, Yuichi Fukuda's KID'S POLICE is a hysterical oddity - a film that oozes vintage 1970s hard boiled crime style... but for the fact that the tough-as-nails cop with big hair wielding a shotgun in a natty, tailored suit is a ten-year-old kid. Fukuda's commitment to his very silly concept is absolute, the style completely deadpan, and the result is a hysterically funny spoof of every hard-ass cop movie ever made, and also a remarkably well made movie in its own right. Following many very prolific years working as a television writer and director, Fukuda here makes a major move on to the world stage as a truly unique feature talent. (Todd Brown)",
    "directors": [
        "Yuichi Fukuda"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/kids-police"
    },
    "runtime": 100,
    "synopsis": "When evil criminal organization Red Venus strikes, there's only one team of highly specialized cops who can help. Unfortunately, they've been dosed with anti-aging gas that has turned them all into children.",
    "title": "Kid's Police",
    "year": 2013
}