{
    "countries": [
        "Sweden"
    ],
    "description": "Director Antonio Tublén, Producers Alexander Brøndsted and Fredric Ollerstam, and Actors Patrik Karlson and Izabella jo Tschig LIVE in attendance!\n\n\nRobert lives a solitary and lonely life. His sneering wife and disdainful son drive him into his own head and the secure comforts of his basement lair where he pursues his private experiments with audio frequencies. It's all harmless curiosity until one day he has an unexpected success, stumbling across a frequency that appears to open the human mind wide to hypnotic suggestions. Play the sound, say what you want, and watch it happen. And what Robert wants is to be friends - and perhaps more - with his new neighbours.\n\n\nA clever, totally lo-fi science fiction dramedy from award-winning director Antonio Tublen (ORIGINAL), LFO is a film that delights in a good idea executed well. What would happen if a quiet, lonely man were suddenly granted complete control over others? Probably something a lot like what happens here, with Robert's ambitions scarcely extending beyond the walls of his own home as his initial excitement over scientific discovery quickly gives way to more base instincts. We quickly learn that while Robert may be able to control others, he is not so good at controlling himself.\n\n\nTublen's script showcases the same dry wit that made his debut a hit on the international festival circuit while his gifted ensemble delivers quality performances across the board. LFO is a sterling entry into the ongoing new wave of indie science fiction, films that prove you don't necessarily need big budgets to bring big ideas to life, provided you have a sure voice and a good dose of talent. (Todd Brown)",
    "directors": [
        "Antonio Tublén"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/lfo"
    },
    "runtime": 94,
    "synopsis": "A solitary man discovers audio frequencies that open the human mind wide to hypnotic suggestion and, ultimately, his total control in this slyly deadpan dark comedy from Sweden.",
    "title": "Lfo",
    "year": 2013
}