{
    "countries": [
        "Japan"
    ],
    "description": "Every boy needs a goal, an organizing principle to provide structure and focus to their life. And Katsuya Maruyama has one. Oh, yes, this middle school student has a doozy of a goal. Though prone to daydreams and flights of extreme fancy, Maruyama is focused on one overriding desire he is determined to attain. When he wakes, he stretches. Before sleeping, he stretches. At every available opportunity in between... more stretches. Why? Because Maruyama is determined that one day he will be flexible enough to lick his own penis.\n\n\nAnd things are going well for Maruyama—though he should perhaps consider that the cracking and popping sound that precedes his more vividly fantastic visions may indicate that he's doing serious damage to his spine. But one day a strange new neighbor moves into the apartment complex, a single father who appears to know all about Maruyama's secret goal and may threaten the youth with exposure. Also, there's the dead body that turns up nearby.\n\n\nFrom the fertile imagination of writer-director Kankuro Kudo—writer of Takashi Miike's ZEBRAMAN among many others—comes MARUYAMA THE MIDDLE SCHOOLER, a film that not only pokes deliriously accurate fun at the psyche of the adolescent male, but actually grows beyond its already hysterical premise to deliver a gloriously demented, multi-layered portrait of Maruyama's entire apartment complex. Because you know what they say about kids learning from their environment … if Maruyama is this odd surely there must be more strangeness to be found nearby. Deeply funny, constantly surprising, and unexpectedly heartfelt, MARUYAMA THE MIDDLE SCHOOLER is arguably the crowning moment to date in what has already been a sterling career from Kudo. (Todd Brown)",
    "directors": [
        "Kankuro Kudo"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/maruyama-the-middle-schooler"
    },
    "runtime": 119,
    "synopsis": "A middle school student prone to wild daydreams devotes his waking hours to stretching and flexibility exercises with the ultimate goal of one day being able to lick his own penis.",
    "title": "Maruyama the Middle Schooler",
    "year": 2013
}