{
    "countries": [
        "United Kingdom"
    ],
    "description": "Director John Lundberg, Co-Director Roland Denning, and Writer Mark Pilkington LIVE in attendance!\n\nIn the 1980s, a scientist and entrepreneur named Paul Bennewitz made what was—at least to him—a shocking discovery. Using powerful testing equipment, he learned that the U.S. government was conducting secret UFO research at Kirtland Air Force Base in Albuquerque, New Mexico. After reaching out to the Air Force, Bennewitz was contacted by special agent Richard C. Doty. The Air Force determined that Bennewitz uncovered classified—and purely terrestrial—projects. Doty's job was to put an end to the snooping. He convinced Bennewitz that his discoveries were related to secret government UFO research. Doty's disinfo campaign literally drove Bennewitz crazy and planted the seeds of several UFO myths that still persist in popular culture.\n\nMIRAGE MEN, which is based on a book of the same name by Mark Pilkington, explores the government's UFO disinformation. Numerous people are interviewed, including Bennewitz's associates, former government officials like Doty, various figures in the UFO movement (e.g. William Moore, Linda Moulton Howe), UFO enthusiasts, and eyewitnesses. MIRAGE MEN isn't a standard talking heads documentary. All voices are given equal weight. Seemingly reasonable assertions are presented side-by-side with bizarre statements that defy credulity. The interviews are expertly woven together with a judicious smattering of public domain footage to create a mind-bending narrative that seems designed to both confound and provoke. Who is telling the truth? Who is lying? Who knows? Interviewee Linda Moulton Howe calls the quest to unravel the truth behind government involvement in UFOs is like a \"fractured hall of mirrors with a quicksand floor.\" The same can be said of MIRAGE MEN. (Rodney Perkins)",
    "directors": [
        "John Lundberg",
        "Kypros Kyprianou",
        "Roland Denning",
        "Mark Pilkington"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/mirage-men"
    },
    "runtime": 85,
    "synopsis": "A mind-scrambling documentary that posits that popular myths about the existence of UFOs originated from a disinformation campaign by the U.S. government.",
    "title": "Mirage Men",
    "year": 2013
}