{
    "countries": [
        "Japan"
    ],
    "description": "A doctor and his family receive an unexpected delivery from an old friend at their remote country home - a large wooden crate containing a gun, a female zombie and an instruction sheet telling them not to feed her meat. The family is concerned, of course, but she seems harmless enough. Perhaps she can help clean up outside?\n\nWelcome to the unusual world of MISS ZOMBIE, a world in which the zombie virus is clearly a well-known phenomenon and in which more docile sufferers are bought and sold to hobbyists or those looking for cheap labor. It's a practice not without controversy – the neighbors aren't thrilled about the newly arrived undead – but she's quiet, requires little supervision and is an immediate hit with the family's young son.\n\nAfter a ten year span spent working as a director-for-hire on big budget studio projects, cult favorite director Sabu returns to the sort of quirky, idiosyncratic, totally original fare that made him such a hit with audiences around the world in the first place. Arguably the most human and sympathetic zombie film ever made, MISS ZOMBIE finds a rich emotional core to its undead lead – played remarkably by Ayaka Komatsu – with the writer-director finding angles and nuance to the experience of undeath never really touched upon before. Shot through with both melancholy and bursts of drily absurd humor, MISS ZOMBIE is both bitingly intelligent and deeply heartfelt and – yes, you longtime fans – it features one of Sabu's signature very slow chase scenes. This is a high point in an already impressive filmography. (Todd Brown)",
    "directors": [
        "SABU"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/miss-zombie"
    },
    "runtime": 85,
    "synopsis": "Cult director Sabu returns with his first original story in a decade! When a family has a zombie unexpectedly delivered to their house, they decide to keep her as a domestic servant.",
    "title": "Miss Zombie",
    "year": 2013
}