{
    "countries": [
        "United States"
    ],
    "description": "Director Shaul Schwarz LIVE in attendance!\n\nNARCO CULTURA is a surreal and tragic documentary that compares and contrasts the lives of people dealing with mass drug terror in Mexico with the lives of musicians who document—and arguably exploit—the terror. Since 2006, the drug war has claimed at least 10,000 lives. Cities like Juarez are literally under siege by narco criminals. People, including politicians and police, are randomly kidnapped. Many disappear forever. Those who are found are often dismembered, decapitated or mutilated. Most people see the drug gangs as villains, but some view them as romantic figures worthy of admiration and praise.\n\nThe cultural elevation of narco criminals into heroes manifests itself most prominently in a style of music known as narcocorridos (drug ballads). These catchy polka-inflected tunes feature lyrics from the drug dealer's point of view. Groups like Bukanas de Culiacan and El Komander sell tons of albums and fill up concert venues all over the U.S. and Mexico. Like gangster rappers from the 1990s, these musicians embrace the style and swagger of the criminal they sing about—members of Bukanas de Culiacan even brandish bazookas on stage. Although it is clear that these musicians are—to some extent—posturing, it is also apparent that there are substantive links between them and the smugglers.\n\nDirector Shaul Schwarz and his crew talk a wide swath of people—musicians, civilians, drug dealers, politicians, and police—to tell this story. They ride along with the police who live in fear of being assassinated. Gory crime scenes are visited. Families who've been torn apart by random violence are interviewed. They travel with musicians as they seek inspiration—and approval—from drug cartels in Sinaloa. The end result is a highly disturbing documentary that provides a window into a surreal world where brutal reality and popular entertainment intersect. (Rodney Perkins)",
    "directors": [
        "Shaul Schwarz"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/narco-cultura"
    },
    "runtime": 103,
    "synopsis": "NARCO CULTURA is a graphically disturbing documentary that examines the parallels between the Mexican drug war and the increasingly popular musical style of narcocorridos (drug ballads).",
    "title": "Narco Cultura",
    "year": 2013
}