{
    "countries": [
        "United States"
    ],
    "description": "Director Isaac Florentine, Actors Scott Adkins and Mika Hijii, and Producer Frank De Martini LIVE in attendance!\n\n\nCasey Bowman has finally settled down. He's happily married to Namiko (who is pregnant with their first child), living in Japan and teaching at the Koga dojo. While buying her a present, Casey is attacked by two punks. He shrugs it off, assuming it to be a simple mugging. But when Namiko is brutally murdered later that same night, Casey's world falls apart. Stricken with grief and thirsty for revenge, Casey tracks down the two thugs who tried to rob him, but they can't provide him with any clues to his wife's murder. So Casey travels to Thailand, to the dojo of a close friend. His grief and anger are taking control of him and he lashes out while sparring with other students. When one of the students is killed in the same way as Namiko, Casey finally gets the clues he needs to track down his wife's killer and unravel a mystery of grudges deep in the Burmese jungle.\n\nDirector Isaac Florentine's NINJA sequel is a lean, mean, action-packed film. The plot is basic but unobtrusive and the fight sequences flow naturally and abundantly. Scott Adkins is at the top of his game, as graceful and athletic as ever, with flying spin kicks and flurries of punches that seem effortless. He is a one-man army, wreaking havoc all over Asia in his quest for vengeance. The fights are extraordinary, with camera placement, slow-motion sequences and editing that bests almost any big budget Hollywood action. Fans will not be disappointed; this is a straight-up, hard-hitting action film and some of the best work we've ever seen from both Florentine and Adkins. (Luke Mullen)",
    "directors": [
        "Isaac Florentine"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/ninja-ii-shadow-of-a-tear"
    },
    "runtime": 95,
    "synopsis": "Scott Adkins returns as Casey Bowman, a Ninjitsu master out to avenge the death of his wife in director Isaac Florentine's follow-up to his 2009 film NINJA.",
    "title": "Ninja: Shadow of a Tear",
    "year": 2013
}