{
    "countries": [
        "Germany"
    ],
    "description": "Director Katrin Gebbe and Producer Verena Graefe-Hoeft LIVE in attendance!\n\nKatrin Gebbe's stunning debut film begins and ends with water. The building block of life frames the true story of Tore, a member of counter-culture Christian movement Jesus Freaks, and Benno, a seemingly normal middle-aged husband and father of two. Tore meets Benno by performing a miracle of sorts in fixing Benno's car. Before long, Tore moves into a tent in Benno's garden and gradually becomes part of his family. Tore is finally close to being content, but still driven by the thought that Jesus has brought the two of them together. It's only when Benno begins to show signs of true evil that Tore finds his mission, but doesn't know or understand that he'll experience the worst of humanity in order to complete it.\n\nIt's easy to see that the sheer power in this film marks the arrival of a major talent in Katrin Gebbe, who balances the beautiful and the brutal the way Michael Rosskam did in his Oscar-nominated (and FF New Wave award-winner) BULLHEAD. There's a fine line between exploiting and provoking in cinema and Gebbe pushes this film right up to that line. The first industry screening at Cannes had 3/4 of its audience leave by the end and the festival screening was met by both applause and boos. Variety said it was \"deserving of a special Palme d'Horreur\" in a year where several films were noted for extreme violence. The film is based on true events, and it forces the audience to watch some of the more inhumane acts at length. It's certainly a hard watch, but one can find reason in Gebbe's methods when you consider the dynamics of the word \"martyr.\" If you've finished the 2008 film MARTYRS, you'll remember martyr in fact means \"witness,\" and it's important to note that some religions require an audience for one to achieve martyrdom. In this case, martyrs require both one to witness and be witnessed. In NOTHING BAD CAN HAPPEN, it's essential that we, the audience, are all witnesses, and this is why Gebbe's eye is unflinching and we aren't allowed to look away. (James Shapiro)",
    "directors": [
        "Katrin Gebbe"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/nothing-bad-can-happen"
    },
    "runtime": 110,
    "synopsis": "Tore, a member of the counter-culture Christian movement Jesus Freaks, is befriended and taken in by a family who play an increasingly cruel, violent game and push his capacity to love to its limits.",
    "title": "Nothing Bad Can Happen",
    "year": 2013
}