{
    "countries": [
        "France"
    ],
    "description": "Victor is, in many ways, a broken man. You can argue about whether it was the French Foreign Legion that broke him, or the Algerian occupation, or some combination of the two, but the end result is that—now freshly returned home to the Paris of the 1960s—Victor is just not comfortable in his own skin. He's no longer himself. And so work as a masked wrestler carries obvious appeal. His old friend Simon, who makes a living as a minor hero on a low level wrestling circuit, is just the man to get him in.\n\nBut while wrestling may seem a silly business from the outside, from the inside it is dead serious, a playground for serious men who control the entire shadowy operation from start to finish. And do they care that Victor's troubled conscience cannot abide the idea of playing a villain in the ring? Not with that build, they don't. And so begins a descent into dubious legality and existential dread with old categories of good and evil jettisoned from the nearest window.\n\nForget everything you think you know about David Perrault's Cannes-selected debut film OUR HEROES DIED TONIGHT. This is no camp exercise, no feel-good underdog story either. Instead, this is a dead serious exercise in classic film noir, a world where fractured heroes struggle to navigate the murky morality of a world gone wrong. Shot in gorgeous black and white, Perrault captures the feel of a time gone by while injecting his own freshness and vigor into the noir style. Denis Menochet and Jean-Pierre Martins deliver strong, understated performances as Victor and Simon with their sincerity giving the film a resonance that will stick long after the final frame. (Todd Brown)",
    "directors": [
        "David Perrault"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/our-heroes-died-tonight"
    },
    "runtime": 94,
    "synopsis": "Freshly returned home from a stint in the French Foreign Legion, Victor finds work as a reluctantly villainous masked wrestler in this marvelously crafted ode to film noir from first-time director David Perrault.",
    "title": "Our Heroes Died Tonight",
    "year": 2013
}