{
    "countries": [
        "Australia"
    ],
    "description": "Director Mark Hartley, Producers Justin King and Antony Ginnane LIVE in attendance!\n\n\nThe Roget Clinic, a leader in research into the care and recovery of coma patients, seems to house as many secrets as it has residents. There is Doctor Roget himself, crossing ethical lines in his secret research conducted away in the basement. There's the newly arrived nurse Kathy Jaquard, and then there's Patrick, one of the patients, quietly lying unresponsive despite the fact that he's fully aware of his surroundings and—as Jaquard and all involve will learn—both obsessive in his affections and very, very telekinetic.\n\n\nDirector Mark Hartley won much love amongst cult film fans with his documentary efforts MACHETE MAIDENS UNLEASHED and NOT QUITE HOLLYWOOD, detailing the cult films produced by Americans in the Philippines and the 1970s Ozsploitation movement, respectively. For his narrative debut, he tackles one of the prime subjects of NOT QUITE HOLLYWOOD with a remake of 1978 cult favorite PATRICK, along with the backing of legendary original producer Antony I Ginnane.\n\n\nHartley's PATRICK feels very much like the product of another time, and not the one that you would expect. While updating aspects of the story to match current technology, Hartley takes his stylistic cues from earlier in film history, this PATRICK playing as a classy Gothic-tinged affair with the magnetic Charles Dance doing his best Vincent Price. But rest assured, the film's classiness doesn't preclude Patrick's telekinetic powers from sending various pointy things from flying through the air with great force. YOU'RE NEXT star Sharni Vinson continues to cement her place as horror's new go-to girl with her performance, and Rachel Griffiths rounds out the principal cast. (Todd Brown)",
    "directors": [
        "Mark Hartley"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/patrick"
    },
    "runtime": 95,
    "synopsis": "Nurse Kathy Jaquard didn't expect a lot of trouble on the coma ward but she gets more than she can handle when she meets the telekinetic Patrick in Mark Hartley's remake of the Ozsploitation classic.",
    "title": "Patrick",
    "year": 2013
}