{
    "countries": [
        "United States"
    ],
    "description": "Director Zack Parker and Actor/Producer Faust Checho LIVE in attendance!\n\n\nOn her way home from the doctor's office one morning, expectant mother Esther is brutally accosted by a mysterious, hooded attacker. Disturbed, she retreats into a solitary life, keeping a safe distance from the outside world. As time goes on, she decides to make efforts to re-assimilate herself into society. She seeks comfort in a local support group and it's there that she meets Melanie, a sweet woman from the neighborhood. Forming a new bond, Esther is hopeful that she can move on and start a new life with new connections. This of course falls apart one day when she makes a startling discovery that will change everything. But as the layers are slowly peeled back on these characters, it becomes clear that everyone in the narrative is far from perfect, or even well intentioned. Playing with shifting perspectives, Parker treats the audience to an unpredictable thrill ride.\n\n\nWith plot twist on top of plot twist, PROXY contains one of the most complicated, unexpected and truly crazy stories ever seen at Fantastic Fest. Told through a web of character development, the film featuring a series of incredible performances from a group of recognizable faces that includes Alexia Rasmussen, Alexa Havins and indie icon Joe Swanberg, in a wholly different kind of role for him. Punctuating the film's brutal psychological landscape with some gorgeous, memorable slow-motion imagery, Parker creates a sadistically unstable world, one in which you feel anything could happen at any moment. And it does. Best experienced with a fresh eye, PROXY is one of those films that will hit you with an unexpected jolt to the system. (Michael Lerman)",
    "directors": [
        "Zack Parker"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/proxy"
    },
    "runtime": 120,
    "synopsis": "American director Zack Parker delivers an unexpected, nasty little thriller about a woman whose life spins out of control following an attack on her unborn child.",
    "title": "Proxy",
    "year": 2013
}