{
    "countries": [
        "Japan"
    ],
    "description": "Imagine Jerry Seinfeld in his prime. Then double that awareness and have Seinfeld running for 30 years (and be a bit more bizarre). That's who Hitoshi Matsumoto is to the nation of Japan; he's quite simply the most famous comedian who has ever existed.\n\nMatsumoto employs a special one-two punch of absurdist rubber-suit comedy and clever torture endurance comedy that would later pave the way for everything from Jackass to Fear Factor. Along with his longtime comedy partner Masatoshi Hamada, Matsumoto tirelessly built a television comedy empire anchored by the groundbreaking and long-running variety comedy show Downtown: no Gaki no Tsukai ya Arahende!! (Downtown: This Is No Task For Kids!!). In 2007, Matsumoto embarked upon a solo film career with his debut feature and Fantastic Fest favorite BIG MAN JAPAN.\n\nThree features later, Matsumoto has delivered what I consider to be his strongest achievement yet. Dry and restrained one moment, then, like a whip crack, surreal and wildly over-the-top, R100 richly layers comedy and an exploration of the Japanese male psyche. When we discovered earlier this year that Matsumoto was developing an \"intense sex comedy,\" we knew we had our #1 target for the festival. It is with great joy and pride that we offer to Fantastic Fest audiences R100.\n\nIn the film, Nao Ohmori (ICHI THE KILLER) plays Takafumi Katayama, a lonely, beaten down salaryman. His wife is in a coma. His work has no meaning. He drifts through his daily duties and raises his young son in a fog of depression. After he signs a one-year contract with a boutique S&M agency specializing in random acts of public sadist humiliation, Takafumi finds a renewed vigor for life. However, an unfortunate accident that violates the terms of his contract triggers a vengeance that will test his very soul.\n\nThe title R100, a riff on the Japanese rating system (R18 is a common rating describing movies suitable for ages 18 and up) implies that anyone under the age of 100 will not be mentally prepared for the complex intensities contained within this film. (Tim League)",
    "directors": [
        "Hitoshi Matsumoto"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/r100"
    },
    "runtime": 100,
    "synopsis": "The mad genius behind BIG MAN JAPAN returns to Fantastic Fest with his most crazed work yet, a brain-unraveling comic tale of male self-destruction.",
    "title": "R100",
    "year": 2013
}