{
    "countries": [
        "Argentina"
    ],
    "description": "Director Tamae Garateguy, Writer Diego A. Fleischer, and Actress Luján Ariza LIVE in attendance!\n\nThere's a predator loose in Buenos Aires, a beautiful woman prowling the streets and subways of the city luring her all-too-willing victims with the promise of sex. Of course, her targets realize far too late that the climax of their encounter will not be happy at all. The trail of bodies she leaves behind threatens to lead the police to her door but the titular she-wolf is so lost in her fractured psyche that the threat to her own safety barely seems to register.\n\nA blistering, punk rock take on the Euro-sleaze movies of the late '60s and early '70s, rising director Tamae Garateguy puts a woman's touch on her gritty black & white offering for a unique spin with this erotic thriller. Caught between the opposing forces of the cop who wants to bring her down and the young man she feels genuine emotion for - and therefore cannot kill - the unnamed killer is presented in all her fractured complexity by a trio of utterly fearless performers driven ever further by the fiercely talented Garateguy.\n\nThough the director wears her influences on her sleeve, there's something far richer and more complex going on here than the exploitation that the sleaze tag suggests. A restless experimental bent and the twisted psychology of her main character combine to create a rich and complex exploration of what fuels the urge to kill (and the consequences of those urges), and it all wraps up in one truly badass package. (Todd Brown)",
    "directors": [
        "Tamae Garateguy"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/she-wolf"
    },
    "runtime": 92,
    "synopsis": "A sexual predator roams the streets and trains of Buenos Aires, a beautiful woman who uses sex to lure in her victims. A potent, punk rock spin on Euro-sleaze influences in this raw, erotic thriller.",
    "title": "She Wolf",
    "year": 2013
}