{
    "countries": [
        "Canada"
    ],
    "description": "Writer/Director/Producer/Actor Matt Johnson LIVE in attendance!\n\nMatt and Owen are probably an awful lot like most members of the Fantastic Fest audience. They're a pair of generally well-meaning cinema-obsessed geeks who are far faster with a movie quote than any sort of word to a member of the opposite sex. They're clumsy and awkward, quick-witted and funny, and very much a prime target for the roving gang of bullies that roams the school hallways – a group that they refer to amongst themselves as The Dirties.\n\nThe solution for the pair appears to be a harmless bit of escape fantasy, a film project in which they indulge their violent revenge against their tormentors. It really is harmless, but exactly the sort of harmless that schools tend to frown upon. So when the duo's project is shut down, it triggers an escalating cycle of violence as the lines between fantasy and reality begin to blur and what was once a harmless school project begins to bleed into the real world.\n\nWinner of the top prize at Slamdance, THE DIRTIES is a remarkable piece of lo-fi DIY filmmaking, a strikingly authentic and affectionate piece of work unafraid to go into some very dark places as it creates an unsettling portrait of schoolyard violence and those caught within it. Though heavily improvised and imbued with a ramshackle charm, it quickly becomes obvious that there is a very deliberate plan at work here and that director-star Matt Johnson and his tight team of creative collaborators are a fiercely talented group who we'll be hearing much, much more from in the future. (Todd Brown)",
    "directors": [
        "Matt Johnson"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-dirties"
    },
    "runtime": 83,
    "synopsis": "A pair of cinema-obsessed high school geeks are caught up in an escalating cycle of violence when the lines between fantasy and reality begin to blur.",
    "title": "The Dirties",
    "year": 2013
}