{
    "countries": [
        "Germany"
    ],
    "description": "In THE CONGRESS, Robin Wright, playing a fictionalized version of herself, gets an offer from a major studio to sell her soul and cinematic identity so that she'll be \"scanned\" and her digitalized alias can be used with no restrictions in all kinds of Hollywood films – even the most commercial ones that she previously refused. In exchange, she receives a massive financial reward, but most importantly, the studio can keep her forever young, for all eternity, in all her movies.\n\n\nTo say that Ari Folman's THE CONGRESS has a lot going on is a massive understatement. It successfully presents an indictment of Hollywood's age-old sexism and ageism while incorporating Stanislaw Lem's somewhat accurate forecasting of a worldwide chemical dictatorship run by the leading pharmaceutical companies. Amazingly, Folman even manages to merge these ideas as Wright's digitalized identity can be made into a drug, available for any fan, allowing them to see in their own minds any fantasy they can imagine.\n\n\nFolman divides the film into thirds: two parts live action, one part animated, so that Folman, in his words, can \"illustrate the transition made by the human mind between psychochemical influence and deceptive reality.\" For him, this allows the freedom that animation can allow on \"cinematic interpretation\" and also provide a \"cry for help and a profound cry of nostalgia for the old-time cinema we know and love.\"\n\n\nTHE CONGRESS also stars Jon Hamm, Harvey Keitel, Paul Giamatti and Danny Huston and is the most subversive, surreal, metacinematic experience of this year's fest. (James Shapiro)",
    "directors": [
        "Ari Folman"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-congress"
    },
    "runtime": 122,
    "synopsis": "Robin Wright (playing herself) receives the last offer she'll ever get from a Hollywood studio in Ari Folman's adaptation of Stanislaw Lem's classic scifi novel, and his follow-up to WALTZ WITH BASHIR.",
    "title": "The Congress",
    "year": 2013
}