{
    "countries": [
        "Luxembourg"
    ],
    "description": "Dan returns home to his apartment, nestled inside a dazzling art-nouveau building, to find his wife missing and the door locked from the inside. Even more peculiar, his elderly neighbor invites him over and recounts the story of her husband being taken by someone in the walls after he climbed through a tiny hole in their ceiling. Is it possible that Dan's wife has been taken too? Why is there a woman standing naked on the roof? And what's with the knife-wielding maniac?\n\n\nAnyone familiar with Hélène Cattet and Bruno Forzani's previous film AMER or their segment in THE ABCS OF DEATH will immediately feel comfortable with the look, feel and sound of THE STRANGE COLOR OF YOUR BODY'S TEARS. In this film, as in those, style is king and the pair aren't so much concerned with aping Italian horror as much as invoking the feelings one has while watching gialli. To that effect, every moment of the film is carefully constructed both visually and aurally, and the directors' fearless camera probes the beautiful spaces in which the film is set, as well as every corner of the human body.\n\n\nAs he finds himself going deeper into the hidden worlds behind his walls, familiar music cues from the likes of Ennio Morricone and Bruno Nicolai help to further envelop the audience in Dan's increasingly bizarre nightmare. We can't tell you exactly what the film is ultimately about, but we can guarantee that seeing in on the big screen will be one of the most unique experiences you have at Fantastic Fest this year. (Brian Kelley)",
    "directors": [
        "Bruno Forzani",
        "Hélène Cattet"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-strange-colour-of-your-bodys-tears"
    },
    "runtime": 102,
    "synopsis": "A man finds violence and sex at every turn as he searches his apartment building for his missing wife in this stylish mystery from the directors of AMER.",
    "title": "The Strange Colour of Your Body's Tears",
    "year": 2013
}