{
    "countries": [
        "United States"
    ],
    "description": "Director/Co-Writer Jim Mickle and Producer Linsey Ramey LIVE in attendance!\n\nThe original WE ARE WHAT WE ARE seemed to come out of nowhere. The debut feature from writer/director Jorge Michel Grau stunned audiences, capturing awards for Best Feature and Best Screenplay at Fantastic Fest 2010. While it may initially seem a bit soon to remake the film, director Jim Mickle, along with co-writer and actor Nick Damici, took the basic elements of the original film and put their own twists on them to make the story new.\n\nThe Parkers are an average family, if a little odd. They follow a strict form of Christianity and generally keep to themselves. When the mother dies suddenly on the first morning of an annual period of fasting, the family is thrown into chaos. Frank, the widower, is grief-stricken to the extreme, and it's up to Iris, the eldest daughter, to take over her mother's responsibilities to prepare the special meal that will end the fast.\n\nMickle has crafted a deeply resonant, earthy film with a dark undertone. His changes to the material are organic and allow him to tell a similar story that never feels like a copy. The cast is excellent all around, but Michael Parks in particular is fantastic as the local doctor whose autopsy of the mother's body leads him to unravel the truth about the Parkers. Bill Sage is also outstanding as the patriarch, a battered man, bound by his beliefs and tormented by grief. His performance is quiet and smoldering, mumbling most of his dialogue, as if the words keep getting stuck on his tongue. WE ARE WHAT WE ARE is an emotionally heavy character study, focusing on the inner dynamics of a family torn apart by their adherence to religious custom. (Luke Mullen)",
    "directors": [
        "Jim Mickle"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/we-are-what-we-are"
    },
    "runtime": 105,
    "synopsis": "Director Jim Mickle paints a gripping portrait of an introverted family struggling to keep their macabre traditions alive.",
    "title": "We Are What We Are",
    "year": 2013
}