{
    "countries": [
        "United States"
    ],
    "description": "There will be very few films this year as singular as Kaufman's newest, ANOMALISA, a collaboration with filmmaker Duke Johnson. On the surface, you quickly recognize Kaufman's dark and lonely world. A Willy Loman type is unsatisfied in his life. He doesn't connect with his wife or his son. His job — giving speeches designed to improve efficiency in customer service call centers — can't fulfill what's lacking in his existence, even if he's somewhat of a celebrity in that field. However, his latest business trip to Cincinnati provides a glimmer of hope. A former love lives there and the chance at a reunion drives him through his mundane existence with the hope of connecting with another soul.\n\nThe already poignant narrative transcends to an ethereal state because of the bold decision to painstakingly shoot the entire film as stop-motion animation. We all love the nostalgia of that style, but this isn't Ray Harryhausen's Medusa. It's so well done that you quickly forget you are watching — for lack a better word — \"puppets.\" When the camera lingers on a character or zooms into their eyes, you are lost in the emotion of the moment. After the film ends, you are affected on as deep a level as you were with ETERNAL SUNSHINE OF THE SPOTLESS MIND or SYNECDOCHE, NEW YORK.\n\nANOMALISA was produced by Fantastic Fest veterans Snoot Entertainment (responsible for fest favorite YOU'RE NEXT and co-distributor with Drafthouse Films of CHEAP THRILLS) and Dan Harmon's animation house Starburns Industries. The project was originally envisioned as a 40 minute short, but after a successful crowdfunding campaign, it was extended to a feature length experience. The end result is unforgettable, one of the undisputed highlights of this year's Fantastic Fest. (James Shapiro)",
    "directors": [
        "Duke Johnson",
        "Charlie Kaufman"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/anomalisa"
    },
    "runtime": 90,
    "synopsis": "Charlie Kaufman's newest story, a revolutionary and emotional stop-motion animation, follows an unhappy customer service guru looking for an escape from the monotony of his life.",
    "title": "Anomalisa",
    "year": 2015
}