{
    "countries": [
        "Japan"
    ],
    "description": "One of the great lost masterpieces of Japanese animation, never before officially released in the U.S., 'Belladonna of Sadness' is a mad, swirling, psychedelic light-show of medieval tarot-card imagery with horned demons, haunted forests and La Belle Dame Sans Merci, equal parts J.R.R. Tolkien and gorgeous, explicit Gustav Klimt-influenced eroticism. The last film in the adult-themed Animerama trilogy produced by the godfather of Japanese anime & manga, Osamu Tezuka and directed by his long time collaborator Eiichi Yamamoto (\"ASTRO BOY\" and \"KIMBA THE WHITE LION\"), BELLADONNA unfolds as a series of spectacular still watercolor paintings that bleed and twist together. An innocent young woman, Jeanne (voiced by Aiko Nagayama) is violently raped by the local lord on her wedding night. To take revenge, she makes a pact with the Devil himself (voiced by Tatsuya Nakadai, from Akira Kurosawa's RAN) who appears as an erotic sprite and transforms her into a black-robed vision of madness and desire.\n\n\nExtremely transgressive and not for the easily offended, BELLADONNA is fueled by a mindblowing Japanese psych rock soundtrack by noted avant-garde jazz composer Masahiko Satoh. The film has been newly restored by Cinelicious Pics using the original 35mm camera negative and sound elements – and including over 8 minutes of surreal and explicit footage cut from the negative. On par with Rene Laloux's FANTASTIC PLANET and Ralph Bakshi's WIZARDS as an LSD-stoked 1970s head trip, BELLADONNA marks a major rediscovery for animation fans. If Led Zeppelin had a favorite film, this would be it. In other words, Stairway to Hell. (Dennis Bartok, Cinelicious)",
    "directors": [
        "Eiichi Yamamoto"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/belladonna-of-sadness"
    },
    "runtime": 86,
    "synopsis": "A young and in love Jeanne is attacked by the local lord and makes a pact with the Devil himself in one of the most important rediscoveries of this year. Never before released in the US, this seminal psychedelic masterpiece has been painstakingly restored in 4k digital.",
    "title": "Belladonna of Sadness",
    "year": 1973
}