{
    "countries": [
        "United States"
    ],
    "description": "A stranger (David Arquette) rolls into the tiny Western town of Bright Hope, immediately drawing the suspicions of the backup deputy Chicory (Richard Jenkins). He alerts the town's sheriff, Franklin Hunt (Kurt Russell) and in an ensuing scuffle, the stranger is wounded and put in jail. Summoned to tend to the wounded man is the beautiful Samantha O'Dwyer (Lili Simmons), whose successful working-class husband Arthur (Patrick Wilson) is laid out at home with a broken leg.\n\nSometime in the night, a local stable boy is torn to pieces, horses are stolen and Samantha and the stranger disappear. The only clue left behind is a rather peculiar looking arrow, a weapon their local Indian expert identifies as belonging to tribe of cannibalistic troglodytes. Having no alternative but to face these cave-dwelling abominations, Sheriff Hunt, Chicory, Arthur O'Dwyer and the dashing, highly educated gentleman John Brooder (Matthew Fox) head out on a rescue mission.\n\nBONE TOMAHAWK is first and foremost a gritty western, rich with complex and fascinating characters, so much so that it would work equally as well without the horrifically violent cannibals. But fortunately for us, it's also a tense and brutal horror movie, and violent those cannibals are. They attack swiftly and in packs, taking out their prey quickly and without mercy, not thinking twice about splitting a living man right down the middle.  It's done with such an insistent matter-of-factness that it feels almost real and all the more horrific.\n\nKurt Russell, whose chiseled features, commanding presence and gruff voice have been woefully unutilized in westerns since TOMBSTONE, stands out amongst a group of superb actors who all look like they were born for the genre. Thankfully, his return is worth the wait, as he and the rest of the cast are given ample great material to work with by writer/director S. Craig Zahler, no stranger to the genre (his noir western novel A Congregation of Jackals was nominated for several awards). This is a men-on-a-mission western full of all the genre staples we love, but with the added joys of brutal horror such that, by the end of BONE TOMAHAWK, you'll understand how the west was truly won... against savage cannibals. (Brian Kelley)",
    "directors": [
        "S. Craig Zahler"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/bone-tomahawk"
    },
    "runtime": 133,
    "synopsis": "Kurt Russell stars in this character driven and at times horrific Western about a group of men (including Patrick Wilson, Matthew Fox and Richard Jenkins) who set out to rescue a local woman and a young deputy who've been kidnapped by a tribe of cannibalistic troglodytes.",
    "title": "Bone Tomahawk",
    "year": 2015
}