{
    "countries": [
        "United States"
    ],
    "description": "Zoe Bell – best known for her long running collaborations with Quentin Tarantino – is Avery Taggert, an acclaimed photojournalist looking to put some distance between herself and her own dark history when she takes a job in the remote jungles of Colombia. Her subject? A religious group - led by TIMECRIMES helmer Nacho Vigalondo – with their own hidden agenda. It should be a fairly straightforward job, but when Taggert snaps a photo of something she wasn't meant to see, things go very dark very quickly and she ends up running for her life through the hostile jungle.\n\nDirector Josh Waller reunites with his RAZE leading lady for an adrenaline-pumping action adventure through hostile territory, packed with familiar faces including festival mainstays Vigalondo and Francisco Barriero (HERE COMES THE DEVIL; WE ARE WHAT WE ARE). Waller's no-nonsense style delivers a lean, to-the-bone approach, with Bell proving once again – as though she's got anything left to prove at this stage – that her physical skill and fearlessness is matched by an on-screen charisma that should have thrust her into the spotlight long before now. And Vigalondo? When someone gave the manic Spaniard license to chew a bit of scenery as a charismatic villain, any festival regulars should have no problem figuring out what will be the result. For the uninitiated, the answer is big time fun.\n\nThough he has built a name for himself as part of the Spectrevision producing team, Waller has also been careful to maintain an individual identity separate from his COOTIES and A GIRL WALKS HOME ALONE AT NIGHT cohorts. With this, his third directing effort, Waller reinforces his own taste for no-nonsense action, balancing out late '70s antiheroes and character work with mid-'80s Corman style pulp. CAMINO falls roughly at the midpoint on the spectrum between his earlier efforts – RAZE and the Toronto-selected McCANICK – and reminds us that while he may be part of a very gifted team, Waller is also a solo force to reckon with. (Todd Brown)",
    "directors": [
        "Josh C. Waller"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/camino"
    },
    "runtime": 104,
    "synopsis": "A photojournalist gets more than she bargained for when she snaps a photo of a shadowy religious figure in the jungles of Colombia, triggering a flight – and fight – for her life.",
    "title": "Camino",
    "year": 2015
}