{
    "synopsis": "In a secluded Chilean village, four men lead a quiet life, trying to redeem themselves of their past sins. Their existence is threatened by the arrival of a man whose own secret may reveal all which the four have worked to forget.",
    "description": "Somewhere in Chile, four men lead a secluded life, aided only by their female companion, a former nun. Their routine is simple, their days are spent in simple prayer, food, introspection and an occasional trip to secretly race their dog at the local track.\n\nHowever their existence is threatened with the arrival of a mysterious stranger. His own secret brings upon the house an investigation which threatens to reveal exactly what dark event brought each of the men to this remote hideaway. As the investigation gathers speed and more layers are unraveled, the men realize only desperate action can save the sanctity of the life they have created. Something must be done.\n\nCentered around a mystery, Pablo Larrain's follow up to his Chilean trilogy is yet another assault on his country's history. This time, his target is the church and all the evil it has allowed over time.\n\nNever condescending, never damning, Larrain allows his characters to go on a brutal journey, destroying everything they stand for so they may discover who they really are. Filled with brutal imagery, shocking content and an emotionally draining finale, THE CLUB is the kind of film people will be talking about for a long time. Its uncompromising vision of a land plagued by its own sins is frightfully tainting, so deeply effective that no other film at the festival will get so deeply under your skin.\n\nAn unmissable experience, THE CLUB represents the most intelligent kind of filmmaking there is: daring, explicit and challenging. Aided by fine performances from his usual roster of actors, including the ever-brilliant Alfredo Castro as the chillingly calculating Father Vidal, Pablo Larrain's vicious statement will remain with you indefinitely. (Evrim Ersoy)",
    "title": "The Club",
    "runtime": 98,
    "directors": [
        "Pablo Larrain"
    ],
    "year": 2015,
    "countries": [
        "Chile"
    ]
}