{
    "countries": [
        "Hong Kong"
    ],
    "description": "Without the work of King Hu, the furious legacy of martial arts cinema may never have existed. The heroic swordplay wuxia films that make up his body of work are so fundamental, so completely original and endlessly inspiring, that Hu has to be considered as one of the definitive genre filmmakers of any era. Imagine the poetic authorial voice of Akira Kurosawa blended with the controlled operatic style of Sergio Leone and the carefully designed world of a classic Hollywood musical and you start to get at the unbelievable talent of King Hu. His movies are bloodily stylized explorations of the most profound human conflicts that move away from the fantasy-driven martial arts works that preceded them and towards the hard-edged stoic heroism that has become the basis of decades of kung fu entertainment. Philosophically complex, intricately designed and relentlessly choreographed, Hu's films are the apex of martial artistry on screen.\n\nIn COME DRINK WITH ME, a young magistrate escorting prisoners is kidnapped by Jade-Faced Tiger, whose gang of unsavory thugs is holed up in a temple under the protection of a mysterious abbot. The legendary warrior Golden Swallow (Chang Pei-Pei) effortlessly wards off an attack by the gangsters at a country inn, after which a drunken beggar stumbles into the scene, asking for a drink. Thus the stage is set for a typically dazzling and elegant King Hu film in which nothing is what it seems, including Golden Swallow herself.",
    "directors": [
        "King Hu"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/come-drink-with-me"
    },
    "runtime": 95,
    "synopsis": "One of the foundational classics on which all martial arts cinema is built, COME DRINK WITH ME stars the incomparably talented Chang Pei-Pei as an avenging warrior, Golden Swallow, on a mission to save the local governor's son from the Jade-Faced Tiger's gang.",
    "title": "Come Drink With Me",
    "year": 1966
}