{
    "countries": [
        "Romania"
    ],
    "description": "Robbed and beaten on the streets of Accra, friends and musical compatriots M3NSA and Wanlov The Kubolor are back and out for revenge. They'd also like some lunch. Welcome to the peculiar world of COZ OV MONI 2 - FOKN REVENGE.\n\nAcclaimed musicians and merry pranksters M3NSA and Wanlov have built a well-deserved reputation as musical groundbreakers in their native Ghana, the duo being among the first to write and perform in local dialect, and they took that same spirit to their debut feature film COZ OV MONI. Embracing the more playful, comic personas that drive their Fokn Bois duo – the pair push into more serious territory in their solo work – they delivered what they describe as the world's first pidgin musical, an ultra low budget blast of energy and tunes from the streets of Accra on to the world's screens. And with that first effort proving a success they return now with the sequel.\n\nAn unruly affair, COZ OV MONI 2 ignores all the rules of \"proper\" narrative, instead linking together a series of increasingly odd musical vignettes following its heroes on their easily-distracted path through the big city to find the villains who robbed them in the first film. Don't worry about putting too much effort into tracking the story, because what really drives things here is the outrageously charismatic duo at the core of things. Wanlov and M3NSA come across as a pair of devil-may-care musical savants on a continuous quest to fill their bellies and attract the eye of passing ladies. An enormously charming, playful affair, this could very well be the most fun you'll have in a cinema all year. (Todd Brown)",
    "directors": [
        "Fokn Bois",
        "King Henry Blackson"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/coz-ov-moni-2"
    },
    "runtime": 63,
    "synopsis": "Beaten, robbed and left for dead, Wanlov and M3NSA are back and looking for revenge. But first, singing. And lunch. Prepare yourself for \"the world's second first pidgin musical\"!",
    "title": "Coz Ov Moni 2",
    "year": 2014
}