{
    "countries": [
        "Norway"
    ],
    "description": "Dag dislikes people. All of them. Strongly. He would like nothing more than to be simply left alone to enjoy a good meal alone at home, while listening to his vast collection of music. Because he does not like people. Which is something of an unusual characteristic for a man who works as a relationship counselor, and one that invariably leads him to begin his sessions by asking his clients if they've considered divorce. Because if they haven't, they probably should.\n\nBut being a human himself, Dag cannot entirely escape the plague of human contact. There is his eccentric receptionist, for one. He has to see her every day. And there's his sex addict best friend, freshly released from prison and back in the orbit of his ex-fiance's moderately terrifying extended family of angry (and drug-dealing) Serbs. And then, for reasons Dag himself is not entirely certain he understands, there is his (mostly) reformed ex-hippy girlfriend whom he actually spends time with voluntarily.\n\nWelcome to the world of DAG, the hit Norwegian television series about to enter its fourth season. The bleakly hilarious style of writer-director Oystein Karlsen is already familiar to Fantastic Fest patrons from his 2012 feature effort FUCK UP, a film that features the entire creative team and core cast of DAG. And if it seems like the TV series is the sort of thing that Hollywood would snap up, you're right. They have, with a US remake currently in the works. But before that arrives, we have the chance to partake in the original, straight from the source, in a rare appearance outside of its native land. (Todd Brown)",
    "directors": [
        "Oystein Karlsen"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/dag-season-4"
    },
    "runtime": 92,
    "synopsis": "A misanthropic relationship counselor, his (mostly) reformed hippy girlfriend, and his sex addict best friend drive this hugely popular Norwegian TV comedy from the creators of previous fest hit FUCK UP.",
    "title": "Dag - Season 4",
    "year": 2015
}