{
    "countries": [
        "Czech Republic"
    ],
    "description": "As a society, we are more understanding and accepting these days than ever before about the nature of our sexual urges. We have grown far more tolerant to those whose sexual identity was until recently thought by many to be deviant behavior. Because of this increased enlightenment, now is the best time to see and be challenged by a film like DANIEL'S WORLD. Daniel is 25 years old, lives in the Czech Republic, wants to be a writer, has never dated, and is in love with an eight-year old boy. This is his identity and it's among the most challenging ways to be defined in any culture. But that is Daniel's day to day reality and he wants his sexual identity be accepted by society. He has never acted on his desires and repeatedly insists he never will.\n\nDANIEL'S WORLD is not for the judgmental or the faint of heart. Daniel is upfront and honest about his feelings, especially concerning his friend's young son Misa. He talks about suicide as an option like he was talking about the weather. Liskov치 refuses to burden her film with morality or judgment but rather shows Daniel's existence as a human being. She does draw a distinction between pedophilia and violent sexual predators who attack children because of their vulnerability. That said, the audience's ability to broaden its predisposed notions of acceptance is seriously challenged by scenes of Daniel and his pedophile support group collectively staring at and sizing-up at a playground full of children.\n\nIn a festival filled with the fantastic, from drug-dealing skinheads to gangsters fighting vampires to alien teachers, DANIEL'S WORLD doesn't feel like an immediate fit. However, Fantastic Fest has been dedicated to showing a range of challenging documentaries including those that open a window into the world's taboos and marginalized people. Think about the prospect of spending your entire life being despised by the vast majority of society and knowing you will never have the opportunity to find a fulfilling life partner. That's Daniel's world, and it's bizarre, shocking, engaging and enlightening. (James Shapiro)",
    "directors": [
        "Veronika Li코kov치"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/daniels-world"
    },
    "runtime": 75,
    "synopsis": "Veronika's Liskov치's brave documentary from the Czech Republic takes a very open, unflinching and non-emotional view of the most despised, misunderstood and taboo trait: pedophilia.",
    "title": "Daniel's World",
    "year": 2015
}