{
    "countries": [
        "Turkey"
    ],
    "description": "Channeling the spirit of early Hollywood serials and ingeniously combining it with the most outrageous elements of science fiction, THE DEATHLESS DEVIL is a love letter written in the language of Turkish exploitation.\n\nDirector Yilmaz Atadeniz's brilliant magnum opus opens as scientist Professor Dogan discovers the new 'tangayt' metal, which allows him to remotely control all cars and technology. However, the news of his discovery soon gets him in the crosshairs of the mysterious Dr,. Satan who wants to rule the world with an iron fist. The only man who can stop the situation is Tekin, putting on his father's Copperhead costume and taking up the mantle of fighting crime.\n\nA superhero origin story, a science fiction epic and a jaw-dropping display of endless stunts, THE DEATHLESS DEVIL showcases the best of Turkish genre cinema of the period: productions full of heart, made on nothing, but which aim far above what anyone else would have dared.\n\nCrazy robots, madcap car chases and a sidekick believing himself to be Sherlock Holmes are only the icing on the cake. The film blends the surreal with the excessive and creates a landscape which will feel both familiar and foreign to a genre audience. The performance of lead actor Kunt Tulgar is nothing short of wonderful as he throws himself into the role of Copperhead with gusto and fights his way through an ever-changing roster of brilliant henchman all the way to the mysterious Dr. Satan.\n\nBoth an entertaining ride and an important discovery, THE DEATHLESS DEVIL, like many of its counterparts, only exists in lower quality formats. This is the best version of the film available in the world..\n\nSo take a trip into the colorful past of Turkey's cinematic history and wonder how anyone could've survived this long without meeting THE DEATHLESS DEVIL. (Evrim Ersoy)",
    "directors": [
        "Yilmaz Atadeniz"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/deathless-devil-the"
    },
    "runtime": 84,
    "synopsis": "The mysterious Dr. Satan's nefarious plans threaten the future of everyone on the planet, and the only men who can stop him are the brilliant Copperhead and his assistant Sherlock Holmes!",
    "title": "The Deathless Devil",
    "year": 1972
}