{
    "countries": [
        "Poland",
        "Israel"
    ],
    "description": "Peter is a successful young architect living in London. When he falls in love with the beautiful Zaneta, he agrees to move back to her small hometown in Poland. Their whirlwind romance takes her family by surprise and her father is particularly wary of Peter despite his ability to speak Polish. Luckily Peter has made fast friends with Zaneta's older brother Jasny. They have inherited an old house and barn from her family and Peter has grand plans for fixing up the place, even putting a swimming pool in the back yard.\n\nBut when he starts digging the hole for the pool, he discovers what appear to be human bones. Concerned he calls his wife-to-be, but can't get ahold of her as she is knee-deep in wedding preparations. That night, he has a strange dream about seeing a young lady out by the hole. When he tries to approach, he falls into a mud pit and flails until he wakes up. While he's upset by these visions, he has no choice but to shake it off and prepare for his wedding. But the wedding night will bring more mysterious occurrences and it won't be long before Peter finds himself in over his head.\n\nDEMON is the third feature film from Polish director Marcin Wrona who also co-wrote the screenplay. Wrona takes clear inspiration from the Jewish legend of the dybbuk but puts his own modern spin on it. The opening scene, ominous and alarming, could be a baptism or an exorcism or even just a figment of Peter's imagination. But no matter which, it establishes an uneasy tone that continues through the rest of the film. DEMON is unsettling all the way to the last frame with an atmosphere of ever-increasing tension and fear that's impossible to shake. (Luke Mullen)",
    "directors": [
        "Marcin Wrona"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/demon"
    },
    "runtime": 94,
    "synopsis": "A day after discovering human remains in the backyard of their new home, a man begins experiencing strange visions which come to a head on his wedding night.",
    "title": "Demon",
    "year": 2015
}