{
    "countries": [
        "Republic of Korea"
    ],
    "description": "If Fantastic Fest audiences were unfamiliar with Korean filmmaker Lee Sang-woo prior to last year, they certainly took notice after the premier of his provocative and disturbing drama I AM TRASH. That film — the third in his \"bad family\" trilogy, following MOTHER IS A WHORE and FATHER IS A DOG — was the feel-bad movie of the fest, but also introduced many to a unique and fascinating voice in Korean cinema. This year, Lee returns... with a love story.\n\nWhile it's true that A DIRTY ROMANCE is a story about love, its title and its director make it immediately apparent this isn't a film filled with roses and kisses. Chul-joong is looking for love and wants nothing more than to be married. He lives with his sister Mi-joong, who is both intellectually and developmentally disabled. Mi-joong falls in love with Chul-joong's childhood friend Chang-gi after Chul-joons forces him to fulfill Mi-joong's sexual needs. Chang-gi cares for his mother who has dementia and who he lovingly protects by tying her foot to a leash in her apartment. And then there is Deok-ho, a young man very similar to Mi-joong ,who is smitten with her and just wants to give her all the love she desires.\n\nWhereas I AM TRASH was about bad family members doing bad things to each other, A DIRTY ROMANCE is about good people trying to do right by their families, but in sometimes terrible ways. Lee again approaches the material with a style that forces the audience to stumble upon the lives of others, with much of the drama unfolding through windows and on city streets. The characters feel real and the impact of their actions and their emotions is always raw. It is, like I AM TRASH, powerful and button-pushing stuff and some may want to quickly dismiss it as offensive. It's his refusal to impose any sort of judgement on his characters and his treatment of them and their actions — both good and bad — that instead makes Lee's some of the most brilliantly challenging films coming out of Korea today. (Brian Kelley)",
    "directors": [
        "Lee Sang-woo"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/dirty-romance"
    },
    "runtime": 94,
    "synopsis": "In Lee Sang-woo's follow up to last year's I AM TRASH, Chul-joong is too busy forcing his friend to sexually please his developmentally disabled sister to notice someone may want to actually love her for who she is.",
    "title": "Dirty Romance",
    "year": 2015
}