{
    "countries": [
        "Japan",
        "United States"
    ],
    "description": "Typically, the appearance of an alcoholic, Japanese, crossdressing wrestler with cerebral palsy named L'Amant (\"The Lover\") in a film at Fantastic Fest would be considered fairly normal. Except when it's not a character in [insert any one of our favorite Japanese directors here]'s new movie, but rather one of the subjects in a documentary about an underground wrestling league in Japan where disabled wrestlers fight able-bodied opponents.\n\nA star in this unique pro-wrestling league called Doglegs, \"Sambo\" Shintaro — another fighter with cerebral palsy — is looking to retire after twenty years of fighting. He dreams of settling down with a good job, a good woman and just one win against his longtime rival (and friend) \"Antithesis\" Kitajima. Unexpectedly, Kitajima issues an ultimatum upon the announcement of Shintaro's challenge: the winner of that fight, and only the winner of that fight, will win his retirement. Shintaro has no choice but to agree to the challenge, and he begins training for the most important fight of his life.\n\nBeyond DOGLEGS' central rivalry between Shintaro and Kitajima is a fascinating examination of an entire bizarre subculture. Among the other fighters in the league are a man with severe depression, the aforementioned crossdressing alcoholic, and his able-bodied wife. Director Heath Cozen looks beyond just the jaw-droppingly shocking spectacle of these fighters in the ring and examines how those who have no choice but to be different live in a society that so greatly regards conformity.\n\nDOGLEGS is a perfect documentary for Fantastic Fest, where we all know and genuinely love the bonkers world that is Japan. It takes a film like this to help us better understand, contextualize and appreciate the culture there, and how those disenfranchised within it are often the ones that give birth to the wacky things we enjoy so very much. (Brian Kelley)",
    "directors": [
        "Heath Cozens"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/doglegs"
    },
    "runtime": 89,
    "synopsis": "A look inside one of the world's oddest wrestling leagues, where disabled fighters take on able-bodied opponents in brutal and bloody fights for their own dignity and self-respect. From where else but Japan?",
    "title": "Doglegs",
    "year": 2015
}