{
    "countries": [
        "France"
    ],
    "description": "Life probably began in the sea. Billions of years ago, amino acids joined together in the primordial soup to form the first simple microbes that evolved over the eons into the complex organisms that now dominate this world. Because of this, we're frequently drawn to use the sea in film as a metaphor of life. Lucile Hadzihalilovic's newest film, EVOLUTION, takes our longing of the sea and shows its beauty; even lingers on how wonderfully alien it can be. Life probably began in the sea, but it's still unknown and deadly to us, as life can certainly also end in the sea.\n\nLike her 2004 film INNOCENCE, Hadzihalilovic's narrative here is an examination of gender and morality that uses children as its main characters. With EVOLUTION, Hadzihalilovic introduces us to Nicholas, a pre-teen boy who lives on a small Mediterranean island populated only by young boys and women. Nicholas takes medicine for a mysterious illness that forces him to visit the local hospital. Whatever is wrong with him, it's bad enough that he needs emergency surgery and is then quarantined to round-the-clock care. He's never told what's wrong with him or the other boys, but he resists what's happening to him and holds onto a memory of a world outside his captivity.\n\nFramed by lush cinematography, Hadzihalilovic's vision plays out like a bastard child of PICNIC AT HANGING ROCK and THE ISLAND OF DR. MOREAU. Layer in a Lovecraftian fascination with the mysteries of the ocean, and you have one of the weirdest, most beautiful and enduring experiences of this year's fest. (James Shapiro)",
    "directors": [
        "Lucile Hadzihalilovic"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/evolution"
    },
    "runtime": 81,
    "synopsis": "Lucile Hadzihalilovic (INNOCENCE; ENTER THE VOID) returns to directing with a surreal tale of a young boy on a remote island who develops a mysterious illness and is subjected to sinister medical treatments.",
    "title": "Evolution",
    "year": 2015
}