{
    "countries": [
        "Italy"
    ],
    "description": "In 1962, Italian directors Gualtiero Jacopetti, Franco Prosperi and Paolo Cavara invented a new genre when they unleashed the Oscar-nominated MONDO CANE onto unsuspecting cinemagoers. Detailing a world of bizarre rites, cruel behaviour and bestial violence, the movie coined the word \"shockumentary\" and made anything dubbed MONDO a money-spinning exploitation category.\n\nBut after seeing their brainchild endlessly copied and infantilised, and stung emotionally by the vitriol poured on AFRICA ADDIO, their 1966 document on the horrifying battle for control after the collapse of colonialism on the Dark Continent, Jacopetti and Prosperi decided to try a new approach to their original template and entered the even more controversial realm of blurred historical reconstruction. The blistering result was ADDIO ZIO TOM/GOODBYE UNCLE TOM/FAREWELL UNCLE TOM, an epic recreation of American slave trade atrocities that is one of the most difficult, demanding and disturbing works of film art ever made.\n\nCondemned as depraved exploitation while also acclaimed as an unprecedented cry of black anguish and rage, legendary film critic Pauline Kael called it \"the most specific and rabid incitement of the race war.\" Appropriating a cine-verite style, plus the pioneering methods taken by British director Peter Watkins in CULLODEN and THE WAR GAME, Jacopetti and Prosperi use non-professional actors and their crew as extras to deliver a time-travel dramatization of evil white oppression and radical black power to rise to the artistic challenges and rigors of depicting man's inhumanity to man.\n\nFAREWELL UNCLE TOM is a politically and socially deep, nerve-paralyzing and unflinching look at plantation life, set to a sweeping Riz Ortolani score. Nicolas Winding Refn used the opening song \"Oh My Love\" on the soundtrack to DRIVE, being one reason why this film is featured in the book The Act of Seeing by Winding Refn and Alan Jones. Once seen, never ever forgotten. (Alan Jones)",
    "directors": [
        "Gualtiero Jacopetti",
        "Franco Prosperi"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/farewell-uncle-tom"
    },
    "runtime": 123,
    "synopsis": "The first movie based on historical facts about the rise and revolt of slavery in America is one of the most brilliant, misunderstood and reviled of all time.",
    "title": "Farewell Uncle Tom",
    "year": 1971
}