{
    "countries": [
        "United States"
    ],
    "description": "Set over the course of the winter break at a rural boarding school, Kat and Joan are forced to become companions. However, what neither of them know is that an evil presence is stalking Kat, and what they experience will resonate across time and affect the lives of everyone they know.\n\nSmart, frightening and emotionally astute, Osgood Perkins' FEBRUARY might just be the most audacious and brilliant horror debut of the year. Taking classic horror themes and reworking them, Perkins cleverly crafts an intense film with razor-sharp tension and a suffocating, intense atmosphere which grips from the first frame and doesn't let go.\n\nFEBRUARY unravels at its own deliberate speed. What might initially be perceived as disjointed scenes start linking, and before long the whole horror of the story is revealed. But, in an unexpected move, the film also packs a brutal emotional punch, and will leave unsuspecting viewers with a huge lump in their throat for days.\n\nEmma Roberts and Kiernan Shipka capture the aspects of being a high school student, but also a sense of loneliness. Their isolation is palpable, and the outstanding cinematography not only captures the emptiness of the school during winter break, but also the relentless chill of the winter outside. It creates a thick and suffocating atmosphere, giving the audience no respite whatsoever.\n\nEasily one of the most brilliant efforts of the year, FEBRUARY establishes Osgood Perkins as a genre director with great visual talent and a remarkable number of important things to say. (Evrim Ersoy)",
    "directors": [
        "Osgood Perkins"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/february"
    },
    "runtime": 93,
    "synopsis": "Isolation, loneliness and quite possibly an evil presence infects the lives of two boarding school students as they wait out a lonely winter break together.",
    "title": "February",
    "year": 2015
}