{
    "countries": [
        "Netherlands"
    ],
    "description": "It's the late 1990s and business is booming. Booming, at least, for everyone other than Gerard Zwaen. But this is how Zwaen wants it. This is how things should be. For Zwaen is a writer, and a true artist works for the art and not financial gain.\n\nBut being an artist was easier when the reviews were still positive. It was easier still before Zwaen's wife threw him out of the house, forcing him to fend for himself. He could stay with his mistress, perhaps – an artist always has a mistress – but she doesn't have the room. So while Zwaen may not yet be penniless and homeless, he certainly finds himself on the road to being so, and the \"struggling artist\" type is not nearly as appealing in middle age as it was in college.\n\nAnd so Zwaen must do the only thing one can do when faced with the uncomfortable reality that one is a financial incompetent and completely unable to tend to one's own needs: He must visit his accountant. Which would be far simpler if his accountant wasn't lying dead on the floor, shot, possibly by one of the two other dead men laying strewn across the floor along with an assortment of weapons and a bag stuffed full of cash...\n\nDutch writer/director Max Porcelijn took home a pair of Next Wave Awards when he visited Fantastic Fest with debut effort PLAN C and he returns now with his sophomore piece, THE MAGNIFICENT WORKS OF GF ZWAEN, a film that once again showcases Porcelijn as a fiercely gifted writer and director with a distinct talent for genre-mashing, understated dark comedy. A spiritual successor to the Coen Brothers, Porcelijn again proves himself one of the most compelling young talents in Europe. (Todd Brown)",
    "directors": [
        "Max Porcelijn"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/glorious-works-of-g.f.zwaen"
    },
    "runtime": 110,
    "synopsis": "A struggling writer turns to his accountant for help and instead discovers a trio of corpses and a bag of money. Could this be help of a different sort, or just a whole new world of trouble?",
    "title": "The Glorious Works of G.f. Zwaen",
    "year": 2015
}