{
    "synopsis": "A tactical assault officer is saddled with a hard-partying celebrity out to rehabilitate his image – and avoid jail time – in this throwback to the odd couple buddy action flicks of the early '90s.",
    "description": "David Hendrix (Dominic Purcell) has got it all under control. Highly trained, highly competent, a complete and total badass, there's nothing he can't handle. Whether you throw a strung out junkie or a mercenary packing fully-automatic heat at him, Hendrix can take it all on without blinking an eye. At least that's what he thinks... until he meets Brody Walker (Cody Hackman).\n\nA hard partying star whose career is more TMZ than the multiplex these days, Walker has one chance left to straighten himself out if he wants to avoid living in a cell. As a sort of wake-up call following his latest run-in with the law, Walker is assigned an extended ride-along with the force. Call it a chance to see his potential future, if you like. To Hendrix – saddled with the unwanted and thoroughly unhelpful tagalong – it's nothing but a pain in the ass. But when everything goes to hell, the unlikely duo will have only each other to rely on.\n\nWriter-director Allan Ungar (TAPPED OUT) delivers a blast from the past with sophomore feature GRIDLOCKED, offering up the sort of guns blazing, odd couple buddy action film that drove audiences to the multiplexes throughout the '90s but has been seldom seen since. Boasting a slate of genre favorites in the cast – Danny Glover, Stephen Lang, Vinnie Jones, Trish Stratus and Saul Rubinek – GRIDLOCKED may not have the sort of budgetary backing the classics of the genre had, but it makes up for that with ambition, style, and a huge amount of charisma both behind and in front of the camera. Looking for a flick that understands the pleasures inherent in fully-automatic weapons and people being punched in the face? This is that movie. (Todd Brown)",
    "directors": [
        "Allan Ungar"
    ],
    "runtime": 110,
    "year": 2015,
    "countries": [
        "Canada"
    ],
    "title": "Gridlocked"
}