{
    "countries": [
        "United Kingdom"
    ],
    "description": "All hail Ben Wheatley! The four-time Fantastic Fest alum has returned with his most ambitious and scathingly satirical film to date. The cinematic voice behind DOWN TERRACE, KILL LIST, SIGHTSEERS and A FIELD IN ENGLAND shifts his lens to 1970s London, where class tensions are bubbling under the surface.\n\nWhen a polished, mild-mannered young doctor moves into a promising new lifestyle in a neighborhood high-rise, he gets more than he bargained for. Complete with everything from a swimming pool to a grocery store, the towering structure is a hermetically sealed community of epic proportions, housing inhabitants from all walks of life. When a series of escalating power outages fracture the already tenuous relationship between the working class residents on the lower floors and the aristocratic wealthy that populate the top half of the building, the development's dream of offering a perfect life is threatened. A child's birthday party quickly becomes an all-out revolt and unimaginable mayhem ensues, transforming the building intro an orgy of sex and violence that will give new meaning to the term \"buyer's remorse.\"\n\nGraduating to a much larger scale than ever before, Wheatley turns J.G. Ballard's brilliantly bizarre novel into a surrealistic fable. Peppering in touches of Terry Gilliam's BRAZIL and David Cronenberg's SHIVERS, Wheatley, along with longtime cowriter and co-editor Amy Jump, wisely situates the story in the time period that it was first written, while simultaneously creating a terrifyingly prescient parable that rings true today. Electrifying performances from an all-star cast including Tom Hiddleston, Jeremy Irons, Elizabeth Moss, Sienna Miller and the show-stealing Luke Evans, coupled with a series of pitch-perfect directorial flourishes like kaleidoscope imagery and a series of sublime covers of Abba's \"S.O.S.,\" create a beautiful and chaotic world where anything could happen at any moment. (Michael Lerman & Peter Kuplowsky)",
    "directors": [
        "Ben Wheatley"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/highrise"
    },
    "runtime": 118,
    "synopsis": "Laing, a young doctor, joins a community in a luxury building in Thatcher's England, who exile themselves from society and gradually divide into violent tribes.",
    "title": "Highrise",
    "year": 2015
}