{
    "synopsis": "A pandemic infects people everywhere with infinite lust, and the only ones who can save us are a group of astronauts in space, desperately looking for a solution.",
    "description": "Science-fiction comedy of the XXX kind, IN SEARCH OF THE ULTRA-SEX is unlike ANY film you have EVER seen.\n\nSomewhere above Earth, a group of astronauts watch in horror as a global pandemic fills EVERYONE on Earth with endless lust. Something must be done! As the astronauts desperately try to understand the reason behind this sudden illness, the horrifying truth is revealed: The sexual matrix of the Universe knowns as Ultra Sex has gone MISSING! Now the astronauts have one chance to discover exactly where the matrix has been taken to in order to save their beloved planet, while an endless orgy continues endlessly, threatening the sanity of all people on Earth.\n\nPerhaps the most demented science-fiction film ever made, this is a passion project for creators Nicolas Charlet and Bruno Lavaine who, to mark the anniversary of Canal +, delved into the archives to create something quite unique.\n\nViewing OVER 2500 X-Rated films from 1974 to 1995, Charlet & Lavaine painstakingly assembled their own film by selecting the most inappropriate, amusing, outrageous and EXPLICIT scenes and dubbing them to fit their own carefully-constructed plot and twisted sense of humor. The end result is somewhere between the most brilliantly plotted porn film ever made and something you'd discover on a late night cable channel in an exotic and foreign land, designed to amuse and baffle in equal measure.\n\nFilled with eye-popping scenes, fantastic jokes AND an unexpected and somewhat coherent plot, IN SEARCH OF THE ULTRA-SEX pushes the boundaries of what you think porn films can be. (Evrim Ersoy)",
    "title": "In Search of the Ultra-Sex",
    "runtime": 60,
    "directors": [
        "Nicolas Charlet",
        "Bruno Lavaine"
    ],
    "year": 2015,
    "countries": [
        "France"
    ]
}