{
    "countries": [
        "United States"
    ],
    "description": "Daniel Barber's sophomore feature opens in a familiar way; just not in a way you've seen in many war movies. It shares its setting with films about the apocalypse. Most of the population has been wiped out. Food, medicine and other basic resources are in short supply. The main characters – two sisters and their former slave – are desperate and down to their last reserves. Most importantly, the few people that are left don't trust each other. And they shouldn't, because as any good apocalypse movie will show you, the most dangerous enemy to survivors are other survivors. Into this desperate scenario, enter two Union soldiers (led by Sam Worthington) who have broken away from the main army to rape and pillage their way through the devastated South. When the oldest sister (Brit Marling) goes into what's left of civilization to find medicine for her younger sister (Hailee Steinfeld), she immediately catches their eye and they track her back to her farm.\n\nTHE KEEPING ROOM, based on Julia Hart's memorable 2012 Black List screenplay, expertly uses the backdrop of a shattered country to tell a tale of strength in the face of adversity. As recent events attest, we still haven't fully recovered from the culture divide that led to secession and rebellion, but Hart and Barber emphasize the transformative nature of that time and apply it to the three strong main characters of the film. The men they've relied on their whole lives – their fathers, brothers and husbands – are freshly dead. They have no choice but to find strength inside themselves and with each other. This was not a war that these women created, but the ones responsible are all dead, and the society they've left behind is filled with madness, an environment not unlike the women are left with in this summer's FURY ROAD. \"Who killed the world?\" is frequently directed at the men in Miller's film. It's very much the same here with Barber's and Hart's three female leads. The result is a terrific film that excels in both its cinematic qualities and its feminist subtext. (James Shapiro)",
    "directors": [
        "Daniel Barber"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/keeping-room-the"
    },
    "runtime": 95,
    "synopsis": "In the waning days of the Civil War, three southern women (Brit Marling, Hailee Steinfeld and newcomer Muna Otaru) defend themselves from two Yankees in Daniel Barber's (Harry Brown) second film.",
    "title": "The Keeping Room",
    "year": 2015
}