{
    "countries": [
        "Denmark"
    ],
    "description": "The more things change, the more they stay the same. That's true in all walks of life, but never more so than as it applies to Frank Hvam and Casper Christensen, the Danish comics at the center of KLOWN.\n\nFive years following the events of the first film, the duo has scarcely changed at all, though the circumstances of their lives certainly have. Casper is now a freshly single man following his divorce from Iben, and free to follow his prodigious libido wherever it may lead him. And Frank? After questioning whether Frank was \"father material\" in the first picture, Mia has just given birth to the pair's second child and Frank's life is now a neverending string of diapers, appointments and obligations. And it's no more clear now if Frank has even an ounce of \"father material\" in his entire body.\n\nNot surprisingly, the pair has grown apart. Frank only learns of Casper's plan to sell his Copenhagen home and move to America through the newspaper, an event that triggers a key realization: While Casper may be a moron, he's Frank's friend. And you cannot let a friend walk away without putting up a fight.\n\nAnd so goes this latest foray into the world of KLOWN, with the entire cast of the long-running television series and subsequent feature reuniting with director Mikkel Norgaard. And once again, the results are hysterically, painfully funny. Frequently shocking, often appalling, the real power of KLOWN comes not from its ability to be the most outrageous game in town – though it often is exactly that – but to share the shock value with a deep love for its central characters. This is maleness skewered on the big screen in all its frequent ridiculousness and it is brilliant stuff. (Todd Brown)",
    "directors": [
        "Mikkel Nørgaard"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/klown-forever"
    },
    "runtime": 90,
    "synopsis": "Five years have passed since the first KLOWN, and with their friendship at risk of fracturing forever, Frank must follow Casper to America... with typically disastrous results.",
    "title": "Klown Forever",
    "year": 2015
}