{
    "countries": [
        "Puerto Rico"
    ],
    "description": "In one of the barrios of Puerto Rico, Lucho watches her sister and her drug addict boyfriend have sex and get high. Lucho remains quiet, always observing, even when he's running drugs for a local gangster. Although neither of them know it, he crosses paths daily with Ingrid, a nurse at a local hospital for pregnant addicts. Ingrid lives an empty life, lacking human contact except for occasional sex with a local bookie named Rubén. She doesn't know that Ruben stages bare-knuckle fights for underage kids and blackmails those who owe him money. There are more characters, all of them circling each other, all of them desperate for some kind of happiness, unaware of the world around them. This is LA GRANJA.\n\nAngel Manuel Soto's debut feature is a force of nature. While the interlocking stories and the structure may initially seem familiar, LA GRANJA exudes a vicious energy all of its own. Depicting the barrio as a form of purgatory with only an exit into hell, Soto follows his characters without judgment. Swamped by their environment, crushed by their unattainable dreams, each one of them descends into an abyss from which there's no escape, and Soto is there to document every second of it.\n\nCleverly constructed and arrestingly shot, LA GRANJA heralds the arrival of an exciting new voice on the international cinema circuit. Soto paints a brave commentary on the very nature of humanity and the lengths we all go to ensure our own happiness. Seeing LA GRANJA on the big screen is the kind of cinema-going experience that is impossible to replicate, impossible to forget and absolutely necessary to anyone with a love for the movies. (Evrim Ersoy)",
    "directors": [
        "Angel Manuel Soto"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/la-granja"
    },
    "runtime": 100,
    "synopsis": "The lives of a midwife, a young boxer, a mute child and a young couple collide unexpectedly in a story about the desperate pursuit of happiness on the streets of Puerto Rico.",
    "title": "La Granja",
    "year": 2015
}