{
    "synopsis": "Somewhere in 1970s Budapest, nurse Liza dreams of romance. But as all her suitors die in violent and extreme ways, she begins to fear the worst: maybe she is really a fox fairy, doomed to remain alone forever!",
    "description": "Colorful, surreal AND bloody, director Károly Ujj Mészáros' debut is one unique experience. It's Budapest during the height of the communist regime, but this is not the Hungary of history books. This heavily stylized and colorful version of the city is home to Liza, a charming and lonely nurse who spends her days looking after the wife of the late Japanese ambassador and lip-syncing Japanese pop songs with her only friend... a dead Japanese singer. When an unfortunate accident kills her only patient, Liza becomes determined to find her one true love as prophesied by her pulp romance novel. In Liza's world, however, the path to romance is far from smooth. As each and every one of her suitors dies in grotesque, brutal and bloody ways and a dogged police investigation targets Liza for all the murders, she has to consider the most important question of them all: Can she truly be a fox fairy, that cursed creation of Japanese folklore, doomed to remain alone forever?\n\nDirector Károly Ujj Mészáros's LIZA THE FOX FAIRY is a brilliantly singular creation. Drenched in an excess of colors, it's on first appearance a distant cousin to the world of AMELIE, closer inspection reveals a much darker heart closer to Jeunet's earlier DELICATESSEN.\n\n\nInto this colorful world, Károly Ujj Mészáros throws in anything and everything: Japanese pop numbers, surreal sequences set on the Antarctic, and one brutal murder after another. In fact, it's almost impossible to think of another romantic comedy in recent years with such an outrageous body count.\n\nWithout great performances to complement the visual style, however, the film would run the risk of merely being a sweet concoction. Luckily, the cast are all more than up to the job of giving a sense of reality to the strange version of Hungary. The end result is delightful and resolutely unique, a charming fantasy with fangs so sharp you're more than likely to bleed! (Evrim Ersoy)",
    "directors": [
        "Károly Ujj Mészáros"
    ],
    "runtime": 98,
    "year": 2015,
    "countries": [
        "Hungary"
    ],
    "title": "Liza the Fox Fairy"
}