{
    "countries": [
        "India"
    ],
    "description": "You've seen enough movies to know that if teens are having sex in a horror film, it's going to end badly for them. Now imagine what kind of morality tale one can spin from a country like India, where just kissing in film (and, until recently, in public) is considered obscene. This lays the groundwork for LUDO, a new horror work co-directed by Qaushiq Mukherjee (aka \"Q\"), widely considered India's most transgressive and confrontational filmmaker from its burgeoning new wave movement.\n\nLUDO starts with Ria and Payel in the slums of India. Young and horny, they avoid Ria's mother and meet up with their suitors for a night on the town. Shut out of hotels because they cannot provide proof they are married, they break into the local mall after hours to find the necessary privacy. Their lovemaking is interrupted by what initially appears to be a band of transients. Unfortunately, these interlopers harbor a far more insidious agenda that begins with a seemingly innocent dice game of Ludo (or parcheesi to us Americans). Ria soon finds the horrible truth behind this seemingly innocent game and the bloody history it has left in its wake.\n\nQ and his co-director/editor Nikon raise their film above typical horror tropes by playing with time. The story is linear to begin with, but when the main characters are forced to pay for their sins, the two filmmakers start to converge the past with the present. Characters merge along with events when the extreme amounts of blood and gore begin to flow. The backstory to the game is revealed along with the understanding that the participants have been there as long as legend itself. The filmmakers warn that Ludo is the \"most dangerous game in the world,\" and given the film's metaphysical nature, perhaps the danger isn't over yet. (James Shapiro)",
    "directors": [
        "Q",
        "Nikon"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/ludo"
    },
    "runtime": 92,
    "synopsis": "Time and space collide when a possessed game grabs hold of two friends eager for a sinful night of sex and drugs in Indian auteur Q's first foray into horror.",
    "title": "Ludo",
    "year": 2015
}