{
    "countries": [
        "Japan"
    ],
    "description": "There are some pretty impressive video gaming records, and then there's the one held by Timothy McVey (not to be confused with convicted terrorist Timothy McVeigh). In 1984, he set a goal to score the highest number of points (one billion) ever recorded on an arcade game. Tim entered the famous Twin Galaxies arcade, put a single quarter into a now-forgotten game called Nibbler — the first coin-op to allow such a score — and 44.5 hours later, he emerged, mission accomplished. And for almost 25 years he believed he held that record until he learned of an Italian kickboxer named Enrico Zanetti.\n\nAs it turns out, all the way back in 1984, Enrico, inspired by coverage of Tim's record-setting run, decided he was going to trump the colossal score. But due to a lack of proper evidence, Twin Galaxies refuses to acknowledge Enrico's feat. The mere idea of his record being threatened inspires Tim to give it another try, this time setting out to beat Enrico's score. However, he now carries 25 years of wear and tear on his mind and body and faces a new challenger, video game bad boy Dwayne Richard, who is every bit as eccentric as Tim is unassuming.\n\nMAN VS SNAKE: THE LONG AND TWISTED TALE OF NIBBLER is a fascinating and endearing competition doc featuring a protagonist who, quite uniquely, refuses to be larger-than-life. Tim's motivations for re-tackling his insane challenge — both in terms of sheer size of the score needed and the almost inhuman endurance required to reach it — are as humble as the man himself. Billy Mitchell, up to his usual brand of coin-op shenanigans and self-promotion, finds his way into the mix, and the referee here is Twin Galaxies founder Walter Day. The thrilling saga that unfolds is one of quarters, Monster Energy drink and, of course, Nibbler. (Brian Kelley)",
    "directors": [
        "Andrew Seklir",
        "Tim Kinzy"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/man-vs-snake"
    },
    "runtime": 92,
    "synopsis": "1984. One shiny quarter. 44.5 hours of continuous play. The race to be the first gamer in history to score one BILLION points. Until recently, Timothy McVey (not the terrorist) thought he had — for all these years — held the world record on Nibbler.",
    "title": "Man vs Snake",
    "year": 2015
}