{
    "synopsis": "Mads Mikkelsen as only his longtime absurdist Danish collaborator Anders Thomas Jensen could conceive — a far-beyond-chronic masturbator with a hair-trigger temper — desperately searches for his true identity.",
    "description": "If Dr. Moreau pulled out the DNA of the best comedies that have ever played Fantastic Fest, and threw them all in his genetic blender to create the perfect mutant comedy, the end result would surely be MEN & CHICKEN, Anders Thomas Jensen's first directorial film in ten years. To explain all the reasons would completely spoil the movie, but feel confident that Anders is playing in the same world that FLICKERING LIGHTS, THE GREEN BUTCHERS and ADAM'S APPLES all existed in, and he's still trying to top himself.\n\nMads Mikkelsen, now an A-list Hollywood star and debonair leading man, allows his long-time collaborator Anders Thomas Jensen to transform him into Elias, one of the least appealing humans ever to shine on the silver screen. Elias and his better-adjusted brother Gabriel find out after the death of their father (through a bizarre videotaped will/confessional) that they were adopted and have different mothers. In their search for their real parents, they stumble upon three new brothers who are living in an abandoned and decaying sanatorium. All five of them share similar traits including a severe cleft lip and a problem with anger management. More importantly, however, they are varying degrees of strange and none seem quite capable of living a normal life in Danish society. To make matters even more unsettling for Gabriel and Elias, their new brothers have a penchant for unexpected blunt force head trauma. And there's something about the chickens wandering the off-limits basement that's more than a little bit foreboding... (James Shapiro)",
    "title": "Men and Chicken",
    "runtime": 100,
    "directors": [
        "Anders Thomas Jensen"
    ],
    "year": 2015,
    "countries": [
        "Denmark"
    ]
}