{
    "countries": [
        "South Korea"
    ],
    "description": "Salaryman Kim Byung-Guk returns home one evening and brutally murders his entire family with a hammer. When the police bring news of his deed to the office the next day, everyone is shocked; in particular Lee, the troubled intern whom Kim treated pleasantly. While the police try to get clues from the CCTV recordings of the cameras, the rest of the workers try to tell them as little as possible. They don't want any of the inner workings of the business exposed and are even prepared to bully Lee to stop her from talking.\n\nAs the work routine slowly goes back to normal, paranoia starts to run rife amongst the workers. Multiple sightings of Kim suggest he might indeed be still hiding within the building. And with a new quarterly report due, everyone's hidden animosity rises to the surface.\n\nBut what is the real secret behind Kim's vicious killings? And exactly who is murdering the rest of the office workers?\n\nA biting corporate satire hiding behind the traditional veneer of a slasher film, OFFICE is one of the most manic and entertaining films to come out of South Korea or any country in recent years. Blessed with inventive deaths, terrific performances and a sub-sonic soundtrack that seems to be entirely composed of workplace noises, director Hong-Won Chan creates a space familiar to anyone who has ever been inside a corporation and yet something entirely new and menacing.\n\nNot skimping out on the visceral, this striking directorial debut from the writer of the brilliant THE YELLOW SEA is an entertaining ghost train of a film. It's full of eerie bumps and big drops which are certain to both scare and entertain.(Evrim Ersoy)",
    "directors": [
        "HONG Won-Chan"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/office"
    },
    "runtime": 111,
    "synopsis": "OFFICE is the story of Kim, the salaryman who one day brutally murders his entire family with a hammer, and Lee, the put-upon intern at his workplace. This dark-as-night corporate satire hides behind a slasher veneer with scares so well timed, you'll jump out of your seat non-stop.",
    "title": "Office",
    "year": 2015
}