{
    "synopsis": "Four violent criminals escaping a robbery take a man, an ailing child and a young woman on a nightmarish road trip in this remake of Mario Bava's near-lost Euro-crime nasty.",
    "description": "Mario Bava's late-career Poliziotteschi film stands as one of his most nihilistic efforts and troubled releases. The film, which was completed in 1974 but tangled in release-preventing legal disputes remained unseen until 1996.  It follows a group of robbers whose bloody and bullet-filled escape sees them taking hostage a young woman as well as a father and his critically ill child. As they hit the road with their captives, tensions run high amongst the kidnappers and they leave a trail of violence across the Italian countryside.\n\nLongtime producer Éric Hannezo's directorial debut is a remake in the purest sense, changing quite little in terms of plotting and characters. And fortunately for us, all of the nihilism, grittiness, intensity and bursts of graphic violence remain firmly intact. What Hannezo does is replace the bleak realism of Bava's low-budget Italo-crime nasty with the slick polish of modern day French thrillers. The stunning result is a something of an amped-up nightmarish version of the original.\n\nDropping the near real-time flow of Bava's original cut of RABID and taking the kidnappers and their hostages into the night, things become increasingly surreal. Further adding to the twisted dream feeling is Laurent Eyquem's incredible score — a remake in its own right — which takes immediately recognizable cues from Stelvio Cipriani's original and blends them with more modern sounds to create an astonishing electronic soundscape.\n\nRABID DOGS is a great example of how to cleverly update and remake a film while paying due respect to the original source material. With any luck, it will also help people discover Bava's almost-lost original, which shows that the master was the master up until the very end. (Brian Kelley)",
    "directors": [
        "Eric Hannezo"
    ],
    "runtime": 99,
    "year": 2015,
    "countries": [
        "France"
    ],
    "title": "Rabid Dogs"
}