{
    "countries": [
        "Turkey"
    ],
    "description": "Proving that you don't need to go all the way down under to discover celluloid madness, REMAKE, REMIX, RIP-OFF presents the story of Yesilcam, home of the Turkish film industry, which has created more than 7000 films in its hundred year history.\n\nOperating under a very loose copyright law, Turkish producers and directors remade hundreds (if not thousands) of European, American and Indian movies using nothing but limited resources and a lot of heart. If they couldn't recreate it, they'd steal whatever they needed directly, adapting stories to fit the tastes of local audiences.\n\nWith turnarounds as fast as three days and nary a thought for safety, directors threw stuntmen off rooftops, created epic fights, and made low-budget versions of superheroes out of duct tape, bailing wire and pantyhose. All was acceptable as long as the shot was in the can.\n\nREMAKE, REMIX, RIP-OFF is the most comprehensive documentary ever made on a madcap time within this madcap industry. Featuring interviews with major Turkish stars, directors, stuntmen and more, the stories have to be seen to be believed. imagine HEART OF DARKNESS turned up to 1000 and you're nowhere even close to the experience of seeing the films and the story of what happened behind the scenes.\n\nMeet the sedan-driving Turkish Spiderman, who, over the Atlantic, became the most evil villain you've ever met, with a penchant for putting ladies' faces into motorboat blades. Experience the epic being that is Cuneyt Arkin, star of over 700 Turkish genre movies whose take on STAR WARS still remains the most enigmatically insane piece of filmmaking ever. Find out exactly how Captain America ended up teaming up with the most famous luchador from South America. And more. Much, much more.\n\nSit back, relax and lose yourself in the insanity. Once the curtain comes down, you'll never look at cinema the same way again. (Evrim Ersoy)",
    "directors": [
        "Cem Kaya"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/remak-remix-rip-off"
    },
    "runtime": 96,
    "synopsis": "Welcome to Turkey. It's home to Yesilcam, the Turkish Hollywood where, in the late '70s, dreams were built on nothing more than a dime. Both a loving tribute to the burgeoning cinema of this young country and a trip into history, REMAKE, REMIX, RIP-OFF brings you the most outlandish story you've never heard: filmmaking so dangerous you need a safety harness just to watch.",
    "title": "Remake, Remix, Rip-Off",
    "year": 2015
}