{
    "countries": [
        "Canada",
        "Lao People's Democratic Republic"
    ],
    "description": "John works as a volunteer doctor at an NGO clinic in northern Laos. He's a dedicated man, clearly troubled by his past, and is desperate to make amends. However his desire to do right will mean going on the run when he tries to stop the rape of a young girl at the hands of an Australian tourist and his intervention doesn't go as planned.\n\nJamie M. Dagg's directorial debut is a low budget wonder. Often devoid of dialogue, the film ratchets up tension and keeps an incredible pace as we follow John on a nonstop sprint to safety. Imagine a much sweatier RUN LOLA RUN through some really inhospitable territory.\n\nLaos is presented as a beautiful, otherworldly location, as strange to John as it is to us. As he goes deeper into the country, trying every desperate route back to sanctuary at his clinic, we see its different facets. From the riverside houses to the fields, from the desolate countryside to the bustling cities, it plays as much a leading role as any of the actors.\n\nThe sense of tension and motion in RIVER is nothing short of astonishing. The film seems to propel itself forward, following John without ever judging his actions, a man who's smart but can make decisions that seem incredibly naïve at times. Through it all is the fantastic performance by Rossif Sutherland which grounds the entire film with a sense of reality. Though we may not agree with his choices, it's hard not to believe in John as a man just doing what he thinks is best in a murky moral conundrum.\n\nTaut and thrilling, RIVER is a cleverly constructed thriller that drags the audience kicking and screaming through a nightmarish trip. It's a one-way ticket into despair with a man who, even in the worst hour, still manages to hold on to his humanity. (Evrim Ersoy)",
    "directors": [
        "Jamie Dagg"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/river"
    },
    "runtime": 88,
    "synopsis": "John, a volunteer doctor, finds himself on the run in Cambodia when he tries to stop the rape of a drunk girl at the hands of a boorish Australian tourist.",
    "title": "River",
    "year": 2015
}