{
    "countries": [
        "United States"
    ],
    "description": "In the 1980s, everywhere you turned there were warnings about a widespread evil conspiracy to indoctrinate the vulnerable through the media they consumed. This percolating cultural hysteria, now known as the \"Satanic Panic,\" was both illuminated and propagated through almost every pop culture pathway in the 1980s, from heavy metal music to Dungeons & Dragons role playing games, Christian comics, direct-to-VHS scare films, pulp paperbacks, Saturday morning cartoons and TV talk shows —and created its own fascinating cultural legacy of Satan-battling video tapes, music and literature.\n\nAfter debuting with the anthology book KID POWER!, micro-press publisher Spectacular Optical is back with book two: SATANIC PANIC: POP-CULTURAL PARANOIA IN THE 1980s. And to celebrate it, we'll be screening one of the films featured prominently in the book for its integration of Satanic ritual and 80s-era technophobia: Eric Weston's cult favorite EVILSPEAK, starring Clint Howard as bullied teen Stanley Coopersmith, who calls on Satan through his new Apple II computer to get revenge.\n\nThe film will be preceded by a presentation and clip show of some of the era's most notorious news segments and an introduction by SATANIC PANIC co-editor Kier-La Janisse with several of the contributing authors, including local one-man band John Schooley, who wrote the book's afterword only days after the Texas Court of Criminal Appeals overturned the convictions of Austin-area daycare owners Dan and Fran Keller. Also, Dave Canfield and Forrest Jackson who will tell personal anecdotes about their interactions with controversial celebrity evangelists Mike Warnke and Bob Larson.\n\nFrom con artists to pranksters and moralists to martyrs, SATANIC PANIC: POP-CULTURAL PARANOIA IN THE 1980s aims to capture the untold story of the how the Satanic Panic was fought on the pop culture frontlines and the serious consequences it had for many involved. (Kier-la Janisse)",
    "directors": [
        "Eric Weston"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/satanic-panic-book-launch-screening-of-evilspeak-in-35mm"
    },
    "runtime": 97,
    "synopsis": "The hysteria known as the \"Satanic Panic\" made its way through every pop-culture pathway in the '80s. Relive the era with the launch of SATANIC PANIC: POP CULTURAL PARANOIA IN THE 1980s and a rare 35mm screening of occult fave EVILSPEAK.",
    "title": "Satanic Panic Book Launch + Screening of Evilspeak (In 35mm!)",
    "year": 1981
}