{
    "countries": [
        "Belgium"
    ],
    "description": "This should be a very simple day for Schneider. A domestic day. His day. It is, after all, his birthday, which he intends to spend helping his wife and two lovely daughters with preparations for his own party.  But those plans are all thrown out the window with a single phone call.\n\n\"Ramon Bax must be killed,\" it says. \"It has to happen today.\" And, as if to underscore the urgency, \"He is a child killer.\" And so, with a sigh and a groan, Schneider's quiet day off is canceled and it's back to his secret life as a contract killer. If there's an upside, though, it's that Bax lives close enough that the job should be done by lunch.\n\nThings never go as planned in this life, and that's certainly the case in the darkly constructed fantasies of Dutch auteur Alex van Warmerdam (BORGMAN), who slyly turns the hitman genre on its head with his latest effort, SCHNEIDER VS. BAX.\n\nBax (played by Van Warmerdam himself) turns out to be a more formidable target than first assumed, one that comes with a witness – his emotionally unstable daughter – that Schneider must deal with. Throw in a string of unanticipated obstacles and Schneider's fastidiously planned day is quickly shot to hell.\n\nFollowing the deep (and dark) thematic work of his previous BORGMAN, van Warmerdam here sets out to deliver the polar opposite, a pure piece of entertainment, and he delivers a delicious comedy of errors (and bullets) that unfolds with his trademark precision and sly wit. Flawlessly cast and delivered in the helmer's deadpan style, SCHNEIDER VS. BAX may never break beyond a brisk walking pace but it's nevertheless a wry and sly romp. (Todd Brown)",
    "directors": [
        "Alex van Warmerdam"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/schneider-vs-bax"
    },
    "runtime": 96,
    "synopsis": "A contract killer's birthday plans are disrupted when he's sent to dispatch a drunken writer in this delightfully dark comedy from Dutch auteur Alex van Warmerdam (BORGMAN).",
    "title": "Schneider vs Bax",
    "year": 2015
}