{
    "countries": [
        "Sweden"
    ],
    "description": "Somewhere in Sweden, Caroline Menard prepares for a new life. The past has not been good to her, and she has lost almost everything she has ever cared for in the world. Moving into an old apartment, all she wants is a chance at a new life. However, strange and inexplicable things start to happen around her, threatening any sense of sanity left. And her weird neighbors appear to be holding back information from her. She begins to realize that there might be something ancient within the block, searching for her.\n\nBeautifully shot and hauntingly scored, SENSORIA is a traditional ghost story with a twist. Filled with slow dread accentuated by excellent performances, the film builds a razor-sharp atmosphere that engages and intrigues throughout. Add to this a beautifully muted color palette that suggests a country permanently bathed in melancholia, and the end result is a haunting ride through loss and madness carrying wide influences all the way from M. R. James to Roman Polanski.\n\nThis is the debut effort from genre veteran Christian Hallman, who is not only the man behind the brilliant Lund International Fantastic Film Festival in Sweden, but is also a seasoned genre film producer. Clearly, his years of toiling behind the scenes has paid off as SENSORIA marks Hallman as a talent to watch, with a keen eye on sense of location and mood.\n\nBoth low-key and gentle, SENSORIA might not have the jump-scare tactics of recent ghost films… but it doesn't need them. With assured set-pieces, a haunting atmosphere and a beautiful score by Frank Illfman (who composed the recent Fantastic Fest favorite BIG BAD WOLVES), SENSORIA more than earns it scares the old-fashioned way. It's a haunting and wonderful trip into the ghostly heart of Sweden. (Evrim Ersoy)",
    "directors": [
        "Christian Hallman"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/sensoria"
    },
    "runtime": 82,
    "synopsis": "Caroline Menard is a woman in her thirties who has lost everything. As she moves into a new apartment searching for a new start, she's unaware that something ancient is waiting for her.",
    "title": "Sensoria",
    "year": 2015
}