{
    "countries": [
        "Hungary"
    ],
    "description": "October 1944, Auschwitz-Birkenau.\n\nSaul Auslander is a Hungarian member of the Sonderkommando, a group of Jewish prisoners isolated from the camp and forced to assist the Nazis in the machinery of large-scale extermination. While working in one of the crematoriums, he discovers the dead body of a boy he takes for his son.\n\nAs the Sonderkommando plans a rebellion, Saul decides to carry out an impossible task: save the child's body from the flames, find a rabbi to recite the mourner's Kaddish, and offer the boy a proper burial.\n\nIn the hands of a visionary artist, the small story of a father seeking a proper burial for his son blossoms into one of the most taut thrillers of the year, that just so happens to have the saga of Auschwitz unfolding in the unused corners of every frame. Brilliant storytelling, an absolutely fresh visual language and incredible performances make SON OF SAUL, László Nemes feature debut, seem a near shoo-in for this year's best foreign language Oscar.\n\nOf all the films in this year's Fantastic Fest lineup, SON OF SAUL best exemplifies the type of film we love to champion at Fantastic Fest: a true genre-defying masterpiece. We don't like to label films as horror, thriller, drama or sci-fi. Rather, we seek out the best storytellers who happen to tread in dark, challenging and disturbing waters. And on that basis, SON OF SAUL fits squarely in our wheelhouse.",
    "directors": [
        "László Nemes"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/son-of-saul"
    },
    "runtime": 107,
    "synopsis": "Saul Ausländer is a Hungarian member of the Sonderkommando, the group of Jewish prisoners isolated from the camp and forced to assist the Nazis in the machinery of large-scale extermination. While working in one of the crematoriums, Saul discovers the dead body of a boy he takes for his son. As the Sonderkommando plans a rebellion, Saul decides to carry out an impossible task: save the child's body from the flames, find a rabbi to recite the mourner's Kaddish and offer the boy a proper burial.",
    "title": "Son of Saul",
    "year": 2015
}