{
    "countries": [
        "United States"
    ],
    "description": "Five groups of weary travellers will discover the reality behind their innermost fears while traveling on a long, lonely stretch of desert highway. There's two men on the run from something which neither of them can explain, a girl band stranded with some car trouble, a family man who's involved in an accident, a brother coming to the end of his search for his long-lost sister, and a family en-route to a holiday house for one final trip together before their daughter leaves for school. All are different and yet connected, and by the end of the trip, all will understand the cruel, uncaring nature of a universe which plays havoc with its inhabitants' lives.\n\nOwing as much to classic TWILIGHT ZONE episodes as the recent outpouring of anthology films, SOUTHBOUND plays meaner, leaner and more frightening than most of its counterparts. Rather than relying on simple jolts and twists to deliver the thrills, the film sets itself up in the long game; as each story reveals yet a little more of the overall world, the frightening whole becomes clearer.\n\nParticular attention can be paid to David Bruckner's segment in which a man's involvement in a car accident and his honest desire to help will throw him into a gruesome road of chaos. Both cringe-inducing and containing one of the meanest codas in a long time, this segment exemplifies the quality of filmmaking prominent throughout the film.\n\nSOUTHBOUND is an anthology with all the fat cut off. It's a lean, mean wonder ride into the dark corners of a vicious universe and will be sure to delight any audience member brave enough to thumb a ride in its dark cars. (Evrim Ersoy)",
    "directors": [
        "Radio Silence",
        "Roxanne Benjamin",
        "Patrick Horvath",
        "David Bruckner"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/southbound"
    },
    "runtime": 87,
    "synopsis": "Somewhere on a stretch of desert highway, five groups of travelers will find themselves confronting an ever-changing feeling of dread through five interlocking, horrific stories.",
    "title": "Southbound",
    "year": 2015
}