{
    "countries": [
        "Republic Of"
    ],
    "description": "Seowon, Chuwon, Gurim and Desung have been best friends their whole lives. Gurim is the cool one, always strumming his guitar with young girls hanging on every note. His indifference to the women he attracts drives the other guys nuts. Chuwon is a runner, constantly hoofing along the track at school. It's all he cares about. Seowon is the nerd, and spends most of his time with his nose stuck in a book, convinced that studying will solve everything. And then there's Desung, who's defined by his relationship. The only problem is that the relationship is with his friend Taisek's mom, Mia. But right or wrong, Desung is in love, and first love is a powerful thing. The gang sticks together even when things get tough with their overbearing teacher Mr. Park.\n\nCut to a few years later, Gurim has scored a K-pop hit and is the most searched name on the internet. Chuwon is still running and Desung is still in love with Mia, even after a horrible tragedy. Seowon has taken his nerd skills to the university level and his pining-for-girls skills have gone pro. With high school memories starting to fade and real-life concerns looming, they'll only have each other to lean on.\n\nA Fantastic Fest alum who directed last year's brilliant and unsettling I AM TRASH, Sang-woo has returned with a vengeance, landing two films in this year's lineup. SPEED is a film about sex, love, growing up, and the bonds of friendship. He patiently build the nuanced characters and then pulls you along on the ride almost as if you were one of the characters. It never shies away from dysphoria but is just as quick to make you laugh. A beautifully made and deeply emotional film, SPEED is a clear confirmation that up-and-comer Lee Sang-woo is here to stay. (Luke Mullen)",
    "directors": [
        "Lee Sang-woo"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/speed"
    },
    "runtime": 104,
    "synopsis": "Four friends navigate sex, love and life in a heart-breaking new film from Korean auteur and Fantastic Fest favorite Lee Sang-woo.",
    "title": "Speed",
    "year": 2015
}