{
    "countries": [
        "United Kingdom"
    ],
    "description": "In this experimental essay-film, which hypnotically scans the contents of a well-worn video tape, Ross Sutherland has created something of a SANS SOLEIL for the VHS generation. A masterful synthesis of mash-up editing and performance art, Sutherland collides a parade of taped-off-TV media with the his own poetic commentary, ruminating on memory, nostalgia, grief and death, while eulogizing his grandfather, the former custodian and de-facto creator of this analog artifact.\n\nJust as Pink Floyd's \"Dark Side of the Moon\" inadvertently casts new meaning on THE WIZARD OF OZ when synchronized, Sutherland's rap-infused narration similarly transforms recordings of GHOSTBUSTERS and THE FRESH PRINCE OF BEL-AIR, among other pop-cultural touchstones. Also included is a bevy of hilariously inane television commercials, inscribing both profound and sometimes devastating anecdotal associations, but also frequently hilarious interpretations reminiscent of ROOM 237 hyperbole and MST3K riffing.\n\nAn analysis of the intro to FRESH PRINCE reveals a hidden death dream narrative, the looping of a British bank advert hilariously spins into a Kafka-esque nightmare, and the slow-motion playback of Bill Murray's Peter Venkmen getting slimed becomes the site of asthmatic trauma. And though Sutherland's synchronicity is filtered through the lens of his own personal history, his observations are affectingly universal; sure to resonate with anyone who has ever lost a loved one, only to recognize them in the lyrics of a song, the colors of painting, or in between the tracking-lines on the images that haunt a magnetic tape. (Peter Kuplowsky)",
    "directors": [
        "Ross Sutherland"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/stand-by-for-tape-back-up"
    },
    "runtime": 65,
    "synopsis": "Hypnotically scanning the contents of a VHS tape, this experimental essay-film eulogizes the former custodian of the analog artifact, transforming its recordings of GHOSTBUSTERS and FRESH PRINCE (among others) through rap-infused anecdotal narration, and inscribing both profound and hilarious associations to the tracking-lined images.  STAND BY FOR TAPE BACK-UP will be presented as both a traditional screening as well as a live performance by creator Ross Sutherland.",
    "title": "Stand by for Tape Back-up",
    "year": 2015
}