{
    "countries": [
        "France"
    ],
    "description": "We begin in the kingdom of Longtrellis, with a queen longing for a child of her own. When a mysterious figure arrives with a way for her to become pregnant, she immediately fulfills the requirements despite warnings of grave consequences. True to his word, she becomes pregnant and gives birth to a son. But another young woman involved in the ritual become pregnant as well and the two boys become inseparable friends, much to the queen's dismay. Her desire to keep them apart will have a dire impact on all of their lives.\n\nNot far away in the kingdom of Strongcliff, the king is busy bedding as many of his female subjects as humanly possible, sometimes two at a time. Stumbling through the castle one morning, still shaking off the cobwebs of the previous night's adventures, he hears a beautiful voice singing in the bright sun. Drawn to the siren song, he calls to her but she flees back into her home. Never one to back down from a challenge, he knocks at her door later that evening. But she's devised a surprise for the unsuspecting king…\n\nAnd finally, in the kingdom of Highhills, the king spends most of his time obsessed with a rather odd pet. Meanwhile his daughter, Princess Violet, grows restless to marry, but the king is not yet ready to part with her. His pet's untimely death inspires the king to concoct a bizarre tournament for the hand of his daughter. Assuming his challenge to be unsolvable, the king feels smug as suitor after suitor is turned away. But one lowly citizen may have the specific skills to foil the king's clever plan.\n\nBased loosely on Giambattista Basille's book The Tale of Tales, Italian auteur and Cannes Film Festival royalty Matteo Garrone has crafted a hard-edged and darkly comic fairytale. The narrative bounces effortlessly between the three stories and the incredible cast (including Salma Hayek, Vincent Cassel, Toby Jones and John C. Reilly) all deliver fantastic performances. Not since THE PRINCESS BRIDE has such a spirited fantasy yarn been told with such gleeful charm. (Luke Mullen)",
    "directors": [
        "Matteo Garrone"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/tale-of-tales"
    },
    "runtime": 125,
    "synopsis": "Monsters, magic and mayhem abound in the incredible stories of three royal families from nearby kingdoms in this ambitious fairy tale epic from acclaimed Italian auteur Matteo Garrone (GOMORRAH, REALITY).",
    "title": "Tale of Tales",
    "year": 2015
}