{
    "synopsis": "Based on one of the most popular comic strips in Turkey. this rip-roaring adventure sees Tarkan and his trusty wolf companion Kurt take on the despicable Viking invaders after they leave him for dead!",
    "description": "Created by Sezgin Burak as a daily strip in 1967, Tarkan is one of the most popular comics in Turkey. Adapted multiple times to film, it's the story of a fictional Hun warrior and his trusty wolf companion named \"Kurt\" (which means wolf in Turkish!) and their adventures during a very turbulent time in history. Mixing historical fact with fictional brilliance, Tarkan is a beloved and much admired creation of Turkish pop culture.\n\nTARKAN VS. THE VIKINGS represents a pinnacle of the adaptation of these comics. It's a pared down story of revenge, where Tarkan takes on the dreaded Viking invaders who make the mistake of crossing his path in an ambush. As if Vikings aren't enough, Tarkan will also have to face off with a mythical giant octopus to ensure the safety of his people.\n\nAnyone who has seen CONAN and its ilk will be familiar with the structure and characters of Tarkan, but director Mehmet Aslan filters the familiar history/fantasy through a uniquely Turkish lens. The source material relies heavily on Anatolian and Turkish history, and with this unique filter, the end result is unlike anything Western audiences may have seen. Add to this a dashing hero in Kartal Tibet, one of THE leading men of the period, and a roster of fantastic character actors, and it becomes an incredible experience.\n\nPerhaps the end result is not as epic as a bigger budget would allow — some sets are shaky and the giant octopus has to be seen to be believed — but behind the lo-fi B-grade execution lies a genuinely charming ride which will delight and astound all those who dare take it. ATIL, KURT! (Evrim Ersoy)",
    "directors": [
        "Mehmet Aslan"
    ],
    "runtime": 86,
    "year": 1971,
    "countries": [
        "Turkey"
    ],
    "title": "Tarkan Vs the Viking"
}