{
    "countries": [
        "Hong Kong"
    ],
    "description": "Revenge is a dish best served poled. When the honorable, spear-wielding Yang family's patriarch and five of his seven sons are slaughtered by a traitorous general, the family descends into chaos. Son # 6 (Alexander Fu Sheng) manages to return home but loses his mind, and the fifth son (Gordon Liu) goes on the run with dreams of avenging his father and brothers. Where this plot would have continued from this juncture was forever altered by the untimely death of Alexander Fu Sheng in a tragic car accident. The sadness of his departure radiates through what was already a dark story, imbuing it with a palpable sense of mourning and loss.\n\nThings don't remain too funereal, though, as the focus shifts to Gordon Liu's struggles to gain admittance into a Buddhist monastery. Burning rage and bloodlust aren't compatible with the monks' beliefs, but Liu's persistence and tenacity eventually lead to one of the briefest, yet most thrilling training sections ever captured on film.\n\nDirector/choreographer Lau Kar-Leung was one of the best to ever live, beginning life as a devout martial artist trained by pupils of the legendary Wong Fei-Hung and rising to prominence in the Shaw Brothers stable by working under Chang Cheh. Directing his adopted brother Gordon Liu, EIGHT DIAGRAM POLE FIGHTER represents masters at the peak of their craft. The fights are fast, furious, and graceful with attention to style and detail that only an actual practitioner could bring. This may be the apex of the kung fu film as an art form. It's operatic, emotionally moving, and still manages to bring the house down with a brutal climax that will leave jaws literally on the floor. (Laird Jimenez)",
    "directors": [
        "Chia-Liang Liu"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-8-diagram-pole-fighter"
    },
    "runtime": 98,
    "synopsis": "The great martial arts choreographer Lau Kar-Leung directs this dark tale of betrayal, vengeance and honor, starring Gordon Liu and Alexander Fu Sheng (in his final screen role) as the sole surviving sons of a powerful family massacred in an act of brutal treachery.",
    "title": "The Eight Diagram Pole Fighter",
    "year": 1984
}