{
    "countries": [
        "United States"
    ],
    "description": "Grief is a powerful cinematic emotion. It can inspire characters to murder their way to vengeance or bind characters together and find them strength to move forward in the darkest of times. In THE INVITATION, grief propels the main character into forced responsibility. He doesn't want to put the animal he just hit with his car out of its misery, but he knows he has to. He doesn't want to attend a dinner party being thrown by his ex-wife and her new husband in his old home, but he knows he has to. And he doesn't want to stay at the party any longer when it becomes clear that something possibly insidious is behind his host's motivations for bringing their group of friends together, but he does... because he knows he has to.\n\nKaryn Kusama's (GIRL FIGHT) first feature in six years is a glorious achievement as a slow burn thriller. There's much to admire in her latest, but the film's greatest asset is its ability to make the audience constantly question whether the point of view the protagonist is conveying is wholly reliable and its subversion of expectations. Will (Logan Marshall-Green) is so consumed with grief that you can never quite trust that what you're seeing through his eyes is really happening in the narrative. Thrillers build to a suitable climax where emotions are released and tensions are resolved, one way or another. With THE INVITATION, however, you can never count on where the story is headed. So if you don't quite trust what you're seeing, and can't trust your own expectations about where the movie is going, you have no choice but to grip your armrests and let the white-knuckle third act unfold. (James Shapiro)",
    "directors": [
        "Karyn Kusama"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-invitation"
    },
    "runtime": 97,
    "synopsis": "A haunted man attends a dinner party at the house he once called home and is gripped with paranoia that his ex-wife and her new husband are harboring an insidious agenda.",
    "title": "The Invitation",
    "year": 2015
}