{
    "countries": [
        "Japan"
    ],
    "description": "Ren is a nine-year-old kid hiding out from his distant relatives on the streets of Shibuya. His entry into an alternate world ends in an encounter with a bear warrior named Kumatetsu, who offers Ren the chance to become his apprentice. Although Ren is resistant at first, seeing Kumatetsu battle soon changes his mind, and before long, the two have become the unlikeliest of friends.\n\nMamoru Hosada returns to the big screen with yet another uncategorizable tale that'll win over everyone in the audience. THE BOY AND THE BEAST has all the trademarks of a classic Hosada film: a fantasy world which has its roots in reality, populated with richly nuanced, engaging characters whose fates the audience cares deeply about.\n\nAt first glance, the film may seem like it's most focused on battles between the beast warriors (which, indeed, are epic), but it spends equal time in the developing the friendship between master and apprentice as well as Ren's journey into adulthood. Hosada's nimble juggling of genres and emotional strands pays off in an incredible climax where all worlds collide and each of the characters find themselves tested.\n\nTHE BOY AND THE BEAST is also an amazing visual accomplishment. Both beasts and humans are beautifully realized with incredible detail, especially present when establishing the expression of subtle emotions. Stunning battle scenes combine adrenaline with emotional impact. The details of the beast world are the final winning touch, with Shibuya captured beautifully in both its real and fantasy version.\n.\nThis is the sort of film that comes out of nowhere and catches you unaware. It's a genuine gem that is likely to get people talking all the way through the end of the festival. (Evrim Ersoy)",
    "directors": [
        "Mamoru Hosoda"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-boy-and-the-beast"
    },
    "runtime": 119,
    "synopsis": "In the latest breathtaking animation by Fantastic Fest veteran Mamoru Hosoda (SUMMER WARS, THE GIRL WHO LEAPT THROUGH TIME), nine-year-old Ren becomes the apprentice to beast warrior Kumatetsu and finds himself on the adventure of a lifetime in the beast world Jutengal.",
    "title": "The Boy and the Beast",
    "year": 2015
}