{
    "countries": [
        "United States"
    ],
    "description": "A struggling painter (Ethan Embry) finds his dream home in rural Texas. Twice the size of their previous tiny flat, the house has enough room for his wife and daughter to spread out as well as a huge space he can use as a studio. Unfortunately, he doesn't realize that the previous occupant of the house hasn't entirely left. Taunted by satanic voices, Ray is on a collision course from which no one will remain unscathed.\n\nIn his THE LOVED ONES follow-up, director Sean Byrne cleverly deconstructs the haunted house movie; this is AMITYVILLE for an entirely new generation. Atmospheric, oppressive and damn scary, THE DEVIL'S CANDY combines classic thrills with a great heavy metal score to forge the sort of slam-bang genre ride we rarely get these days.\n\nThe cast is uniformly excellent, from the struggling family to the mysterious previous occupant; they are all people you deeply care about despite their flaws. Byrne's mise-en-scene and use of color is second to none, and the deepening layers of contrast and the relationships between scenes heighten the tension and create genuine unease.\n\nWhilst THE LOVED ONES was largely set within the confines of one home, Byrne here captures rural Texas with a keen eye. The isolation of the family is set against stark fields and abandoned roads. The weathered structures, the crumbling motels and the dusty town square give the impression of a place once teeming with life, but now eerily empty. Add to this a killer soundtrack and one of the best opening sequences of the year, and it's easy to see why THE DEVIL'S CANDY will be one of the most talked about titles of the festival. (Evrim Ersoy)",
    "directors": [
        "Sean Bryne"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-devils-candy"
    },
    "runtime": 90,
    "synopsis": "A struggling painter, his wife and their young daughter move into their dream house in rural Austin, but soon find themselves targeted by satanic forces and the house's previous occupants.",
    "title": "The Devil's Candy",
    "year": 2015
}