{
    "countries": [
        "Republic Of"
    ],
    "description": "Early sixteenth century Korea is under the rule of King Yeonsan, a psychotic despot who is delusional, violent and completely cruel. He's served by two retainers, a father/son duo who carefully manipulate the king and control both the court and the country. Using the king's madness to torment, they abuse and even kill their personal enemies with reckless abandon. Into this triangle of intrigue comes a lower class woman who has her own agenda in getting close to the mad ruler. There can only be one winner in this desperate battle between parties who all have their own hidden motives. Whoever wins, the end result will not be pretty.\n\nDirector Min Gyoo-Dong channels the spirit of the notorious CAT III films of the '80s in order to create a Korean exploitation title like no other. The notorious acts of the king push the boundaries of taste and decency, but these are all framed within the framework of a big-budget, sweeping historical epic. And they're also at least somewhat based in truth. During his bloody reign, King Yeonsan did actually enslave a thousand women from the provinces to serve as concubines and also converted the sacred Seonggyungwan University into his personal pleasure ground.\n\nBuilt into this carnival of deviance is court intrigue galore. The relationship between the father and son retainers is rocky to say the least, and the arrival of the vengeance-seeking woman only intensifies their clashes. Soon, the court is the most dangerous place to be and no one is safe from the king's whims, the retainer's battles or the courtesans' rivalry.\n\nBuilding to a climax that'd make Caligula blush, THE TREACHEROUS is a mad, colorful and outrageous attempt at marrying historical fact and exploitation inventiveness. Trust us, there's nothing in this year's line-up to match the brilliant outrage of the king's painting competition. Do not miss the most debaucherous film of this year's fest. (Evrim Ersoy)",
    "directors": [
        "Kyu-dong MIN"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-treacherous"
    },
    "runtime": 131,
    "synopsis": "Considered the worst tyrant in the long and rather oppressive history of Korea, King Yeonsan enslaved a thousand women to serve his carnal desires. This bawdy, unexpurgated (and almost surely exaggerated) tale of his sexual exploits is the heir apparent to the notorious 1980s era Hong Kong CAT III classics.",
    "title": "The Treacherous",
    "year": 2015
}