{
    "countries": [
        "Taiwan",
        "Province of China"
    ],
    "description": "A ninth century assassin (Shu Qi, JOURNEY TO THE WEST: CONQUERING THE DEMONS) fails to dispatch a corrupt government official when the presence of his young son stirs her heart. Returning to her monastery in disgrace, she's given a reprieve and instructed to return to her home province on a mission to murder her cousin, the ruling lord of the region and her former betrothed (Chang Chen, CROUCHING TIGER, HIDDEN DRAGON) as a means of curing her of her sentimentality. Upon her reluctant return, she discovers that the city is on a political knife's edge, at risk of falling out of favor with the Imperial Court, and party to a conspiracy between her cousin's jealous wife and a black magic wizard. Torn between compassion and duty, the assassin is pressed to decide where her allegiances lie.\n\nBeginning in stark monochrome before bursting into vivid 35mm color, Taiwan's chief art-house auteur Hou Hsiao-Hsien (CITY OF SADNESS; THE FLIGHT OF THE RED BALLOON) has conjured perhaps the most transfixing and beautiful wu-xia film of all time. Drawing from the patient and precise tradition of King Hu (whose seminal COME DRINK WITH ME is screening at this year's FANTASTIC FEST), Hou's action is a whirling dervish of percussive glimpses which punctuate the frame as if the warriors supernatural abilities are too agile to capture, but it's when the swords are sheathed that Hou's sublime talent for profound stillness manifests itself. Be it in the quiet play of children, a warrior's contemplative walk through a silver birch forest, or the immortal signature of cinema: the wind in the trees. There's a reason Hou won Best Director at Cannes. (Peter Kuplowsy)",
    "directors": [
        "Hou Hsiao-hsien"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-assassin"
    },
    "runtime": 104,
    "synopsis": "After failing to dispatch a corrupt government official, an assassin is disciplined by her master with a mission to murder her cousin (and former betrothed) in order to steal her heart against sentimentality. An immaculate and arresting romantic wu-xia from Taiwan's chief art-house auteur Hou Hsiao-Hsien.",
    "title": "The Assassin",
    "year": 2015
}