{
    "countries": [
        "Norway"
    ],
    "description": "Kristian and his wife Idun have a pretty great life. They have two children and live in the hills above the town of Geiranger, an idyllic vacation spot situated on the shores of a fjord overseen by the Akneset mountain pass in Norway. At any time, the mountain could collapse in a giant rockslide which would crash into the fjord below, creating a tsunami large enough to destroy the entire town. Kristian works as a geologist at a station that constantly monitors the mountain so they can give the occupants a warning to evacuate should the rockslide start. Or, at least, he used to, as he has somewhat reluctantly decided to take a new job with a large oil company. On his last day, two sensors appear to malfunction, and Kristian can't shake the feeling that the doomsday they're all expecting is imminent. He postpones his moving day to investigate the malfunction but has a hard time convincing his colleagues that the mountain is shifting. When more sensors start reporting strange readings, however, Kristian will find his worst fears realized.\n\nTHE WAVE is an epic that can easily stand toe-to-toe with the best American disaster films. It's rare to see a big-budget foreign entry in the disaster genre, let alone one this gripping. The cinematography is stunning, and the effects are on par with Hollywood blockbusters. Helmed by Roar Uthaug, the writer/director who made his mark with genre hit COLD PREY and went on to direct FF 2012 fan-favorite HELLFJORD, THE WAVE features fantastic performances from Norwegian genre veterans Kristoffer Joner and Ane Dahl Torp in the lead roles. An intense big-budget disaster film on a grand scale, THE WAVE would make Roland Emmerich stand up and cheer. (Luke Mullen)",
    "directors": [
        "Roar Uthaug"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/the-wave"
    },
    "runtime": 105,
    "synopsis": "A Norwegian geologist and his family fight for their lives after the Akneset mountain pass crumbles into the fjord below, creating a huge tsunami that threatens to wipe out their town.",
    "title": "The Wave",
    "year": 2015
}