{
    "synopsis": "An idyllic suburban summer is shattered with the outbreak of an unexplained disease. With residents forced into quarantine with no explanation, the situation quickly spirals out of control.",
    "description": "The summer is shaping up to be perfect for the Johansson family. The weather is gorgeous, and the community warm and friendly. Even teenaged Gustav is feeling good about life in general, thanks to the new girl who has just moved in across the street. But this perfect suburban life is abruptly shattered by the arrival of a mysterious virus. Unexplained deaths are followed by panic and a full lockdown, families sealed into their homes by patrolling bio-suited soldiers. With things quickly escalating and no information forthcoming, it isn't long before Gustav takes matters into his own hands.\n\nThe debut feature from writer-director Bo Mikkelsen, WHAT WE BECOME offers a compelling vision of life pushed to extremes. A gorgeously executed picture that prizes its characters as much as the elements of genre film, WHAT WE BECOME exemplifies the new Nordic Twilight movement – a wave of intelligent, character driven genre pictures including the likes of LET THE RIGHT ONE IN and WHEN ANIMALS DREAM.\n\nBlessed with a uniformly strong cast, Mikkelsen is not shy at all about the horror elements of his debut picture, but is also smart enough to understand that the lasting resonance – the real weight of the film – comes from first creating a believable and empathetic cast of characters. The horror that unfolds is all the more terrifying for just how grounded and plausible it all is. An accomplished editor and cinematographer as well as a writer-director with a solid handful of high end short films under his belt, Mikkelsen arrives on the scene seemingly fully formed with his debut feature. Expect this to be the beginning of a long and compelling career. (Todd Brown)",
    "directors": [
        "Bo Mikkelsen"
    ],
    "runtime": 85,
    "year": 2015,
    "countries": [
        "Denmark"
    ],
    "title": "What We Become"
}