{
    "countries": [
        "United States"
    ],
    "description": "Clean up, carrots, cucumbers and zucchinis, produce aisle!\n\nIt all began with Candid Camera, Allen Funt's top-rated TV show where people's reactions to engineered sight gags and unexpected events were filmed for voyeuristic audience enjoyment. But it wasn't until Funt extended his concept into the burgeoning Adults Only arena with the movie WHAT DO YOU SAY TO A NAKED LADY that filmmakers realized sex documentaries didn't only have to be portentously serious about the language of love, gender reassignment or venereal disease. No, they could be fun, side-splitting and outrageous while providing a fascinating glimpse into Joe Public's newly relaxed attitude towards all things erotic in the wake of the transitional 1960s sexual revolution.\n\nHence the reason why this obscure softcore item had such a long shelf life on the grindhouse circuit during the early 1970s. From Ohio to Texas, THE X-RATED SUPERMARKET was double-billed with a fast array of popular attractions like FRANKIE AND JOHNNY... WERE LOVERS and LOVE SECRETS: KAMA-SUTRA STYLE for many years even after the penetration of hardcore hits such as DEEP THROAT and THE DEVIL IN MISS JONES.\n\nPromoted with the strap-line \"Back By Popular Demand\" in many newspaper ads of the day, clearly audiences loved its risqué bedroom ideas for perishable goods, frigidity cures from the freezer lanes and frisky possibilities from the non-foods department. You do know that microwaving a watermelon makes the fruit's flesh soft and warm just like…. well, you get the idea! Titillation ending up as an education: who'd have thought it! Now that's what I call \"Z for Zowie.\" Featured in the book The Act of Seeing by Nicolas Winding Refn and Alan Jones, published by FAB Press. (Alan Jones)",
    "directors": [
        "Paul Roberts"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/x-rated-supermarket"
    },
    "runtime": 62,
    "synopsis": "Want to save money on your weekly sex toy budget? Look no further than the supermarket shelves for salacious tips and reactions from suburban horny housewives.",
    "title": "X-rated Supermarket",
    "year": 1972
}