{
    "synopsis": "After a yakuza vampire boss is struck down, his most loyal disciple takes it upon himself to avenge his mentor's death and eliminate the assassins and their giant plush frog leader in Miike's classic yakuza tale turned inside out.",
    "description": "Fantastic Fest fan favorite Takashi Miike's body of work grows at such a rapid rate that it's almost unbelievable that he still finds new ways to entertain. Yet here we are with his latest jam firing on all fun cylinders, loaded with some of his most batshit insane material yet. If you like your yakuza vampiric and your plush frog-suit martial arts ultra violent, boy have we got some Miike for you.\n\nBoss Kamuira is one of the most feared of the yakuza leaders and with good reason: He's actually a vampire who drains the townsfolk of their plasma, and he's nearly invincible. A group of assassins who know of his true nature  — including an otaku played by THE RAID'S Yayan Ruhian — arrive in town and Kamuira is forced to defend his turf at all costs.\n\nThe cost, as it turns out, is his life. Just before he expires, he bites Kageyama (Hayato Ichihara), his most devoted disciple who makes it his mission to avenge his mentor and reclaim his syndicate's territory.\n\nThe all-out war that ensues includes some of the most ridiculous, over-the-top and crazy shit Miike has ever gifted to willing audiences. You want a giant, ass-kicking frog? Miike's got you covered. You want dancing, underwear-clad kids sprouting from the earth? Yep, check that one off too. You want… well, we're not going to give anything else away. Just know that Miike is way ahead of just about anything you can think of on this one.\n\nWhat keeps everything from being just too insane to handle is that, at its very core, the classic yakuza story lives and breathes strong here. It's just that there's not a single element of those tried and true tales Miike has forgotten to fuck with. Grab a seat, order a beer and turn it up loud (actually, we'll do that last part for you) because YAKUZA APOCALYPSE truly is the THE GREAT WAR OF THE UNDERWORLD. (Brian Kelley)",
    "directors": [
        "Takashi Miike"
    ],
    "runtime": 115,
    "year": 2015,
    "countries": [
        "Japan"
    ],
    "title": "Yakuza Apocalypse"
}