{
    "synopsis": "Talal wakes up in a cell with no memory of the night before, no I.D. and no escape. However, nothing can prepare him for the arrival of a brilliant psychopath and the games he wants to play.",
    "description": "Talal has just woken up in a police cell, feeling like hell. He has no memory of the night before, no memory of how he ended up locked up and no I.D. to prove who he is. His desperate situation gets a lot worse with the arrival of brilliant psychopath Dabaan who seems determined to play violent, vicious and unexpected mind games with him. His confinement becomes a fight for survival and a race to discover exactly what's motivating Dabaan.\n\nSometime in the early '90s, America produced brilliant neo-noir thrillers one after another. From RED ROCK WEST to LAST SEDUCTION to THE NAME OF THE BEAST, these B-movie wonders came and vanished in the blink of an eye, leaving us to wonder where exactly the genre went.\n\nWell, wonder no more. The B-movie neo-noir is apparently well and living in the United Arab Emirates. ZINZANA proves without a doubt that you do not need Nicolas Cage to craft an intricate, violent and surreal thriller.\n\nDirector Majid Al Ansari's effort is set within the confinement of a sheriff's office. On one hand we have Saleh Bakri as Talal, channeling the best of Eric Roberts circa 1994, and on the other Ali Suliman as Dabaan, a charming psychopath so beautifully played that Dennis Hopper is teeming with jealousy somewhere on the other side of the afterlife.\n\nBuilding upon these brilliant performances is a taut thriller filled with outrageous twists and sudden violent moments. The discovery of exactly what Dabaan's plan entails is enormous fun, and each one of the nail-biting time limit sequences work wonderfully.\n\nAdd to this ambitious camerawork, a drab and dusty palette that evokes small town America by way of the Middle East and a delightful musical interlude, and you have a discovery unlike any other. (Evrim Ersoy)",
    "directors": [
        "Majid Al Ansari"
    ],
    "runtime": 91,
    "year": 2015,
    "countries": [
        "Jordan"
    ],
    "title": "Zinzana"
}