{
    "countries": [
        "Canada",
        "Brazil"
    ],
    "description": "Emma is having a rough time. When her co-worker (and occasional \"friend with benefits\") Bob finds a sketch she did of herself as a well-endowed super hero, he makes an offhanded comment about that girl being out of his league. This sends Emma into a spiral of self-doubt and body image issues. It certainly doesn't help that they both work at a factory that makes lifelike sex dolls, a job where Emma literally creates men's fantasies. Her frustrations with Bob spill over into her hobby, drawing comics. She creates her dream man, a suave, sophisticated, latin lover, and things slip further into fantasy.\n\nMichelle is a stunning Brazilian model. But the vapid nature of both the modeling industry and her condescending boyfriend Dale have her re-examining her priorities. A chance encounter with a book publisher sparks her interest in finishing her novel, which currently exists only as a few hastily scribbled chapters. After a fight with her boyfriend and a positive response from the publisher, Michelle decides to head back to Brazil to focus on finishing her book.\n\nEddie is a promising young director known for his action films, which are filled with explosions and raw testosterone. His libido and sexual prowess has made him a hit with female studio execs, allowing him to climb the industry ladder. His latest project is an attempt to break away from genre movies and make a deeply passionate art film, but the studio isn't going for it. When an inexplicable anatomical anomaly occurs, Eddie finds he can't push his film through the way he once did. As his heartfelt film is taken back by the studio for more action-packed reshoots, he goes back on location to find solutions to all of his problems.\n\nZOOM is amazingly only the second feature film from Brazilian director Pedro Morelli. Perhaps even more astonishing is that it's the first screenplay from writer Matt Hansen. Hansen's complex, layered script is sharp and witty, while Morelli's direction is assured and confident. Alison Pill, Mariana Ximenes and Gael Garcia Bernal are especially great as the leads and they're surrounded with a fantastic supporting cast including Tyler Labine, Jason Priestley and Michael Eklund. The film features some beautiful animated segments as well as some hilariously on-the-nose songs. Exploring the nature of existence, purpose, destiny and fate, ZOOM is a surreal look at the way we see ourselves and the way we want others to see us. (Luke Mullen)",
    "directors": [
        "Pedro Morelli"
    ],
    "meta": {
        "source_url": "http://fantasticfest.com/films/zoom"
    },
    "runtime": 96,
    "synopsis": "Three very different people — an aspiring comic book artist with body image issues, an action director trying to make a more meaningful film, and a model struggling with her first novel — find their stories intersect in earth-shaking ways.",
    "title": "Zoom",
    "year": 2015
}