{
    "countries": [
        "United States"
    ],
    "description": "The shower scene in PSYCHO is accepted as one of Hitchcock's most masterful achievements. Both technically and in terms of storytelling, the scene signals a peak for the master in demonstrating his ability as well as the glee with which he pulled the rug from under an entire generation of viewers.\n\nAnd now filmmaker Alexandre Philippe puts the shower scene under a microscope to look at it in every possible way. From expert interviews to technical analysis, the film covers almost every angle about the infamous scene. With interviewees ranging from Elijah Wood to Peter Bogdanovich, the roster of interviewees on screen run the gamut of filmmaking and demonstrate the scene's varying emotional effects.\n\nBut what could be in danger of being a dry examination instead becomes a meditation and celebration of Hitchcock and his ability. Peppered with brilliant anecdotes about PSYCHO, 78/52 brings to us a joyful celebration that is as exuberant as it is thorough.\n\n78/52 is thrust forward by personal stories, each one highlighting PSYCHO and the shower scene in relation to filmmakers, actors, fans and more — the technical is dissected as much as the emotional — and for the entirety of its running time 78/52 brings to life the best of film criticism and analysis in a way never seen before on the big screen. Placing the film in social context and defining history through the circumstances surrounding it, 78/52 paints a picture of the film world on the brink of change and shows how PSYCHO delivered that change.\n\nWhether a film lover or a historian, anyone who watches 78/52 will be infected by the joy that Philippe and his interviewees bring to the subject. 78/52 is a glorious celebration of Hitchcock (and cinema) that reminds us of why we all became fans in the first place! (Evrim Ersoy)",
    "directors": [
        "Alexandre O. Philippe"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/78-52"
    },
    "runtime": 91,
    "synopsis": "This masterful documentary focuses on a single aspect of Hitchcock's PSYCHO to demonstrate the master's technical ability in storytelling. With expert interviews and rollicking analysis, 78/52 sets a new bar in how to examine film overall.",
    "title": "78/52",
    "year": 2017
}