{
    "countries": [
        "United Kingdom"
    ],
    "description": "Teenage Anna's life is typical enough. Chafing against the narrow horizons of her small town, she dreams of bigger things. It's not so much that she doesn't love her friends and family — she does — it's just that they're all so... familiar. So typical. So predictable. Her childhood best friend aches for a romance that she has no interest in, no matter how close they might be. The school jock that she had a fling with is proving to be disappointingly predictable in his behavior. And it's becoming progressively harder for Anna to conceal her disappointment with just how satisfied her widower-father is with the blue collar simplicity of his never-changing existence. And then it all goes to shit.\n\nThe night of the high school Christmas concert marks the arrival of the undead in Anna's small town. And so begins a struggle to band together and survive. Future dreams are forced aside by the overwhelming need to survive the present in this winning Scottish musical-horror-comedy.\n\nYes, we said musical. And we mean it. John McPhail's feature has its origins in Ryan McHenry's BAFTA-nominated short film titled simply ZOMBIE MUSICAL. And while every film needs to stand purely on its own terms, there's no getting around the fact that this particular film's origins add an extra layer of poignancy to the whole affair.\n\nFollowing the success of his short film, McHenry set to work on writing the script and music for the feature expansion. McHenry was well on the road to making the feature version when — still in his mid-twenties — he was diagnosed with cancer. He would achieve viral fame as the creator of the \"Ryan Gosling Won't Eat His Cereal\" videos on Vine while in the hospital before losing his battle. McHenry's sense of humor thrived even as his body failed.\n\nHonoring McHenry's wishes, producer Naysun Alae-Carew refused to let the project die with its creator. Enter rising star John McPhail, whose deft directorial touch crafts what now stands as both Anna and McHenry's statement on their own impending mortality and their stubborn refusal to let it end them even as it claims them. (Todd Brown)",
    "directors": [
        "John McPhail"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/anna-and-the-apocalypse"
    },
    "runtime": 107,
    "synopsis": "Anna's life is dominated by the typical concerns of her youthful peers until the Christmas season in her small town brings not Santa, but an outbreak of the undead in this genre-mashing holiday horror musical. Yep. Musical.",
    "title": "Anna and the Apocalypse",
    "year": 2017
}