{
    "countries": [
        "United States"
    ],
    "description": "The Pollack family is ready for vacation. Jason has just graduated, Jessica is bringing her friend Becky, and James and Casey are both trying to take their minds off James' inoperable liver cancer. James is skeptical but Casey is futilely hoping that a weekend at her friend Mika's cabin that happens to be built on a deposit of iron oxide will cure him or at least help him feel better. Everything seems normal, the cabin is rustic but nice, Jessica and Jason snipe at each other like most siblings and James' awkward dad humor keeps the mood light.\n\nBut their weekend away takes an odd turn when James finds a woman passed out in the woods near the cabin. After bringing her inside, Casey leaves to find better reception and call an ambulance. While she's gone, the mysterious woman's behavior sets the rest of the Pollacks on edge. When Casey returns, things get too strange and the Pollacks reach the limits of their hospitality. But the woman isn't ready to leave, and the family's relaxing weekend away is about to turn deadly.\n\nFirst-time feature director Bradford Baruh has deftly constructed a memorable midnighter that takes cues from everything from EVIL DEAD to Shakespeare. He wisely packed his stellar cast with genre mainstays including Brea Grant, AJ Bowen and Barbara Crampton. Grant carries the film with ease, while Bowen's goofy dad and Crampton's enigmatic, otherworldly performance add fun and unease in equal measure. Using a true crime show as a framing device, Baruh has found a creative way to tell a non-linear story. From the intense, unsettling score underlining the innovative narrative structure to the rubber and latex effects work awash in practical gore, APPLECART is weird, wild and blood-soaked, an old school horror film in all the right ways. (Luke Mullen)",
    "directors": [
        "Bradford Baruh"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/applecart"
    },
    "runtime": 86,
    "synopsis": "An idyllic weekend vacation to a secluded cabin turns deadly when the Pollack family discovers an unconscious woman whose sinister plans will pit the family members against each other.",
    "title": "Applecart",
    "year": 2017
}