{
    "countries": [
        "India"
    ],
    "description": "There is no Indian movie celebrity like Superstar Rajinikanth. The second highest paid actor in Asia (right behind Jackie Chan), Rajini is a hurricane of charisma, pithy one-liners and attitude for days. With a career that stretches back to the '70s, the one-time bus conductor is now an icon around the world whose films draw record audiences both in India and abroad.\n\nIn 1995, Rajini starred in BAASHA, a film that would forever change his career and the Tamil language film industry. BAASHA tells the story of Manikam, an autorickshaw driver who works hard to support his family and his neighborhood. When Manikam's younger brother Shiva becomes a police officer and gets a little too eager to take on the local crime lords, the gangsters decide to take him down a peg and put a beating on him that he'll never forget.\n\nNot one to suffer insults quietly, Manikam takes offense and decides to take on the gangsters and return his little corner of the world to normal. He has a secret up his sleeve, though. Manikam has a history of violence that the hoodlums aren't ready for and he's out for blood. What follows is an out-of-control ratcheting up of tensions between Manikam and his smarmy foe Mark Anthony (played to the hilt by the sleepy-eyed character actor Raghuvaran).\n\nAction scenes are interspersed with gloriously out of context songs, people are beaten bloody and crucified as warnings to their neighborhood not to be the next to speak out and Rajini holds it all together with the confidence that can only come from knowing you're the best.\n\nBAASHA introduced a new kind of anti-hero to Tamil cinema and helped to cement Rajini as the greatest film star that Tamil Nadu had ever seen. The film reminds one of hazy late '80s Hong Kong action, sparkly Busby Berkeley-style choreography and the kind of scenery chewing that Hollywood abandoned with the demise of '40s adventure serials. From Suresh Krissna, director of the insane identical twin serial killer masterpiece AALAVANDHAN, BAASHA is a newly remastered Indian crime classic. (Josh Hurtado)",
    "directors": [
        "Suresh Krissna"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/baasha"
    },
    "runtime": 165,
    "synopsis": "Superstar Rajinikanth plays a rickshaw driver with a history of violence in this genre-defining musical gangster romance epic from the director of AALAVANDHAN.",
    "title": "Baasha",
    "year": 1995
}