{
    "countries": [
        "Thailand"
    ],
    "description": "Even by 9th grade, Lynn is already a classic overachiever, so skilled in math that she can immediately calculate what it's going to cost her widowed dad to accept a scholarship that promises free tuition and better opportunities for her after graduation. But after helping her panic-stricken best friend Grace get through a tough multiple-choice exam, she inadvertently discovers an exploding market of students with lots of money and little interest in studying, eventually developing an ingenious series of hand signals to shepherd her classmates through the dehumanizing standardized tests that will determine their college prospects. In the meantime, Bank, her chief rival at school, is a straight-arrow student afraid enough of himself getting in trouble that he's willing to rat on anyone else to avoid even the impression of impropriety.\n\nBearing a title that hints at the hand-wringing morality of a Hays Code-era teen movie but a story with the operatic pacing and meticulous structure of a Michael Mann heist, BAD GENIUS starts off as a portrait of smart, poor kids leveling the playing field against their dumb, rich counterparts and quickly evolves into a sophisticated morality tale about the business of academia and the emotional cost of undermining your own scholastic achievements for a substantial if short-term payoff. Thai director Nattawut Poonpiriya (2012's COUNTDOWN) uses extreme widescreen imagery to isolate the characters and keep them at odds even when they're conspiring together to fleece their prestigious school, and later, wrestle with their own consciences as teachers and parents begin to amplify their expectations in the wake of improved test scores.\n\nFilled with rich, compelling performances and enough twists and turns to make test-taking seem genuinely exciting, BAD GENIUS chronicles the insane lengths to which these kids will go to supply what seems like the better part of Thailand's undergraduates with answers to a test that has the potential to make or break their academic fates. (Todd Gilchrist)",
    "directors": [
        "Nattawut Poonpiriya"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/bad-genius"
    },
    "runtime": 130,
    "synopsis": "A quartet of high school students are better at cheating than anything you've ever done in your life in this epic nail-biter about the standardized tests that level the playing field for all kids, smart and dumb, rich and poor.",
    "title": "Bad Genius",
    "year": 2017
}