{
    "countries": [
        "United States"
    ],
    "description": "Love is in short supply these days. Leave it to prolific Japanese auteur Kiyoshi Kurosawa to create a film that flips a lot of previous themes from his early films to spin a genre yarn where humanity's most positive qualities could be the key to our salvation. Surprising? Absolutely! Very few filmmakers can stake claim to the extraordinary run that Kurosawa had in the late '90s from CURE (1997) to PULSE (2001). It's evident that these films take a very pessimistic view of humanity. CURE, PULSE and CHARISMA (1999) suggested that humanity faced the apocalypse due to Kurosawa's negative view of how people interacted with each other. Even BRIGHT FUTURE (2002), in spite of its name, suggested that Armageddon was on its way despite an attempt to change our existence. Kurosawa was at his best when he was angry and frustrated with society. The films that he produced during the late 90's were among the best in the world and elevated Kurosawa to one of the most treasured international filmmakers in the genre space.\n\nFlash ahead a few decades and Kurosawa is again infusing a genre narrative with human commentary. This time, Kurosawa deals with an alien invasion narrative. The creatures can take control of our bodies. They're part of an initial attack force that's been sent to understand humans, but the best way they come to understand humans is by taking away their emotions and values. By coming to learn human values, they know that most of us aren't worth saving.\n\nThis nihilism can easily not just engulf an individual but an entire world. However, Kurosawa has gotten to the point in his life where he cannot give up on his fellow man and woman. Even in our lowest moments of despair, we're capable of finding worth in each other. Empathy exists no matter how terrible the situation is. That's more relevant today than ever and leave it to a master like Kurosawa to entertain and enlighten us with this knowledge in his latest film. (James Emanuel Shapiro)",
    "directors": [
        "Kiyoshi Kurosawa"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/before-we-vanish"
    },
    "runtime": 129,
    "synopsis": "Kiyoshi Kurosawa's latest film is a sci-fi thriller about an alien invasion in which aliens must come to understand humanity through understanding human emotion—most importantly, our collective capacity for love.",
    "title": "Before We Vanish",
    "year": 2017
}