{
    "countries": [
        "France"
    ],
    "description": "The secluded town of Villefranche may be small, but it seems to have more than its fair share of strange occurrences. It's surrounded by a tall, thick forest that provides beautiful scenery, a place to hike and camp, and the local sawmill provides a livelihood for a large chunk of the population. More than just off the beaten path, Villefranche sits in a \"black spot,\" an area where cellular, GPS and other signals can't penetrate. When a new prosecutor arrives to investigate the strangely high rate of violent crimes in the area, he sticks out like a sore thumb. The townspeople aren't exactly xenophobic, at least not maliciously, but they know things that outsiders can't know. They have a complicated relationship with the woods around them, one built on respect mixed with fear and an odd reverence.\n\nThe prosecutor's arrival coincides with the discovery of a body hanging from a tree in the forest. But it's just the first in a series of mysteries, both current and long-gestating, that seem to hang over the town like a plague. The police chief's daughter is an activist whose stunts are starting to go too far. Her best friend is the mayor's daughter, who's been missing for months. And the chief and the mayor have a complicated history themselves that goes back to their youth.\n\nThe first season of BLACK SPOT (ZONE BLANCHE) is eight episodes and we're proud to present the first three here at Fantastic Fest. They form a solid introduction to the incredible world developed by creator Mathieu Missoffe. The show is dark and fascinating, with gorgeous cinematography and a stellar score that highlights the foreboding tone and helps to create a near-suffocating atmosphere of dread. Missoffe sprinkles in just the right amount of black comedy to keep things from getting overly dour, but never lets up on the tension that builds from moment to moment. Blending influences from everything from Nordic crime TV to THE X-FILES, BLACK SPOT is a riveting narrative that will invade your head and have you begging for more. (Luke Mullen)",
    "directors": [
        "Thierry Poiraud",
        "Julien Despaux"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/black-spot"
    },
    "runtime": 156,
    "synopsis": "An ambitious prosecutor arrives in a secluded town to address a number of violent crimes, only to find himself caught in the town's dark web of mysteries.",
    "title": "Black Spot",
    "year": 2017
}