{
    "countries": [
        "Japan"
    ],
    "description": "It's a delightful coincidence that Takashi Miike's hundredth film also happens to be an adaptation of the infamous BLADE OF THE IMMORTAL manga. This match seems to have been made in heaven!\n\nRemaining loyal to the source material both visually and thematically, Takashi Miike still manages to make the film his own through clever visuals, terrific performances and incredible mind-blowing action scenes.\n\nManji, a samurai who simply cannot die, crosses paths with Rin Asano, a young girl hell-bent on vengeance against the master swordsmen who destroyed her family. Although Manji's interest in humanity is lacking, to say the least, he finds himself allying with the young girl to help achieve her goal. Arms will be torn, heads will be chopped off and blood will splatter as the immortal samurai hones in on his targets and destroys anything and everything that stands in his way.\n\nCrafted with madcap energy, the film takes in Manji's duels with the group of master swordsmen who live just to fight. Faced with their nihilistic attitude, Manji finds himself questioning his life and journey. Along the way, he finds himself embroiled within the twisted politics of Japan's warlords and encounters Shira, a mercenary acting as a killing tool. As all of the warring parties come together in a final encounter, a lot of blood will be spilled and a lot of limbs will be torn off.\n\nShot with Miike's meticulous eye for action and detail, BLADE OF THE IMMORTAL feels like the manga come to life — this is the highest compliment that can be paid for such an adaptation. Miike creates a vivid universe that teems with life — and blood! — and shoots the action with the same flair that he displayed in 13 ASSASSINS. For fans of wall-to-wall action, there's simply no better title this year to watch on the big screen. This is a bloody brilliant journey from beginning to end! (Evrim Ersoy)",
    "directors": [
        "Takashi Miike"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/blade-of-the-immortal"
    },
    "runtime": 141,
    "synopsis": "Takashi Miike's 100th journey is an adaptation of the BLADE OF THE IMMORTAL manga. Manji, a samurai who cannot die, crosses paths with Rin Asano, a young girl whose parents were killed. Manji swears to help Rin Asano avenge her parents' deaths.",
    "title": "Blade of the Immortal",
    "year": 2017
}