{
    "countries": [
        "Switzerland"
    ],
    "description": "Lisa Brühlmann's BLUE MY MIND follows 15-year-old Mia (Luna Wedler) as she undergoes a life-changing transformation, one that leaves her examining her body and her very existence in a new light.\n\nSwitzerland is best known for its alpine landscapes, wonderful cheeses and cuckoo clocks. With a few notable (and less notable) exceptions, Switzerland is not known for producing genre films in any memorable capacity. BLUE MY MIND is about to change that.\n\nEvery so often as a programmer, you have the privilege of witnessing the birth of a great filmmaker, and there is nothing more exciting than sharing your find with audiences. Not only is BLUE MY MIND Lisa Brühlmann's first feature, it's also, amazingly, her graduation feature from film school. Just as impressive, more than 50% of the technicians on BLUE MY MIND's production team were film students as well. Trained as an actress, Brühlmann went back to film school in order to learn more about the process of filmmaking. We should all celebrate the fact that she did, because we're gifted with an up-and-coming filmmaker who has something significant to say. BLUE MY MIND is a fantastic tale about a young girl whose body starts transforming after she faints during a not-so-harmless game with girlfriends. Mia fights the dramatic changes to her form with every resource she possesses, but after some time and a few unavoidable confrontations with herself, she submits to the relentless drive of nature itself.\n\nFor her first feature, Lisa Brühlmann wrote a beautiful piece about female body transformation as an allegory for puberty, and about a rather chaotic friendship between two girls who learn to rely on each other amid the most damning of circumstances. Carried by two young upcoming actresses who deliver remarkable performances (Wedler and Zoe Pastelle Holthuizen), Brühlmann's first feature will blue your mind—and it will absolutely not leave you indifferent. (Annick Mahnert)",
    "directors": [
        "Lisa Brühlmann"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/blue-my-mind"
    },
    "runtime": 97,
    "synopsis": "BLUE MY MIND follows 15-year-old Mia (Luna Wedler) as she undergoes a life-changing transformation, one that leaves her examining her body and her very existence in a new light.",
    "title": "Blue My Mind",
    "year": 2017
}