{
    "countries": [
        "United States"
    ],
    "description": "With BODIED, Joseph Kahn takes the gonzo, in-your-face style he developed with his music videos and features TORQUE and DETENTION, and uses it to create a film that roasts every current hot topic. From free speech to race relations, from stereotypes to the cost of political correctness, he attacks with gusto, detonating a dynamite blast of film guaranteed to get the audience debating… and perhaps dissing.\n\nAdam is a grad student like any other. He's polite, aware of his position as a white, middle-class liberal and almost apologetic for his privilege. He obsessively and academically digs into his thesis subject of battle rap, but when a chance encounter in a garage sees him actually entering the arena himself as a word warrior, he discovers something within himself that he never knew existed. Freed from the shackles of his timidity, Adam refashions himself into a fierce competitor on the scene. But each rung on the ladder to success comes at a price that may end up being too high; not just for Adam, but also for those around him.\n\nIncendiary, whip-smart and endlessly challenging, BODIED is Joseph Kahn throwing down questions that have dominated the cultural discourse, illuminating them with battle rap scenes that crackle with energy, authenticity and the brutality of great action sequences. Khan mixes in terrific performances and an inverse hero's journey designed to make you cheer and recoil in equal measure, and ends up with a film worthy of the debate it's designed to generate. So see BODIED on the big screen and find yourself outraged, rejuvenated but most importantly blown away by the talent on display. (Evrim Ersoy)",
    "directors": [
        "Joseph Kahn"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/bodied"
    },
    "runtime": 120,
    "synopsis": "Adam is a grad student with an obsessive but academic interest in the world of battle rap. When a chance encounter brings him into that world he discovers a savage side to himself he never knew existed.",
    "title": "Bodied",
    "year": 2017
}