{
    "countries": [
        "United States"
    ],
    "description": "There are no words to describe BRAWL IN CELL BLOCK 99. There is only hyperbole. Words are small for humans, and this film is anything but. No, this is a gigantic behemoth of a freight train of a monster of a film, one so big and outrageously over the top it's hard to comprehend while watching and even harder to fathom post. What opens as a gritty thriller closes with a cacophony of the most hardcore analog violence I've ever experienced in four decades of watching hardcore violence. Ladies and gentleman, it is our esteemed honor to welcome back the brilliantly twisted vision of S. Craig Zahler. BRAWL IN CELL BLOCK 99 follows Bradley Thomas (Vince Vaughn), a former boxer-turned-drug runner who is incarcerated after a deal goes horribly wrong. Sentenced to serve time under the watch of the sadistic Warden Tuggs (Don Johnson), Thomas must fight to stay alive and to protect those he loves.\n\nIn anyone else's hands, this narrative could have beaten a pedestrian path but the result here is anything but. For the first hour Zahler flirts with us, deliberately taking his time to establish Vaughn's character and suppressing the monster that lies beneath their conjoined skins, but once they arrive at prison their rage is unleashed... and is it ever a sight to behold. Vaughn metamorphosizes into a killing machine that is part Frankenstein's monster, part shark from JAWS and part monster truck. On Zahler's watch, Vaughn's pugilism is more muscular, physically overpowering and brutally terrifying than anything that has ever preceded. On the heels of his Fantastic Fest closer, BONE TOMAHAWK, Zahler doubles down on all of the things that made his debut a phenomenal ride with a script and direction that is uniquely his own. Much like his first film, he trusts his writing in the hearts and minds of a select few and allows them to wrestle his words to life with the same force and physicality he commits to the page. Every beat calculated, every pause metered, and every action punishing as he drags us into deeper waters before going in for the kill. And what a gloriously savage kill it is. BRAWL IN CELL BLOCK 99 is a bold, fearless and shocking film that will challenge every part of you. (Christian Parkes)",
    "directors": [
        "S. Craig Zahler"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/brawl-in-cell-block-99"
    },
    "runtime": 132,
    "synopsis": "S. Craig Zahler (BONE TOMAHAWK) returns with his sophomore feature, BRAWL IN CELL BLOCK 99. An exhilarating exercise in analog violence, CELL BLOCK follows the brutal exploits of a former boxer who finds himself incarcerated after a drug deal goes wrong. Trapped in a maximum security facility, he must fight to stay alive and to protect those he loves.",
    "title": "Brawl in Cell Block 99",
    "year": 2017
}