{
    "countries": [
        "Mexico",
        "United States"
    ],
    "description": "There's a small town in Mexico called Tultepec whose entire industry and culture is devoted to fireworks — beautiful, energetic, and dangerous fireworks. You may not be aware of Tultepec by name, but you may know the town through a recent viral internet video in which an explosion at the town's fireworks factory was captured by a passerby on a phone. That incident proved deadly, but the residents of Tultepec wear this danger as a badge like a stuntman who throws himself off of a hundred-story building. Scars are treasured. Disfigurements are regarded as status symbols. Why? It's not just because fireworks in Mexico are a business. There's something more about the love of fireworks in Tultepec. The love is almost religious in nature. Every year, for one glorious week, the town celebrates its love of fireworks with the incredible National Pyrotechnic Festival. The festival is dedicated to a religious figure, John of God. John was a 16th century Portuguese saint who was known for his charity and has become the designated saint of fireworks.\n\nHow Tultepec celebrates this festival has to be seen to be believed and trust us, it makes for one of the most incredible cinematic experiences you will ever have. Shot over three years, first-time feature filmmaker Viktor Jakovleski and his cinematographer Tobias von den Borne capture the events of this festival in painstaking and loving detail. Using high speed lenses to record every detail in the most visual way possible, BRIMSTONE & GLORY is a feast for the sentences that can only be truly appreciated in a movie theater.\n\nThere are movies that are great because they tell a moving story and there are movies that are great because of the way they can make you feel. BRIMSTONE & GLORY will make you feel wonder like few movies can. It's a special document that will be one of the most memorable experiences in theaters this year. (James Emanuel Shapiro)",
    "directors": [
        "Viktor Jakovleski"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/brimstone-and-glory"
    },
    "runtime": 67,
    "synopsis": "Tultepec is a small Mexican town that celebrates its love of fireworks with a yearly week-long festival. This festival is captured in a glorious documentary that is pure cinema.",
    "title": "Brimstone & Glory",
    "year": 2017
}