{
    "countries": [
        "Denmark"
    ],
    "description": "It's the 1980s and the world is a glorious playground of possibility. Technology is the great equalizer and the parade of shiny new products that were considered pure science fiction fantasy just a decade before now promise a world of opportunity for the bold. For the dreamers. For men just like Thorkild. A smooth talker with big dreams and even bigger confidence in his own impending success, Thorkild has seen the future... and it is the electric car.\n\nThere's just one problem for Thorkild: His employers neither share his vision nor his confidence in himself. So, it falls to the dreamer to assemble his own team of misfits to join in his grand adventure. Based on the true story of the actual attempt to launch a Danish electric car in the early 1980s — an attempt that literally stalled out at the vehicle's unveiling — DAN DREAM reunites Casper Christensen and Frank Hvam for a wry and witty period comedy.\n\nChristensen and Hvam need little introduction in these parts; they are already well known as the mad duo behind KLOWN. As with their international breakthrough, the filmmakers serve as both screenwriters and stars in DAN DREAM. This is largely where the KLOWN comparisons end. The wit and intelligence of their prior work remains in full force, but are applied to DAN DREAM in very different ways. While KLOWN kicks with furious force at all the most ridiculous aspects of masculinity, DAN DREAM instead casts an almost wistful eye on an idea ahead of its time that was ultimately undone by the cultural forces of conformity and basic human insecurity.\n\nDAN DREAM puts a fascinatingly different spin on the creative team behind it. Having played exaggerated versions of themselves for a decade now in their signature work, Christensen and Hvam show not just a willingness to lose themselves in other characters but a clear skill in doing so while also finding new facets to their signature comedic style. Those looking for the extremity of KLOWN may not find it in DAN DREAM. What they will find instead is a creative team at their peak, who are still finding more aspects of their prodigious skills to explore. (Todd Brown)",
    "directors": [
        "Jesper Rofelt"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/dan-dream"
    },
    "runtime": 97,
    "synopsis": "KLOWN duo Casper Christensen and Frank Hvam reunite for a true-life tale of epic failure. Witness the non-arrival of the Danish electric car!",
    "title": "Dan Dream",
    "year": 2017
}