{
    "countries": [
        "Denmark"
    ],
    "description": "A movie about revenge that sets aside its exacting for as long as possible, DARKLAND features the kind of deep dive into character that the genre rarely allows. Fenar Ahmad's unsettling second feature delivers explosively on its promise of a realistic masked vigilante, but not before exploring all the loss, guilt and even internal prejudice driving well-to-do doctor Zaid (Dar Salim in an entrancing turn) down a path of both self-destruction and violence against his own people.\n\nZaid, the son of Iraqi immigrants, has had it good in Denmark. He's a well-respected surgeon and an expectant father living amidst the upper echelons of white European society; he's moved far away from his parents' neighborhood and its local Arab street gangs. His younger brother Yasin wasn't so lucky, stealing and dealing just to stay afloat. He turns to Zaid after getting himself in hot water with his boss, a local weed dealer who answers to a higher power. But the good doctor wants no part of his baby brother's lifestyle, even if it's just a loan to get him out of trouble. That's the life and the community Zaid left behind, but stepping away from Yasin has dire consequences when he ends up beaten to death in a gang-related incident.\n\nZaid's descent into violence is gradual, born out of both guilt and desperation as he befriends unlikely people, walking a razor sharp wire between the world he lives in and the world he left behind, and alienating his family in the process. DARKLAND is a film where loss is truly felt, one where prejudice and cultural self-hatred are brought to the surface through confrontation, and one where the violence is unsettling; not because it's overtly graphic, but because of the toll it takes on the soul of a man dedicated to saving lives.\n\nIt's like watching a realistic, culturally relevant take on BATMAN, but one that's uncomfortably, unrelentingly real and refuses to shy away from the cost of vengeance. (Siddhant Adlakha)",
    "directors": [
        "Fenar Ahmad"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/darkland"
    },
    "runtime": 113,
    "synopsis": "An Iraqi doctor in Denmark seeks vigilante justice for his brother's murder when the police come up short, biting off more than he can chew in a world of gangs, drugs and underground fight rings.",
    "title": "Darkland",
    "year": 2017
}