{
    "countries": [
        "United States"
    ],
    "description": "Fantastic Fest is proud to close this year's festival with Alexander Payne's masterpiece-in-miniature DOWNSIZING. Returning to the big screen Payne has once again elevated the game with a trademark, razor sharp satire that squarely positions him as one of the finest filmmakers practicing the craft today.\n\nSet in a near-future where miniaturization has become a solution to overpopulation and extinction of resources, doughy Dockers poster-boy Paul (Matt Damon) and his doting wife Audrey (Kristen Wiig) make the big leap to go small and downsize... in dramatic fashion. Desperate to shake the shackles of his mundane existence, Paul pursues the process of 'cellular miniaturization' in an attempt to grasp the better life that long looked to be out of his reach. As per with Payne, things don't always go to plan as he expertly blends social satire with slivers of science fiction and perfectly orchestrates his cast.\n\nAnd what a cast he has assembled. Matt Damon eschews his action hero past to flex his supreme versatility, Kristen Wiig shines in a big screen role that finally expresses her vast range and depth, while exemplary performances from Laura Dern, Christoph Waltz, and an absolutely stand out showing from Hong Chau round out an all-star array of talent.\n\nPayne has long shared his affection for the mediocrity of middle-aged masculinity. From ELECTION to SIDEWAYS to ABOUT SCHMIDT, he has reveled in the American everyman to glorious effect. But it is with DOWNSIZING that he has excelled above all. Only in his hands could going small be so big. (Christian Parkes)",
    "directors": [
        "Alexander Payne"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/downsizing"
    },
    "runtime": 135,
    "synopsis": "Everyman Paul Safranek (Matt Damon) and wife Audrey (Kristen Wiig) decide to abandon their stressed lives in Omaha and move to a new downsized community in Alexander Payne's brilliant social satire.",
    "title": "Downsizing",
    "year": 2017
}