{
    "countries": [
        "Latvia"
    ],
    "description": "In 2014, Aik Karapetian burst into the scene with the eloquently brutal THE MAN IN THE ORANGE JACKET, which was the first horror film out of Latvia. Brimming with tension, it stood out not only in its uniqueness of origin, but also in its beautifully shot aesthetic punctuated by bouts of intense, shocking violence. The film established Karapetian as a filmmaker to watch, and with good reason, because his new feature FIRSTBORN continues to perfect his vision. This time around, Karapetian examines a man's self-perceived masculinity in a multi-layered tale that butterflies from simplistic motivations to a complex puzzle of psychological thrills.\n\nDuring an evening of partying with their friends, we see the early cracks of doubt that Francis (Kaspars Znotins), a meek architect, has about his beautiful wife Katrina's (Maija Doveika) perception of him. As they play a game of lies, Katrina's descriptive story of lust for another man rings far too true for Francis, planting further seeds of doubt deep within his psyche.\n\nAs they journey home from the gathering, Katrina is nearly run down by a man speeding by on a motorcycle, prompting her to yell after him in anger. This confrontation exacerbates the situation with the cyclist, leads to an ugly assault on the couple and further tarnishes their diminishing relationship.\n\nA combination of this initial conflict, Katrina's later pregnancy and deep-seated insecurity sets off a series of events that snowball into murder, blackmail and Francis' discovery of unforeseen and pernicious connections. Will it also awaken the animal instincts that he desires to display to his loving wife?\n\nKarapentian's deft script and direction prevents a heavy handed one-dimensional delivery of what could very well be a standard dramatic tale. FIRSTBORN's cerebral twists continually ramp up in complexity and tension through the use of tonally shifting, string-based musical queues and beautifully framed shots. It shines, not just as an excellent Latvian thriller, but as an outstanding, compelling and complex brain-twister. (Noah Lee)",
    "directors": [
        "Aik Karapetian"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/firstborn"
    },
    "runtime": 90,
    "synopsis": "Provocative Latvian director Aik Karapetian returns to Fantastic Fest with a new thriller that explores how far a meek architect will go to protect his dignity in the eyes of his wife in the aftermath of an attack.",
    "title": "Firstborn",
    "year": 2017
}