{
    "countries": [
        "South Africa"
    ],
    "description": "Years ago, in the heart of the apartheid era, young Tau was a fiery, idealistic boy. Aching to be a man and chafing to be a hero fighting against the injustice on display all around him, Tau and his youthful friends would dream of a life as rebel fighters struggling against oppression. A life as the Five Fingers Of Marseilles.\n\nBut real life is seldom as simple as dreams, and dreams have a tendency to corrupt. Years later, Tau still has the fire though the ideals were left behind decades before. Apartheid has gone but justice has not come in its stead and after years of drifting aimlessly, Tau decides it is finally time to come back home to Marseilles. And while he never became the hero he dreamed of, Tau may prove to be exactly the reluctant hero that Marseilles needs.\n\nThere is a wave of talent about to crest in South African cinema, a wave that will completely redefine the international perception of what African cinema can be. And right at the vanguard of that wave is director Michael Matthews with his sumptuous western FIVE FINGERS FOR MARSEILLES.\n\nShot entirely in the Sesotho language and taking enormous advantage of the stunning vistas of South Africa's Eastern Cape, Matthews' debut feature takes the tropes of the classical western and gives them fresh life by transposing them into the murky moral world of post-apartheid South Africa, a country where the idealistic dream of the Rainbow Nation is quickly sliding away into cynicism. There are no true heroes in this world, only varying degrees of corruption, complacency and acceptance. It's a world where the oppressed have become the oppressors and heroism comes accompanied less by ideals than with a baffled sense of \"how the hell did we end up here?\" It is a gorgeous, complex world and one of the most striking debuts of recent years. (Todd Brown)",
    "directors": [
        "Michael Matthews"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/five-fingers-for-marseilles"
    },
    "runtime": 120,
    "synopsis": "A troubled young man returns to the town he fled as a youth and is forced to confront his past (and the town's difficult future) in this gorgeous Sesotho language western.",
    "title": "Five Fingers for Marseilles",
    "year": 2017
}