{
    "countries": [
        "United States"
    ],
    "description": "At first glance, GERALD'S GAME might not seem like an ideal choice for a movie adaptation. After all, the terrific book by Stephen King is largely thrust forward through the internal monologues of its lead character, who spends most of her time handcuffed to a bed.\n\nBut this is exactly the kind of setup that seems to inspire Mike Flanagan to be as inventive as possible. Without losing the feel of the story and with the help of his two terrific lead performers, Flanagan opens up the story without ever compromising it.\n\nThe setup is simple. Jessie (Carla Gugino) and her husband Gerald are on a weekend getaway to see if they can inject some much needed excitement into their stale marriage. However, a bedroom fantasy goes wrong and soon Gerald's dead and Jessie... well, she's handcuffed to the bed. Now Jessie's only aim is to survive.\n\nThere are plenty of surprises in what might seem like a tame story and the film also features perhaps the most wince-inducing sequence in any Fantastic Fest film this year. But more than that, GERALD'S GAME features two towering, amazing performances. Carla Gugino is revelatory as not only Jessie, but also the facets of Jessie's personality that all appear in one form or another. As Gerald, Bruce Greenwood shows that he can do mean as well as the best of them. For a film relying so heavily on two performers, it's a testament to Mike Flanagan's talent that the pace never falters and you never lose interest in what's going on.\n\nThis is a Stephen King story and there are, of course, plenty of surprises and developments that all work towards a beautiful finale. If you're a fan of the book, you're definitely in for a surprise. If you're a fan of Flanagan, this is yet another notch on the talented director's belt. And if you're a fan of smart, subversive, character-based horror, you're in for one hell of a ride. (Evrim Ersoy)",
    "directors": [
        "Mike Flanagan"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/geralds-game"
    },
    "runtime": 103,
    "synopsis": "Flanagan unites with master of the macabre Stephen King for his cinematic interpretation of King's beloved GERALD'S GAME. Starring Carla Gugino and Bruce Greenwood, GERALD'S GAME delivers pitch-perfect performances in a faithful adaptation where the horrors of the mind are much worse than what's in front of you.",
    "title": "Gerald's Game",
    "year": 2017
}