{
    "countries": [
        "United States"
    ],
    "description": "Chances are, even someone who doesn't immediately recognize the name would know Gilbert Gottfried through his role in films like PROBLEM CHILD or the use of his voice in Disney's ALADDIN, or maybe even through the news reports on the controversial joke that saw him stop voicing the Aflac duck.\n\nBut these facets are part of a very complex man whose real personality lies much, much deeper. And with unrestricted access, director Neil Berkeley manages to carve out a portrait of the man who turns out to be much, much different from what any of us would expect.\n\nWhether it's Gilbert's relationship with his wife and daughters or his devotion to his wonderful mother and sisters, what shines through is the compassion of a man who's clearly more comfortable in discomforting others than displaying his emotions. Gilbert himself, dressed in a white robe at his own apartment, seems more unguarded and relaxed than he has ever appeared before, and it's these moments that go a long way to explain how someone can combine so many conflicting personalities into one mind. Impressions of the man are provided by fellow comics, actors and colleagues who simply shine when telling stories about him.\n\nShot unintrusively, almost like a home video meant for private eyes, GILBERT is a wonderful, touching documentary that manages to eke out laughs through real emotion. By drawing the complex portrait of a man in the public eye, the film demonstrates that underneath it all, we are very similar.\n\nI dare anyone to not laugh or get a tear in their eye during this incredible portrait that finally demonstrates in the simplest way possible why Gottfried should be regarded as a national icon; a complex flawed being trying to live life the best way possible. (Evrim Ersoy)",
    "directors": [
        "Neil Berkeley"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/gilbert"
    },
    "runtime": 99,
    "synopsis": "GILBERT is the story of Gilbert Gottfried as never seen before, both a behind-the-scenes documentary and a poignant look at the life of a comedian who has more layers than most people can imagine.",
    "title": "Gilbert",
    "year": 2017
}