{
    "countries": [
        "Brazil",
        "France"
    ],
    "description": "GOOD MANNERS, a gothic fairytale for adults, is the new feature from the brilliant minds of Juliana Rojas and Marco Dutra, whose previous feature HARD LABOR demonstrated the economic inequality prevalent in Brazil through the downfall of a family. What really set that film apart was the clever use of genre language including a crumbling wall that acted as a metaphor for the misfortunes that kept occurring.\n\nWith GOOD MANNERS, their sense of social justice and quiet exploration of the gap between rich and poor remains as vibrant and intelligent as ever, but they've really upped the stakes by the beautiful inclusion of what can only be called old school movie magic.\n\nClara, lonely and desperate, arrives at an upscale apartment building to attend an interview for the job of a live-in nanny. The interviewer is Ana, a heavily pregnant young woman who is also very isolated. Although the difference in these women's classes and backgrounds are undeniable, Ana decides to hire Clara and a friendship slowly begins to develop between the two. Clara has some dark and broken secrets but so does Ana. As the two open up more to each other, their worlds become inevitably linked.\n\nTo reveal any more would be a disservice to perhaps the most tender, humane and surprising film of the festival. From the magnificent matte painting backdrops that bring Brazil to life to the use of lullaby songs, GOOD MANNERS is a master class from two filmmakers clearly at the top of their game. The film meticulously blends both real and fantasy worlds to mesmerizing effect. Make no mistake; to experience GOOD MANNERS on the big screen is to be in the presence of wondrous filmmaking that is guaranteed to make you talk afterwards. (Evrim Ersoy)",
    "directors": [
        "Juliana Rojas",
        "Marco Dutra"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/good-manners"
    },
    "runtime": 135,
    "synopsis": "When lonely nurse Clara is hired as a nanny by wealthy Ana, she hardly expects anything like the friendship she finds with the lonely, pregnant woman. However, both women have dark secrets which will engulf all that they hold dear.",
    "title": "Good Manners",
    "year": 2017
}