{
    "countries": [
        "Germany"
    ],
    "description": "It's quite an achievement for an almost entirely silent film to effectively trigger so many emotions in its audience. HAGAZUSSA's story, although very simple, is supported by nuanced and subtle performances and absolutely breathtaking cinematography that highlights snow-covered landscapes, sun-dappled woods and misty mountainsides dotted with wildflowers. And the sound design... oh, the sound design... is quiet (until it isn't) but astonishingly evocative.\n\nHAGAZUSSA follows a young goatherd living alone in a mountain hut and intuiting a dark presence in the oppressive woods that surround her. As she grapples with uncertainty, so does the audience. Are these nightmarish visions the product of a deluded mind or a supernatural force of evil?\n\nThe knowledge that HAGAZUSSA's director Lukas Feigelfeld studied photography before switching to film and that HAGAZUSSA is not only his first feature but actually his graduation project from film school — he attended Deutsche Film-und Fernsehakademie Berlin — is enough to make you fall right out of your chair. This film is a genuine piece of German gothic, a macabre, atmospheric treasure quite unlike anything we've seen in the past years. With its black goat and aproned protagonist, some will certainly end up comparing the film to another festival favorite released last year that I refuse to name, but the strength of HAGAZUSSA resides in its singular concept and execution. It's notable that HAGAZUSSA's story takes place in the Austrian Alps, reminding us that even the most remote places in Europe suffered from the paranoid and superstitious beliefs associated with its time period.\n\nFeigelfeld delivers an impressive and haunting first feature that sets the bar very high for European Fantastique. Count on it: HAGAZUSSA certainly won't be the last you'll hear from this filmmaker. (Annick Mahnert)",
    "directors": [
        "Lukas Feigelfeld"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/hagazussa-a-heathens-curse"
    },
    "runtime": 102,
    "synopsis": "Set in the 15th Century in the Austrian Alps, Lukas Feigelfeld's HAGAZUSSA takes us back to a dark period in which even the remotest parts of Europe suffered from the paranoia and superstition of the time.",
    "title": "Hagazussa - a Heathen's Curse",
    "year": 2017
}