{
    "countries": [
        "United States"
    ],
    "description": "Americans love a good scare at Halloween and nothing quite does it like a haunted house. Almost unique to this country, haunted houses carefully traverse the ground between naff and brilliant. However, as always, there's so much more to the story than meets the eye.\n\nHAUNTERS is perhaps the most comprehensive documentary anyone's ever going to need on the subject. Starting with the history of haunted houses, the film travels the entire gamut, including their inception, their evolution and even their future. Rather than deliver a dull history lesson, each clever development is illustrated by an enlightening array of interviews with some of the most fascinating people within this niche industry. Haunters who create and build houses which are in turn smart, scary and controversial, who act out the roles of the monsters sometimes as relief and sometimes as escape, as well as the people who visit year after year. The film also touches on the psychology of fear: why we crave it, how we avoid it and how these sideshow attractions fit into the overall picture.\n\nA joy to watch from start to finish, HAUNTERS is a rare example of a documentary that boasts both an interesting subject matter and the personalities to support it. From the dedication of Shar Mayer to the controversial figure of Russ McKamey, HAUNTERS is stuffed to the gills with fascinating characters who offer unique insights into this rarely explored world.\n\nJon Schnitzer has an uncanny eye for capturing interesting interviewees and stories that both amuse and engage. Whether you're a haunted house fan or someone with zero knowledge, HAUNTERS creates the groundwork for you to be 100% fascinated with them by the time it's over. Who knows? Maybe it will even inspire you to create your own haunted house this October. (Evrim Ersoy)",
    "directors": [
        "Jon Schnitzer"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/haunters-the-art-of-the-scare"
    },
    "runtime": 88,
    "synopsis": "Delving behind the scenes of one of America's most beloved seasonal pastimes, HAUNTERS shows the world of the people who make the scariest houses, mazes and experiences that range from the traditional to the controversial.",
    "title": "Haunters: The Art of the Scare",
    "year": 2017
}