{
    "countries": [
        "Japan"
    ],
    "description": "It's back! Takashi Miike's notorious breakthrough has landed at Fantastic Fest with a glorious, eye-popping 4K restoration approved by the master himself!\n\nFor those who have never encountered the crazy world of ICHI THE KILLER, here's the chance to see where our love affair with Miike started. It's a crazed journey through the world of Yakuza with outrageous characters and grim violence, all used to comment on society's obsession with violent imagery.\n\nKakihara is the sadomasochistic enforcer of Anjo, and when his boss disappears with 300 million yen, Kakihara is responsible for locating him. Creating the most violent path possible through Tokyo, Kakihara brutalizes and maims many people until he discovers the truth, all while looking for the perfect arch enemy who can fulfill him with pain and violence. He just might get his wish in the form of Ichi: a seemingly shy young man who turns into a full-blooded, psychotic killer when sexually aroused. It's only a matter of time before the two men encounter each other in the bloodbath of the Tokyo gang scene, and when they do, worlds collide in an explosion of bodily fluids.\n\nBased on the notorious manga by Hideo Yamamoto, Miike's adaptation is both loyal and uniquely his own. The extravagant visual style he developed with his Yakuza trilogy translates here into a warped vision of Tokyo where men are all monsters and sadism is a way of life. Drawing incredible performances from his two leads, Tadanobu Asano and Nao Omori, Miike creates a world that is both sickening and enticing.\n\nIt's no exaggeration to say there has never been (nor will there ever be) another film like ICHI THE KILLER, a full-blown accusation of the audience's implication in violence, a visual masterpiece and a technicolor nightmare of ever-smarter sadism. So join us in celebrating this brilliant film as it has never been seen before on the big screen. (Evrim Ersoy)",
    "directors": [
        "Takashi Miike"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/ichi-the-killer"
    },
    "runtime": 129,
    "synopsis": "The yakuza occupy a murky universe with more twists and turns than the Shinjuku alleys they call home. The mysterious disappearance of a Tokyo mob boss triggers a hunt to find him, dead or alive. The search leads to the city's most depraved clubs and sex dens and eventually to Ichi, the schizophrenic hitman behind the crime. Even more shocking is the discovery that the mastermind who hired Ichi is a fellow gangster out for revenge.",
    "title": "Ichi the Killer: The Digitally Restored Director's Cut",
    "year": 2001
}