{
    "countries": [
        "Cambodia"
    ],
    "description": "The all-female Butterfly Gang have long been the scourge of Cambodia, their fingers in seemingly every criminal enterprise imaginable. When the police manage to capture their lone male member — a simpering dandy known as Playboy — they know this is their opportunity to bring the whole enterprise down. So Playboy is shipped off to the most secure prison in the nation for safekeeping.\n\nBut, of course, no prison is unreachable for the Butterfly Gang, and it takes barely a heartbeat for things to go wrong. Eager to earn the favor of the powerful gang, the prisoners start a riot with rival factions struggling to be the one to silence Playboy before he has the chance to speak with a small squad of police trapped inside, trying desperately to save both his life and their own.\n\nWith the burgeoning film culture of Southeast Asia and an increasing number of nations developing local language film industries, Cambodia is very much a nation on the rise. Levels of production are up with local storytellers exploring an increasingly wide range of styles and genres. Thus, we have JAILBREAK, not only the first Cambodian film ever to be selected at Fantastic Fest but also the first true martial arts film ever made in the history of the country.\n\nLocal martial arts style bokator is front and center here. There are obvious similarities to muay thai, though a very good number of differences as well. Film stars Dara Our and Tharoth Sam are both highly trained in the art with both on national level exhibition teams, Tharoth being one of a handful of Cambodian women to fight professionally. And showcasing that skill is the raw, energetic choreography from Our and imported star Jean-Paul Ly — a French-born, Chinese-Cambodian stuntman and fighter whose credits include LUCY and DOCTOR STRANGE — that quite simply never lets up. (Todd Brown)",
    "directors": [
        "Jimmy Henderson"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/jailbreak"
    },
    "runtime": 92,
    "synopsis": "Cambodia's traditional martial art of bokator is unleashed in all its bone crunching fury in this action-packed tale of police trapped in the midst of a raging prison riot.",
    "title": "Jailbreak",
    "year": 2017
}