{
    "countries": [
        "Japan"
    ],
    "description": "Stop-motion animation is meant to feel intimate, which Takahide Hori's debut feature absolutely does, but what JUNK HEAD also achieves despite the limits of its form is a sense of humongous scale and grandeur.\n\nThe human race is at the end of its rope, our engineered longevity having rendered us infertile. Our last remaining hope lies within the DNA we left behind, now residing in vast caverns far beneath the surface. The key to our survival rests with making contact with our forgotten tribes for the first time in over a millennium.\n\nLike most good science fiction, JUNK HEAD lives and breathes in its details. From the injuries of the robotic human venturing into the Earth's core, to the ranks of varied mutant clones who fix him up with a newer, friendlier face, to the winding worn-out hallways of the dimly-lit industrial subterrain, housing both a new kind of people and new kinds of monsters. These creatures alternate from friendly to deadly, including ones that turn into trees, and ones that defecate in ways you've never seen.\n\nWhile his unsettling creature designs evoke H.R. Giger, Hori's living dioramas are also imbued with pulsating electronica as the sets whiz past during fights and chases. Yet he retains a sense of whimsy about his action figure-like creations and the intricate ways in which they're humanized, augmenting partial gibberish with familiar gestures and a sense of comedic physicality in a story of unwitting Gods crossing paths with their estranged creations.\n\nBased on the director's award-winning short of the same name, JUNK HEAD is the culmination of eight years of creative vision. It's the kind of animated marvel you don't often see; an amusing world you wish you could walk into, that also happens to be a uniquely touching meditation on existence and mortality. (Siddhant Adlakha)",
    "directors": [
        "Takahide Hori"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/junk-head"
    },
    "runtime": 114,
    "synopsis": "Humanity is dying. It's been 1200 years since our rebellious clone workforce moved underground, and the only way we can survive is by plunging into the depths to learn more about our terrifying creations.",
    "title": "Junk Head",
    "year": 2017
}