{
    "countries": [
        "Hungary",
        "Germany"
    ],
    "description": "Opening with a bravura one-shot chase sequence through the forest as immigrants arriving in Hungary are hounded by the police, Kornél Mundruczó's follow-up to WHITE GOD soon becomes a searing science fiction thriller with the most precise social conscience. Drawing upon the current political climate, Mundruczó marries the classic Eastern Europe thriller with futurism while liberally dosing the entire thing with observations about human nature that are only going to ring more true with passing time.\n\nAryan is a refugee who gains the power to levitate after being shot. He is a perfect foil for Stern, a disgraced corrupt doctor. As soon as the two meet, Stern sees a way to exploit Aryan to make money while Aryan finds in Stern his only hope of ever connecting with the people he was told to find. But as the the two progress through a city divided by both corruption and a changing political landscape, they develop a tentative friendship which will have deep consequences for both of them.\n\nWith a color palette that's reminiscent of Hungarian thrillers of the '80s and '90s, JUPITER'S MOON creates a landscape that is both of now and an alternate future, where everything feels old and detached, from the buildings to the people that inhabit them. Kata Wéber's cinematography uses a kinetic handheld style to keep the audience in the thick of the action and the choice pays dividends in multiple set-pieces that range from a chase in the city to a fire fight in a hotel with an incredible sense of energy and momentum. Add to this the fact that the special effects are mainly old-school (only occasionally enhanced by CGI), and you have a science fiction epic that is unlike any other film.\n\nFull of intelligence, wit and visual daring, JUPITER'S MOON is the sort of feature that makes you sit up and pay attention to the talent behind it, and serves as more proof that Kornél Mundruczó is a talent to follow, whatever he may bring to the big screen next. (Evrim Ersoy)",
    "directors": [
        "Kornél Mundruczó"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/jupiters-moon"
    },
    "runtime": 123,
    "synopsis": "The most ambitious science fiction film of the year is also perhaps the most visually stunning. Aryan is a refugee who finds himself with the power to levitate after being shot. Stern is a disgraced, corrupt doctor. The two will meet and alter the entire world.",
    "title": "Jupiter's Moon",
    "year": 2017
}