{
    "countries": [
        "United States"
    ],
    "description": "Billy spends his evenings jacking cars. He learns the trade from his best friend Mikey, who's a decidedly poor influence in his life. Billy is an intelligent and troubled youth on the edge. He's boiling over with emotion. He lashes out at school and at his mother and stepfather. He's attempting to come to grips with his lower class station in life, being abandoned by his father and facing a seemingly hopeless future. Only Billy's connection to his girlfriend Jennifer and her tight-knit family brings out his sweeter, more human side. The relationship keeps him grounded and shows him that there may be a better way forward. Can Billy embrace love or will his tumultuous relationship with Mikey derail his future plans and send him down the bleak path that he seems destined to travel?\n\nJUVENILE — penned by and starring Blake Jenner (GLEE; EVERYBODY WANTS SOME) — is a raw, fierce portrait of an angry young man on the cusp of adulthood with everything to lose and much to gain. Melissa Benoist (SUPERGIRL; GLEE) shines as the lifeboat of Billy's world, lending a compassionate, affecting performance as Billy's girlfriend who lives a stable life, surrounded by her large family and maintaining a more gentle outlook on life. Bradley Buecker, a long time collaborator with producer Ryan Murphy, makes his feature film directing debut in a surprisingly fresh and emotionally powerful take on the \"youth gone wild\" genre.\n\nThe indie film market seems to be flooded with similar tales but JUVENILE rises tall above the crowd with both Jenner's tightly woven script and his emotionally intense performance that anchors the heart of the film. Paired with the creative direction from Buecker, JUVENILE not only looks amazing but courses with an acute sense of the emotionality of adolescence while maintaining a down-to-earth magnetic sensibility. (Noah Lee)",
    "directors": [
        "Bradley Buecker"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/juvenile"
    },
    "runtime": 87,
    "synopsis": "The emotionally powerful story of Billy, an angry youth who spends his evenings stealing cars with best friend Mikey while attempting to cultivate a stable relationship with his girlfriend Jules.",
    "title": "Juvenile",
    "year": 2017
}