{
    "countries": [
        "United Kingdom"
    ],
    "description": "Yorgos Lanthimos' latest film is an almost uncategorizable journey into the heart of darkness. Both a thriller and a parable, THE KILLING OF A SACRED DEER creates a disquieting world of horrors that strike at the heart of the calm of suburbia.\n\nColin Farrell is Steven, a brilliant neurosurgeon whose clinical attitude extends to his personal life. His interactions with his family feel almost as regimented as the post-surgery conversations he has with his colleagues.\n\nBut Steven also has a strange friendship with a 16-year-old named Martin who, on the surface, is an awkward friendly teenager who cherishes Steven's company.\n\nThings take a bizarre turn when Martin tries to bring Steven into his family. When his attempts fail, he gives Steven a frightening proposition, a choice which will determine who lives and who dies.\n\nSet in the same dry, clinical world of Lanthimos' previous films, SACRED DEER represents a departure for a director who chooses to bring new horrors which hitherto had remained in check. If DOGTOOTH was the family microcosm as a prison and THE LOBSTER was a satire on relationships, THE KILLING OF A SACRED DEER is a treatise on the evil of inaction, a brutal dissection of logic and rationalism and their failure in the face of the impossible.\n\nBlessed with amazing performances from the uniformly great cast, THE KILLING OF A SACRED DEER asks ever more difficult moral questions which no one is able to answer, but does so without ever losing sight of its dry, droll humor. Add to the mix the incredible sound design, eye-catching cinematography and perhaps the best appearance ever by Alicia Silverstone, and you have something very special.\n\nGuaranteed to spark debate, this extraordinary film will be the one title everyone will be talking about long after the festival is over. Do not miss this chance! (Evrim Ersoy)",
    "directors": [
        "Yorgos Lanthimos"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/killing-of-a-sacred-deer"
    },
    "runtime": 120,
    "synopsis": "The life of a brilliant surgeon is thrown into disarray when his friendship with a bizarre teenager threatens the lives of his entire family. Faced with a frightening choice, the man will be forced to assess all that he's ever done.",
    "title": "Killing of a Sacred Deer",
    "year": 2017
}