{
    "countries": [
        "United States"
    ],
    "description": "There are many mavericks in the history of American independent cinema but there is only one Larry Cohen. Called \"the John Cassavetes of exploitation\" by another free-spirited figure of genre cinema, Joe Dante, Cohen's numerous memorable films spanning three decades are recognizable by their guerrilla style and the larger-than-life performances by his actors. From BONE and BLACK CAESAR to Q THE WINGED SERPENT, GOD TOLD ME TO, IT'S ALIVE and THE STUFF, Cohen has always left his unmissable mark on every genre of film he's touched. And now the man who has been telling stories for a living since 1960 is finally having his own told.\n\nKING COHEN is a seriously fun celebration and comprehensive history of one of the medium's great artists. From his early start in television, Cohen has been an unstoppable idea man and a talented writer. Once he got a taste for direction, the world was truly forever blessed with his unique brand of filmmaking. Shooting guerilla-style on the streets of New York and performing stunts before asking his actors to do so, Cohen's raw energy and brilliant imagination has left an imprint on cinema. It's no wonder so many of his incredible peers would eagerly sit down to pay tribute to this one-of-a-kind filmmaker.\n\nFeaturing an impressive roster of interviews including J.J. Abrams, Yaphet Kotto, John Landis, Traci Lords and Robert Forster, KING COHEN is a documentary befitting a man of Cohen's legacy. There are few filmmakers who have so consistently and thoroughly defined a period of moviemaking as Cohen has with exploitation cinema, and entire generations of genre fans have grown up with his work. We here at Fantastic Fest couldn't be more excited to share KING COHEN with those lifetime fans and new ones he'll certainly have after watching. (Brian Kelley)\n\nLarry Cohen will be in attendance at the Friday, September 22nd screening of KING COHEN",
    "directors": [
        "Steve Mitchell"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/king-cohen"
    },
    "runtime": 104,
    "synopsis": "Featuring interviews from some of the biggest names in genre cinema including Joe Dante, Robert Forster and Fred Williamson, this documentary tells the story of one of the best and hardest working exploitation filmmakers.",
    "title": "King Cohen",
    "year": 2017
}