{
    "countries": [
        "Canada"
    ],
    "description": "Proving that even in the very popular zombie subgenre there's still a lot of interesting and new things to say, Robin Aubert's LES AFFAMES does not so much reinvent anything as realign.\n\nThe time is now. The setting is the provincial Quebec countryside. In quick fashion, we are introduced to the survivors of a plague: a businesswoman with an odd bloodlust, a young man who seems to have adjusted to the idea of this ongoing apocalypse, and a young boy from a local farm who seems to be wracked with guilt. All are trying to survive in this reality that has come out of nowhere, and slowly but surely, their paths cross. Their journey together will lead them to understand both the plague and each other, and the answers they find will not be easy or pleasant.\n\nAubert's take on the zombie myth is full of local flavor. His understanding of the Québécois countryside translates into stunning, surreal images and he creates a new sub-breed of genre with his take on the Canadian flesh eaters who are as dazed and confused by the survivors that surround them.\n\nThe structure of the film mimics the journey of its ragtag group of characters who run the gamut of Canadian society. Their interactions reflect the political systems in play and act as almost archaic reminders of what is being eroded by this new threat. As their journey continues, images start to repeat, surreal encounters weave in and out of the plot, and a general sense of loss affects not just the characters but the meta-structure of the actual film.\n\nCleverly utilizing the natural isolation of the countryside and mining an eerie soundtrack to great effect, LES AFFAMES traps us in isolation in Quebec in the most frightening way possible. By forcing us to face our own reactions and attitudes, it reinforces the frightening idea that the greatest danger to us may not be external forces but the monsters we keep breeding within ourselves. (Evrim Ersoy)",
    "directors": [
        "Robin Aubert"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/les-affames"
    },
    "runtime": 100,
    "synopsis": "In the remote Quebec countryside, things are not well. A plague has infected the land, affecting almost all the residents of a small village. The survivors have to navigate their new existence as well as deal with the infected with an appetite for flesh.",
    "title": "Les Affames",
    "year": 2017
}