{
    "countries": [
        "Belgium",
        "France"
    ],
    "description": "Cattet and Forzani are two of the most interesting filmmakers working today. With their debut AMER, they distilled the giallo into its purest form, delighting both purists and newcomers. With THE STRANGE COLOR OF YOUR BODY'S TEARS, they introduced experimentation in form to the mix, creating a world like no other. And now, with LET THE CORPSES TAN, they bring their visual style to an adaptation of one of the great pulp novels.\n\nThe plot is seemingly simple. Rhino and his men are camped at a run-down villa on the outskirts of the Mediterrenean run by a formidable landlady and her partner. The place has seen better days; once the playground for orgies and wild parties, it now sits quiet and rotting. For some, this is a disappointing place, but for Rhino, it's the perfect hideout. Because Rhino has a plan: he and his men have executed a pitch perfect robbery by grabbing 250 kilograms of gold. Now all they have to do is get back and wait until they can split it.\n\nBut nothing is ever that simple. The arrival of some unexpected guests turn this idyllic corner of the Mediterranean into a battleground. Get ready for the ultimate war for survival between crooks and crooked souls!\n\nVisually stunning, expertly edited with multiple timelines and featuring killer sound design, LET THE CORPSES TAN is perhaps the most cinematic of all experiences at this year's festival. Full of clever touches, excess gun violence and the most vibrant palette this side of Technicolor, this blood-soaked daytime nightmare is something that once experienced will never be forgotten. LET THE CORPSES TAN is a love letter filled with innovation, an adaptation that highlights the economy of storytelling and a crazy fever dream that fills you with glee. All this and more, LET THE CORPSES TAN is a masterpiece. (Evrim Ersoy)",
    "directors": [
        "Héléne Cattet",
        "Bruno Forzani"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/let-the-corpses-tan"
    },
    "runtime": 92,
    "synopsis": "On a beautiful corner of the Mediterranean, Rhino and his men take refuge after the robbery of 250 kilograms of gold. The plan is simple: Wait and split. But some unwanted visitors are about to turn this idyllic corner into a bloodbath.",
    "title": "Let the Corpses Tan",
    "year": 2017
}