{
    "countries": [
        "Canada"
    ],
    "description": "The image is a pure, small town idyll: a strapping young man, well groomed, plaid shirt carefully tucked into his jeans gazes into camera. His thumbs thrust into belt loops, the cattle pens behind him serving as a backdrop for what could be a perfect representation of American farm life, if not for the fact that this is (very much) Canada. And then he speaks:\n\n\"You heard some city gals talking about paying to get their pubic hair ripped out with wax. Tell you what, grab a cow by the tail and they'll kick you in the box for free if that's what you're into.\"\n\nIt was 2013, and this was the introduction of Jared Keeso as Wayne in LETTERKENNY PROBLEMS, a series of YouTube shorts that became a viral phenomenon north of the border in 2013. The formula was this: Wayne and farming compatriot Darryl (Nathan Dales) look straight into the camera and deliver in perfectly deadpan fashion the daily problems and confusions of country farm folk relative to their big city cousins and the various other factions of rural life. It's simple. It's hysterical. And, as anyone who has grown up anywhere outside of a major city will tell you, it is freakishly accurate. It's now also an ongoing television series that has become a legitimate phenomenon in Canada, crossing the border for the first time now as we present the series at Fantastic Fest.\n\nThe transition to series has been a remarkably smooth one. The cast has expanded slightly, with more room given to supporting players, and director Jacob Tierney (GOOD NEIGHBOURS; THE TROTSKY) bringing sure hand with long form storytelling. But the core remains resolutely the interplay between Keeso's Wayne, Dales' Darryl and their dry-as-a-desert delivery of the most outrageous monologues and one-liners imaginable. This is a comedy classic just waiting to be discovered by the rest of the world. (Todd Brown)",
    "directors": [
        "Jacob Tierney"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/letterkenny"
    },
    "runtime": 151,
    "synopsis": "The spiritual successors to STRANGE BREW's Bob and Doug MacKenzie, the rural residents of the fictitious town of LETTERKENNY deliver a hysterical slice of Canadiana in the comedy phenomenon chronicling the daily problems of hicks, skids, hockey players and Christians.",
    "title": "Letterkenny",
    "year": 2016
}