{
    "countries": [
        "France"
    ],
    "description": "The second of French director Jean Rollin's infamous vampire films and his sophomore feature effort, THE NUDE VAMPIRE (1970) takes an unusual, surrealistic approach to classic vampire tropes. A wealthy industrialist (Maurice Lemaitre) keeps a beautiful young girl (Caroline Cartier) hostage in his urban villa, believing her to be a vampire, and allows her to prey on a suicide cult while he has scientists analyze her blood. Through her, he hopes to uncover the key to immortal life, but his son (Olivier Rollin) catches a glimpse of her, falls in love and is determined to set her free. This budding romance pits father against son in a dizzying showdown set at two of Rollin's most beloved locations: a Gothic castle and a lonely French beach.\n\nUsing his trademark visual style, influenced in this case by Georges Franju's cult classic JUDEX (1963), Rollin transforms the stark palette of earlier black and white vampire fare explored by Universal Studios in the '30s and '40s and Italian Gothic filmmakers in the '60s into a colorful, countercultural tale.\n\nThe film is far from a straightforward interpretation of the horror genre and belongs to the nebulous, eerie realm of the French fantastique. Touching upon sinister cults, mad science and vampires as the next stage in human evolution, Rollin turns the film into a hopeful look at the class warfare plaguing Paris streets a few years earlier in 1968, resulting in an utterly unique genre experience.\n\nThe film will be screened in celebration of the launch of the new book from publisher Spectacular Optical, LOST GIRLS: THE PHANTASMAGORICAL CINEMA OF JEAN ROLLIN — the first examination of Rollin's work to be written by all women critics, scholars and film historians — and will be introduced by the book's editor/publisher Kier-La Janisse. (Samm Deighan)",
    "directors": [
        "Jean Rollin"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/lost-girls-book-launch-the-nude-vampire-presented-by-kier-la-janisse"
    },
    "runtime": 88,
    "synopsis": "Jean Rollin's THE NUDE VAMPIRE (1970) follows a sinister businessman who's keeping a young vampire girl captive and experimenting on her in the hope that he finds the key to eternal life.",
    "title": "Lost Girls Book Launch: The Nude Vampire Presented by Kier-La Janisse",
    "year": 1970
}