{
    "countries": [
        "United States",
        "Canada"
    ],
    "description": "After reading a description of LOVE AND SAUCERS, your first reaction would probably be a smile and a compassionate slap on the shoulder of our lead David Huggins, a man who supposedly lost his virginity to an extraterrestrial being, leading to a longtime interspecies romantic relationship. And no one would blame you for doing so.\n\nHuggins, now 72 years old, claims to have been in contact with these otherworldly beings over the course of his entire life, turning to art to express and immortalize his (sexual) encounters, encouraged by the extraterrestrial to do so. His art is surreal, simple and almost childish. But the moments Huggins has chosen to put on canvas are fascinating and intriguing and correspond to very specific events in his life.\n\nThe strength of Brad Abraham's documentary resides in the fact that it manages to change your view on Huggins, turning probable disbelief into tolerance and even acceptance. Abraham depicts the portrait of a rather charming man who genuinely and truthfully believes the extraordinary events that happened to him, cleverly avoiding the pitfalls of portraying Huggins as a madman and at the same time skillfully raising the question of who we are to judge another person's beliefs. After being briefly introduced to other people at an art gallery who are deeply fascinated and seem to fully assimilate Huggin's experiences, we end up asking ourselves: What if there really is someone else out there? What if we missed out and David Huggins is actually the lucky one?\n\nA beautiful and humane documentary, LOVE AND SAUCERS portrays the intimate world of an artist who is just a little bit different than the norm. A joyous, beautiful experience. (Annick Mahnert)",
    "directors": [
        "Brad Abrahams"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/love-and-saucers"
    },
    "runtime": 67,
    "synopsis": "David Huggins, a 72-year-old man who claims to have lost his virginity as a young man to an extraterrestrial being, turned to art to express his interspecies romance and lifelong relationship with the otherworldly.",
    "title": "Love and Saucers",
    "year": 2017
}