{
    "countries": [
        "Japan"
    ],
    "description": "As the first film out of former Studio Ghibli producer Yoshiaki Nishimura's new Studio Ponoc, MARY AND THE WITCH'S FLOWER serves as a dazzling and heartwarming introduction to a new powerhouse in the world of animation. Directed by Hiromasa Yonebayashi (who helmed THE SECRET WORLD OF ARRIETTY and WHEN MARNIE WAS THERE for Ghibli and served as key animator on several Miyazaki features), the film is an adaptation of Mary Stewart's 1971 magic-filled coming-of-age children's book THE LITTLE BROOMSTICK. Those looking for a bit of respite from exploding faces, gratuitous nudity and blood-soaked tales of revenge should make their way to MARY AND THE WITCH'S FLOWER for a healthy dose of good feels.\n\nMary is trying to find her footing after moving to the countryside to live with her great aunt. She does her best to try and help her great aunt out — failing miserably — and finds herself overshadowed by Peter who is one of the only other kids her age in town. Something incredible finally happens to plain ol' Mary when a cat leads her to a beautiful glowing flower and a broomstick in the woods. Whisked away to a school for witches where she is quickly praised for her newfound, strangely impressive powers, Mary basks in the attention until she makes some disturbing discoveries about a few of her teachers.\n\nMARY AND THE WITCH'S FLOWER is a high-energy spectacle of color and sound. Yonebayashi lets every bit of his childlike imagination turn a story of a girl who is very ordinary into something that is anything but. Mary's journey into the world of witchcraft is bright and beautiful to behold, a true big screen experience that fulfills childhood fantasies of the extravagance of the sight of magic, all wielded by a little girl who, until now, thought her life and herself to be nothing special. MARY AND THE WITCH'S FLOWER is a joyous film full of wonder and we can't wait to see what Studio Ponoc does next. (Brian Kelley)",
    "directors": [
        "Hiromasa Yonebayashi"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/mary-and-the-witchs-flower"
    },
    "runtime": 102,
    "synopsis": "Directing the first film out of Studio Ponoc, Hiromasa Yonebayashi (WHEN MARNIE WAS THERE) creates the dazzling and heartwarming story of an ordinary girl who becomes an extraordinary witch.",
    "title": "Mary and the Witch's Flower",
    "year": 2017
}