{
    "countries": [
        "Spain"
    ],
    "description": "Alec and Sasa are a couple in love on a trip to the heart of Bosnia and Herzegovina. Sasa is uneasy about being back in a place she thought she'd permanently escaped. Her instincts tell her that they are surrounded by something evil. As they go deeper into the forest and their car breaks down, Sasa clings deeply to her hamajlija — a Muslim amulet — to keep her safe. However it's not long before the couple run into two hunters, Vuk and Milos. It's this encounter that will be the reckoning for all four people, but the results will be nothing like anyone could have imagined.\n\nYayo Herrero's arrival on the horror scene is this gut-punch of a film, which operates on so many layers that it will take multiple viewings to decipher its commentary. On one hand, the story of Alec and Sasa is a familiar setting: a couple in love stranded in the woods. Their encounter with the huntsmen pushes further into familiar territory as paranoia, betrayal and violence rear their ugly heads.\n\nHowever, there's another element which plays with all of our expectations; Sasa is a Muslim survivor of the brutal war in the region and the huntsmen are Serbian. So instead of the usual good versus evil cliches, Herrero provides a master class in the art of miscommunication and misunderstanding. As reality blurs, we're never sure about the true intentions of any of the characters. Add to this the fact that Alec is German — a nice European boy who is both polite and out of his element — and the film opens up to multiple types of readings. As the story expands, it takes into account a much larger picture; it is both an examination of the state of the nation and a horror story. The forest becomes a prison for all the characters who desperately fight against their own prejudices and try not to repeat the mistakes of the past. It's this fight that Yayo Herrero is most interested in exploring with his sharp eye.\n\nIt's not an exaggeration to suggest that if any film at Fantastic Fest deserves and requires debate and discussion, MAUS is that film. One thing is certain: MAUS marks the arrival of a major new talent whose unique voice is definitely something to highlight and celebrate. (Evrim Ersoy)",
    "directors": [
        "Yayo Herrero"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/maus"
    },
    "runtime": 90,
    "synopsis": "Yayo Herrero's directorial debut is a couple's nightmare journey into the heart of darkness. A superlative horror parable, this shocking film is an indictment of modern history, war and the difficulties of reconciliation. It is a story for our times.",
    "title": "Maus",
    "year": 2017
}