{
    "countries": [
        "United States"
    ],
    "description": "Picture an idyllic suburb like any other in America. The town is filled with rows of tract houses and smiling families going about their daily lives. It's just another day, except for a random news report about a mother leaving her child in a truck on the train tracks and letting an oncoming locomotive smash into it.\n\nCarly and Josh go about their day, dealing with school classes, texting their friends and putzing around the house. When an unknown mass psychosis goes rampant, they, along with every kid in town, end up fighting for their lives against MOM AND DAD.\n\nThe latest film from Brian Taylor (CRANK; GAMER) brings the director's signature insanity to the screen once again. This time, Taylor tackles the family dynamic and the tension of suburban existence. Not only do we get to explore the fun side of filicide, but we also get to tear down some emotional walls in this modern update of exploitation cinema. Taylor delves into a pitch black, wholly comedic look into the dark side of family life, growing up and learning that your parents aren't necessarily who you think they are.\n\nMad props to Anne Winters and Zackary Arthur as the children who have to strive for survival, especially since they are working alongside two amazing, well known actors. Selma Blair shines as not just an emotional anchor early on in the film, but by also bringing her own intensity home for family time. This is no small feat, as the one person that you want to see unhinged on screen — Nicolas Cage — is allowed to let his signature style fly totally free.\n\nPairing a judiciously unhinged script with one of the most hilarious needle drops in film this year, no child is safe in MOM AND DAD. You will never hear REO Speedwagon the same way again! (Noah Lee)",
    "directors": [
        "Brian Taylor"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/mom-and-dad"
    },
    "runtime": 83,
    "synopsis": "Selma Blair and Nicolas Cage are seemingly ideal parents until an unknown force causes their town's adults to murder their offspring.",
    "title": "Mom and Dad",
    "year": 2017
}