{
    "countries": [
        "Taiwan",
        "Province of China"
    ],
    "description": "Bullying is a topic that will never cease to be talked about. There isn't a single society in the world where this activity is not practiced. Based on reports, Taiwan is a country where bullying is severely underestimated and where in 2013, suicide was the most common cause of death among high school and college students.\n\nMON MON MON MONSTERS starts as a regular bullying movie with a boy, Shu-wei Lin, who is unlucky enough to have become the target of a group of \"cool kids\" who do everything in their power to make his life miserable. Sometimes it's little things. Sometimes it's more. As a viewer, you get angry when the higher authorities who are supposed to protect the victim end up shielding the tormentors. When Shu-wei is forcibly paired up with the bullies in an attempt to patch the relationship, the story takes a straight turn towards more insidious evil. The group is sent out to do social work with elders and the bullying extends even to those poor souls. This is where the relief comes for the boy. Asked to participate, he sees this as a desperate solution to \"belong,\" turning into what he loathes the most.\n\nBut Giddens Ko didn't just make a film about bullies. His intent is to really show how far a human being can become a monster to stop their own suffering. Adding the fantastic element of flesh-eating creatures could have toned down the violence because if your victim isn't human and doesn't exist in real life, the bullying you undertake could be considered pure fiction. Ko brilliantly avoids this trap by involving Shu-wei in a new level of persecution and you can only suffer with the creature, now a helpless victim who has taken the place of the boy. The horror in this story isn't the creature or the bullying itself. It's how a boy who has had enough loses his humanity and goes against every principle he has for some relief from his suffering. (Annick Mahnert)",
    "directors": [
        "Giddens Ko"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/mon-mon-mon-monsters"
    },
    "runtime": 112,
    "synopsis": "A bullied schoolboy is teamed up with his tormentors to do community social work. While on duty, they encounter a strange creature which they kidnap, and take bullying to a whole new level.",
    "title": "Mon Mon Mon Monsters",
    "year": 2017
}