{
    "countries": [
        "United States"
    ],
    "description": "Filled with pathos and melancholy, MY FRIEND DAHMER is a year spent in the company of Jeffrey Dahmer, one of the most nefarious serial killers in the annals of crime.\n\nBut this story begins earlier.\n\nThis is the story of a lonely boy named Jeffrey whose parents are divorcing, whose dad forces him to change his hobbies in order to avoid the pitfalls he fell into, whose friends only hang out with him to force him into embarrassing dares, and who is full of conflicting emotions, desires and feelings that he is unable to communicate.\n\nFeaturing an incredible, mesmerizing and heart-breaking performance by Ross Lynch, MY FRIEND DAHMER is an incredible adaptation of the comic book of the same name. Rather than try to focus on Dahmer's violent crimes, the film digs deeper under the skin of the teen who would become one of America's boogeymen. By looking at a character for whom a lot could have been different, MY FRIEND DAHMER reminds us that monsters are not born but shaped through encounters with the world around them. The rest of the cast gamely match up to Lynch's performance including a brilliant Anne Heche as Dahmer's equally adrift mother.\n\nUsing serial killer film tropes but turning them on their head to create an increasing sense of sad inevitability, MY FRIEND DAHMER is elegant character study at its best. Capturing a sense of small town America that resonates with every frame, the film ambles through the heartbreaking story of a boy who ended up becoming a vicious violent murderer while never resorting to cheap answers or pop psychology. By holding up a mirror to society at large, MY FRIEND DAHMER asks difficult questions of us all. And perhaps makes us give some answers that cause discomfort by suggesting the truths we'd rather avoid. (Evrim Ersoy)",
    "directors": [
        "Marc Meyers"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/my-friend-dahmer"
    },
    "runtime": 107,
    "synopsis": "This is the story of Jeffrey Dahmer, a high school loner whose life would shape up to be something far more frightening than anyone could have imagined.",
    "title": "My Friend Dahmer",
    "year": 2017
}