{
    "countries": [
        "United States"
    ],
    "description": "Guilt has always been a powerful motivation in fiction and even those who've never read Dostoyevsky's 19th Century novel CRIME AND PUNISHMENT know the basic theme: there are actions in life that we can never forget because they are drilled down into the deepest and darkest parts of ourselves. So leave it to Stephen King and genre visionary Zak Hilditch to give us a version of CRIME AND PUNISHMENT that incorporates sheer cinematic horror.\n\nThomas Jane plays Wilfred James. Tied to his farm because of both his fear of the city and the importance that the farm has played as it has been passed down from his father and grandfather, Wilfred is in constant conflict with his wife Arlette (Molly Parker) who wants to move. When Arlette decides to leave him for the city and make his property worthless in the process, Wilfred is forced to take action to stop her and he manipulates their son Henry into helping him.\n\nIn 1922, King reuses one of his most popular plot devices: the dead don't have to stay dead. But here, not only is it scary, but it's absorbing due to an incredible performance by Thomas Jane, who is almost unrecognizable in this role. Jane is 1922's Rodion Raskolnikov and you can feel the guilt on nearly every word that escapes Wilfred's tortured soul. He's also not anything close to the embodiment of Hollywood masculinity that you're used to seeing. He's fragile here and as the movie goes on, Jane's performance and appearance seems to get remarkably frailer.\n\n2017 is giving us lots of Stephen King. DARK TOWER and IT have both come out in theaters. Television is giving us GERALD'S GAME and 1922. It's a wonderful time for King fans as well as for audiences who appreciate the horrible coming from the ordinary. (James Emanuel Shapiro)",
    "directors": [
        "Zak Hilditch"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/nineteen-twenty-two"
    },
    "runtime": 101,
    "synopsis": "1922 is based on Stephen King's 131-page story telling of a man's confession of his wife's murder. The tale is told from the perspective of Wilfred James, the story's unreliable narrator who admits to killing his wife, Arlette, in Nebraska. But after he buries her body, he finds himself terrorized by rats and, as his life begins to unravel, he becomes convinced his wife is haunting him.",
    "title": "1922",
    "year": 2017
}