{
    "countries": [
        "United Kingdom"
    ],
    "description": "Awkward Iona (Lily Newmark) and her cat-obsessed, hunchbacked mother Lyn (Joanna Scanlan) arrive in a new town, optimistic about their chances for starting a new life. At school, Iona finds herself in the sights of a vicious group of girls, brazen bullies who immediately see an opportunity to take advantage of her naïvety and desire for companionship other than her mother's. Meanwhile, Lyn's own attempts to make friends — and her subsequent quest to retrieve the ladder which she has lent her neighbor — have similarly pathetic results. Both mother and daughter seek comfort in fantasy, letting their delusions fuel real-world decisions with tragic consequences.\n\nPIN CUSHION is exactly the kind of difficult-to-label film from a unique voice — in this case being the feature debut of British shorts filmmaker Deborah Haywood — that we love to discover at Fantastic Fest. Haywood takes a story of cyclical and generational effects of bullying and, by applying an almost gothic fable veneer, produces an experience that is deceptively enchanting as it unfolds into something increasingly unsettling. Balancing the colorful visuals and a playful, memorable score are stellar performances from Newmark and Scanlan, whose heartbreaking humanity prevent the audience, like their characters, from ever being able to fully escape into their fantasies.\n\nAs Iona's new friends reveal their true and dark colors and Lyn realizes the torment that has quickly clouded their lives was inevitable, the fairytale slowly morphs into a nightmare. These are characters bound not just by blood, but by a shared inability to acknowledge and process their own cruel realities. Those who choose to succumb to Haywood's riveting and truly singular new voice will find PIN CUSHION a challenging and altogether rewarding experience, reminding us that sometimes the most awe-inspiring of silver screen spectacles is raw human emotion. (Brian Kelley)",
    "directors": [
        "Deborah Haywood"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/pin-cushion"
    },
    "runtime": 85,
    "synopsis": "In this wholly unique blend of gothic fairytale and heart-wrenchingly real emotion from first-time feature director Deborah Haywood, Iona and her mother arrive in a new town hoping for a better life, but find themselves targeted by bullies.",
    "title": "Pin Cushion",
    "year": 2017
}