{
    "countries": [
        "Australia"
    ],
    "description": "Fantastic Fest thrives in shining a light on emerging filmmakers who have a distinct vision and an original voice. Luke Shanahan's premiere feature RABBIT clearly falls into this category as it boasts an electric combination of beautiful cinematography, outstanding sound design, a stellar cast and a twisted science fiction-tinged storyline that succeeds at drawing emotional depth from its characters.\n\nMaude and Cleo are twin sisters, albeit sisters who are estranged both emotionally and via distance. Maude has left to explore her own identity away from Adelaide, refusing to see her sister staring back at her when looking into a mirror. A year after she is told that Cleo has passed away, Maude becomes possessed by vivid visions and dreams of her twin's still-breathing existence, her kidnapping by a strange group of people and being held hostage in a remote bunkhouse with seemingly malicious intent. Upon journeying home, Maude teams up with detective Henry and Cleo's partner Ralph to find her sister. Their exploration into the outback to discover the truth unlocks a darker and more sinister revelation than her visions could imagine.\n\nRABBIT opens with a jaw dropping, beautiful and audibly stunning scene of a girl running through a forest while being chased by unknown attackers. This sets the tone for the rest of Shanahan's film, which is an intense portrait of the connections between twins as viewed through a science fiction lens and tinged with the elements of horror. The use of composer Michael Darren's near assault-like electro soundtrack both drives the darker elements of the film while maintaining an elevated tension throughout.\n\nWhile the entire cast, including Alex Russell (CHRONICLE), Jonny Pasvolsky (WESTWORLD), and Veerle Baetens (THE BROKEN CIRCLE BREAKDOWN; TABULA RASA) are outstanding in their own right, it's Adelaide Clemens as twin sisters Maude and Cleo who anchors RABBIT. She is mystifying in her dual roles, displaying a meticulous range of depth in uncomfortable and poignant moments. Along with the dazzling direction from Shanahan, Clemens beautifully captures the duality and depth necessary to elevate RABBIT from a cold, basic thriller to a haunting, memorable journey and a jaw-dropping debut. (Noah Lee)",
    "directors": [
        "Luke Shanahan"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/rabbit"
    },
    "runtime": 99,
    "synopsis": "After a full year, Maude is still stricken by visions of her sister Cleo's kidnapping. Believing that Cleo is still alive, Maude undergoes a suspenseful journey to find her in this stunning, atmospheric feature debut from Luke Shanahan.",
    "title": "Rabbit",
    "year": 2017
}