{
    "countries": [
        "Canada"
    ],
    "description": "RADIUS opens up with Liam waking up from a car crash: dazed, confused and lost. He has no memory of what happened or how he got there. Survival instinct kicking in, Liam tries to reach civilization; in this instance, any house or farm he might find. However, as he gets closer to people and wildlife, he discovers that there's a truth he is not aware of: any living being that comes within a certain radius of him will die instantly. Now his journey takes a complicated turn; he needs to not only discover what happened to him, but do so without endangering the rest of humanity.\n\nMixing science fiction, mystery and compassion to amazing effect, Caroline Labrèche and Steeve Léonard's inventive movie uses a unique hook to draw the audience in: the idea of a man whose radius is deadly is perhaps one of the most interesting visual cues in a long while. This is a frightening idea made even more impressive by its execution.\n\nAs Liam's journey progresses, he will run into Jane, another amnesiac, and the two of them will slowly unravel the bond they share. Setting an oppressive, isolated and melancholy mood throughout, the directors choose to explore the story with deliberate beats. Nothing feels rushed in this world which seems to be normal and yet is filled with some strange sense of menace.\n\nPerhaps the smartest thing about this incredible feature is how it manages to avoid the common trap of not being able to take the journey and the story to a satisfying conclusion. The incredible finale brings together all the stunning character work done in an incredible gut-punch of a sequence and will leave you and the rest of the audience reeling. (Evrim Ersoy)",
    "directors": [
        "Caroline Labrèche",
        "Steeve Léonard"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/radius"
    },
    "runtime": 91,
    "synopsis": "When a man wakes up from a car crash with no memory of what happened, his first instinct is to find help. However, as he gets closer to civilization and other people, an ugly truth will rear its head and affect all those who surround him.",
    "title": "Radius",
    "year": 2017
}