{
    "countries": [
        "France"
    ],
    "description": "Wealthy middle-aged philanderer Richard has brought his mistress Jennifer — who he believes is nothing more than a pliable bimbo — along on the hunting trip he takes each year with his old friends Stan and Dmitri. Holed up in an opulent house in the middle of the desert, accessible only via helicopter, Richard reacts violently after Jennifer threatens to tell his wife of his sexual dalliances when he refuses to support her after she's raped. This triggers a series of events that convert the quarry of the men's hunt from animal to human. As Jennifer fights to survive, her journey simultaneously reprimands both the audience and the men of the film for any regressive dismissals of her as a lollipop-sucking, sexually available airhead who was supposedly \"asking for it.\" But the question remains: we know who is guilty of committing the rape, but who exactly is driven by the eponymous thirst for vengeance, and who is simply trying to survive?\n\nWritten and directed by French filmmaker Coralie Fargeat, REVENGE is clear evidence that her shrewd, playful engagement with genre codes and conventions demonstrated in the shorts LE TÉLÉGRAMME and REALITY+ adapt even more powerfully to a feature film context. She employs all the overt trappings and yet simultaneously subverts the assumptions we make about the notorious rape-revenge trope. Marked by a slick visual style brought to life by the extraordinary cinematography of Robrecht Heyvaert, Fargeat's fearless interrogation of sexual violence, subjectivity, agency, vengeance and survival is rendered through a broad and complex intertextual palette, spanning from LOLITA and JEM AND THE HOLOGRAMS to ancient Northern European mythology.\n\nA story of transformation and a lesson in looking beyond our surface assumptions, REVENGE is a violent, difficult, spectacular and deeply intelligent reminder that the politics of rape-revenge films should never be taken for granted. (Alexandra Heller-Nicholas)",
    "directors": [
        "Coralie Fargeat"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/revenge"
    },
    "runtime": 108,
    "synopsis": "Three rich male thrill-seekers discover that Jennifer isn't the human sex doll that they assumed she was when they invited her on their isolated hunting getaway. Jennifer teaches them fundamental lessons about consent in a manner that they — and we — won't soon forget.",
    "title": "Revenge",
    "year": 2017
}