{
    "countries": [
        "Iceland"
    ],
    "description": "Breakups affect everyone differently. Gunnar, for example, has already gotten over his ex, Einar, and moved on to a serious relationship with someone new. But Einar hasn't been able to get over the relationship as easily and a chance encounter at a party has Gunnar worried about his ex's mental state. When Gunnar is awoken by an odd phone call, he makes his excuses to his current boyfriend and heads off to check on him at the isolated vacation home that his parents own. There he finds an Einar that he's unsure how to deal with, a man who's bouncing between longing and despair with alarming frequency. Gunnar can't quite decide how to handle the situation and considers leaving, but can't quite pull himself away. He gets drawn into a complicated web when both men's fears begin to manifest as external, possibly malevolent forces.\n\nIt's rare enough to see a horror film from Iceland, but to find one centered on a homosexual relationship is truly unique. While this is only his second feature, writer/director Erlingur Thoroddsen confidently paints a picture about how our fears convince us to hide from each other and ourselves. This seemingly simple relationship drama morphs into an acute thriller that slowly increases tension and an odd sense of foreboding like a crescendo. The line between what's real and what's not becomes increasingly blurry, forcing us to question everything that we're shown. The lead actors are both sensational, allowing you to feel the love that they shared and the pain that they've clearly caused each other.\n\nBeautifully shot almost like a postcard from or a love letter to Iceland, RIFT is a gorgeous, concentrated rumination on love and loss and the fear inherent in both. (Luke Mullen)",
    "directors": [
        "Erlingur Thoroddsen"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/rift"
    },
    "runtime": 111,
    "synopsis": "After a phone call from his ex wakes him late one night, Gunnar drives out to a secluded vacation cottage to save Einar from himself, but what awaits him there is mystery and confusion.",
    "title": "Rift",
    "year": 2017
}