{
    "countries": [
        "Netherlands"
    ],
    "description": "He's like totally shitfaced. Ron Goossens is a drunken stumbling mess who can stunt harder than anyone in Zundert. When his exploits are captured on film and uploaded to YouTube, he becomes an internet sensation. Unfortunately for Ron, his talents don't impress his lovely sexually bored wife who has taken to sleeping around with all of his friends. She decides that she won't leave if Ron can get Bo Maetern — the Netherlands' top actress and cover model — into bed. So begins Ron's journey into the world of not-so professional stuntman jobs in the burgeoning Dutch B-movie industry in an attempt to get intimate with luscious Bo and ultimately save his marriage.\n\nRON GOOSSENS: LOW-BUDGET STUNTMAN is a lowbrow comedy wrapped in a highbrow package, which is a skill at which Steffen Haars and Flip van der Kuil excel. RON GOOSSENS is filled with hilarious action scenes that feature a badly made-up Ron double as he works on sketchily recreated films. Some of the films you may recognize. Some maybe not. It doesn't matter as it's all delightful. You'll find yourself rooting for this drunken tool, who may have more going on underneath his exterior than his never-ending depository for beer, booze and pain.\n\nFantastic Fest loves the team of Steffen Haars, Tim Haars and Flip Van der Kuil. When we first premiered their comedy NEW KIDS TURBO, it had our audiences roaring with laughter, as did their follow-up NEW KIDS NITRO. We had to have them back for BROs BEFORE HOs, which is a slightly more mature but still hilarious slice of whimsy. Now, we're ecstatic to have them return for RON GOOSSENS: LOW-BUDGET STUNTMAN. This raunchy, sometimes offensive, yet lovable Dutch comedy is the perfect blend of the filmmakers' previous works, bringing together the raucous insanity of the NEW KIDS films and the heart of BROs BEFORE HOs in a perfect blend of low-budget yet priceless stunts, heartfelt romance and drunken exploits. So grab some beers, avoid safety measures and get stunting! (Noah Lee)",
    "directors": [
        "Steffen Haars",
        "Flip van der Kuil"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/ron-goossens-low-budget-stuntman"
    },
    "runtime": 78,
    "synopsis": "The latest from the comedic team behind the NEW KIDS films and BROs BEFORE HOs. Ron Goossens is totally shitfaced. Only by working as a movie stuntman and bedding the hottest actress in the Netherlands can Ron save his marriage.",
    "title": "Ron Goossens: Low-Budget Stuntman",
    "year": 2017
}