{
    "countries": [
        "France"
    ],
    "description": "November 1918, days before the Armistice. French soldiers huddle in the trenches, waiting for the order that will allow them to return to their lives. However, a war-hungry lieutenant forces the soldiers to execute one last attack, leaving hundreds of them dead. It is in this chaos that Édouard Péricourt and Albert Maillard's lives become intrinsically linked. A journey of unexpected scope will beckon and thrust the two men through the most amazing encounters, from heartbreak to jealousy to soul-searching honesty.\n\nAlbert Dupontel's grand adaptation of the 2013 Grand Prix-winning novel of the same name is an incredible feat of cinema from the first frame until the last. With kinetic cinematography, the writer/director plunges the audience into many worlds, each more inventive than the last. Taking on the role of Albert Maillard himself, Dupontel gives a master class in acting alongside Nahuel Pérez Biscayart in the role of Édouard Péricourt, a largely silent yet endlessly expressive role. The set design is lavish, designed to pop on the big screen, accompanied by a beautiful score acting as a reminder of just how grand cinema can be.\n\nHolding a unique position in the Fantastic Fest schedule, SEE YOU UP THERE is cinematic storytelling at its most accomplished. It's a complicated story delivered through all the scope and advantage of tools of the medium; a heartfelt love-letter to humanity, an exploration of French society at a crossroad, but most of all a bloody entertaining ride!  (Evrim Ersoy)",
    "directors": [
        "Albert Dupontel"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/see-you-up-there"
    },
    "runtime": 114,
    "synopsis": "A man sits in a Moroccan police station, accused of multiple crimes. He tells the story of a journey that starts in 1918, in the trenches days before Armistice, and takes two fascinating characters all the way through the war to Paris and beyond.",
    "title": "See You Up There",
    "year": 2017
}