{
    "countries": [
        "United States"
    ],
    "description": "Zach, Josh, Daryl and Charlie are typical teenage boys in the mid-'90s in a small town somewhere in the United States. When not playing video games or looking at girls in their yearbooks, the boys find ways to get into trouble, like stealing marijuana and weapons from Josh's brother. When an innocent and otherwise typical excursion into the woods leads to a spat amongst friends, a single violent moment will forever change the boys' lives. How the boys in SUPER DARK TIMES choose to deal with guilt and paranoia while continuing to face the overwhelming challenges of high school, childhood friendships and girls leads to many shocking and tragic consequences.\n\nDirector Kevin Phillips and co-writers Ben Collins and Luke Piotrowski have crafted a wicked film that plays with our expectations of what a genre-laced coming-of-age story can be. Their teenagers act authentic and the fim's period setting is a clever and bold statement. These SUPER DARK TIMES are very recent: we were on the cusp of having the majority of human knowledge at our fingertips at all times and the explanation for the worst decisions we made seemed to be \"boys will be boys.\" Evil has always found — and will continue to find — a way of corrupting without prejudice.\n\nSUPER DARK TIMES is an anti-nostalgia film that calls bullshit on the notion that we can take some sort of comfort by recalling a not-so-long-ago period when things were simpler and life was somehow more innocent. Anchored by some truly spectacular performances by the young men at the center of the story and armed with a script heavy on character moments that help the film transition fluidly between genres, SUPER DARK TIMES maintains a palpable sense of dread from its opening moments and delivers some nasty surprises. When truly unspeakable acts of horror occur, we aren't so much shocked by the violence as we are despondent that we saw the violence coming. (Brian Kelley)",
    "directors": [
        "Kevin Phillips"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/super-dark-times"
    },
    "runtime": 102,
    "synopsis": "A split-second act of violence forever changes the lives of two '90s kids. Now they must cope with both the fallout of that moment and the pressures of high school in this clever and bloody coming-of-age thriller.",
    "title": "Super Dark Times",
    "year": 2017
}