{
    "countries": [
        "Belgium"
    ],
    "description": "Mie suffers from a peculiar form of amnesia after a car accident. She's been torn away from her family and locked in a psych hospital (for the protection of others) when she's visited by Detective Inspector Volkers. He believes she may be involved in the disappearance of a local man named Thomas Spectre. However, Mie's amnesia causes her to forget anything that has happened after her accident if she's presented with any stressors. Any newly developed memories may be wiped clean at any time. With the clock ticking, the odds of finding Spectre become more and more slim, and with her fractured memory, unlocking the truth presents a formidable problem. The further they delve into her mind to solve the puzzle, the more Mie distrusts the people around her... as well as herself.\n\nWhile the United States is certainly experiencing a new golden age of television, there has been an equally fantastic growth in quality TV overseas, from the highly praised Nordic Noir shows to the enigmatic crime dramas out of France and the equally irresistible Icelandic thrillers. TABULA RASA, created by Malin-Sarah Gozin, continues the trend. This Belgian production has brought on such amazing actors as Veerle Baetens, who's featured in the Fantastic Fest selection RABBIT as well as the Oscar-nominated THE BROKEN CIRCLE BREAKDOWN; the prolific Hilde Van Mieghem (MADLY IN LOVE); and Gene Bervoets (SCHNEIDER VS. BAX). While those names may not yet be familiar to a U.S. audience, they're all highly regarded in their home country.\n\nCombining a quality roster of actors and directors, including Jonas Govaerts of CUB, this compelling show smartly blends timelines and fragmented memories with deep character development to draw viewers into its labyrinth of mysteries. Teetering at times between psychological thrills, tinges of horror and shrewd crime writing, TABULA RASA will tightly grip your sense of curiosity and not let go. (Noah Lee)\n\nSeries Directors: Jonas Govaerts & Kaat Beels\n\nScreenwriters: Malin-Sarah Gozin, Veerle Baetens, & Christophe Dirickx",
    "directors": [
        "Jonas Govaerts",
        "Kaat Beels"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/tabula-rasa"
    },
    "runtime": 150,
    "synopsis": "The first three episodes of a gripping Belgian psychological TV thriller about a young female amnesiac who's the key subject in a man's disappearance.",
    "title": "Tabula Rasa",
    "year": 2017
}