{
    "countries": [
        "Ireland",
        "United Kingdom",
        "France"
    ],
    "description": "\"Not another zombie film!,\" you'll scream. But THE CURED is not your typical zombie film. A dark drama that returns to the social commentary that birthed the zombie genre with NIGHT OF THE LIVING DEAD, THE CURED is thoughtful and engrossing while not skimping on the Zs.\n\nA zombie apocalypse is averted when a cure is found, and once-ravenous undead cannibals revert to being living people. One former walker receives the cure and gets to rejoin society as part of the third wave of formerly infected beings, coming home to his sister-in-law (the always-amazing Ellen Page) from whom he keeps a devastating secret. It turns out that the cured remember everything they did while infected. And they were not the brainless creatures most films feature; these guys had social behavior and were able to communicate.\n\nThe cured are rolled out into society in waves. They are allowed to go back to their families and are given what is supposed to be a second chance at life. But with the memories of the horrible actions they committed branded on their brains and a government that doesn't really give a damn about them and treats them like shit, there is just no real shot for them to heal and get back on their feet.\n\nYou can't help but draw a line between the trauma of the cured and the PTSD experienced by soldiers returning from war; once you do, it all falls into place and the story takes on a whole new significance. Tired of being labeled killers, and with no compassion or forgiveness in sight for actions, some of the cured are pushed to retaliation, with catastrophic consequences.\n\nFreyne's first feature, picking up from his short THE FIRST WAVE, shows tremendous maturity and an astute observation of human nature and how society is (mal)functioning. Fear is what usually drives people to do cruel things, and the depiction of fearful people is on point in THE CURED. If there is one message that really emerges from this film, it is that we need to stop being afraid and start caring. (Annick Mahnert)",
    "directors": [
        "David Freyne"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-cured"
    },
    "runtime": 95,
    "synopsis": "A zombie virus has hit the world… but it has been cured. What's next for the ex-zombies who have returned to normal? David Freyne's debut feature throws lots of food for thought into the mouth of your mind.",
    "title": "The Cured",
    "year": 2017
}