{
    "countries": [
        "United States"
    ],
    "description": "Justin and Aaron are stuck in a rut. Ten years after Justin prompted their escape from a doomsday cult, the duo are cleaning houses to scrape by and surviving on ramen noodles and resentment. When a package arrives with a video from the cult, Aaron convinces Justin to go back and see the people they left behind. The cult members welcome the brothers back with open arms, which is just the first in a series of unsettling red flags. Aaron is enraptured and sees the cult as a refuge from their shitty lives while Justin is wary and concerned about the increasingly strange portents. The campground that the cult calls home is an enigmatic place with mysteries and secrets of its own, which threaten to tear the siblings apart.\n\nAaron Moorhead and Justin Benson are back with this follow-up to their first film. RESOLUTION was a marvel of micro-budget filmmaking where strong acting and a well-paced story proved far more important than dollars. They went on to make SPRING, a beautiful, lyrical film with its own dark turns that we were proud to include in our 2014 program.\n\nBut THE ENDLESS is something else altogether. Taking the basic thread from RESOLUTION and expanding on it, the dynamic duo have crafted an intricate and fascinating treatise on higher powers, what it means to be a family, the nature of time and storytelling, and how integral those things are to our worldview. This is a fiercely personal film that touches on universal truths without giving easy answers. Fearlessly jumping into the lead roles themselves, Benson and Moorhead play off each other wonderfully, letting us feel their uneasy dynamic underscored by the clear bond they have with each other. THE ENDLESS is a tough, thought-provoking and ultimately fascinating film about the stories we tell ourselves, the stories we tell each other and the ways in which these stories can consume us. (Luke Mullen)",
    "directors": [
        "Justin Benson",
        "Aaron Moorhead"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-endless"
    },
    "runtime": 111,
    "synopsis": "When brothers Justin and Aaron return to the cult that they escaped from ten years ago, they encounter a web of secrets and mysteries that threatens to tear them apart.",
    "title": "The Endless",
    "year": 2017
}