{
    "countries": [
        "Sweden"
    ],
    "description": "THE SQUARE, Ruben Östlund's latest farce and follow-up to 2014's Fantastic Fest entry FORCE MAJEURE, is partially about an actual square: an exhibit at a prestigious art museum in Sweden where everyone can enter and be equal. It's where we're forced to accept each other on the terms of the social contract. It's also... well, bullshit as Östlund demonstrates through 142 minutes that range from hilarity to horror. There are limits to this tolerance and THE SQUARE spends most of its running time pushing its characters and its audience to reflect on the breaking points we have with tolerance. These are places that we've not really explored in either film or in life, and the result here proves to be as thoughtful as it is funny.\n\nÖstlund had a higher ambition for this film. FORCE MAJEURE zeroed in on the dysfunctional relationship of a married couple after the husband's faults become too much for his wife to bear. FORCE MAJEURE is certainly a more focused narrative than THE SQUARE, which almost feels episodic. That's actually refreshing because there's so much that's memorable here that the two films ultimately avoid comparison.\n\nThis feature focuses on the perfectly handsome and privileged Christian (Claes Bang, who is destined for great things), who, like the male protagonist in FORCE MAJEURE, experiences a traumatic event that's completely beyond his control and catapults him into increasingly bad decisions that reveal his true nature. It's in watching Östlund break down the main character that we get the opportunity to explore the movie's themes.\n\nThere's a lot going on in THE SQUARE, but all of it is pure entertainment. The ambition allows for Östlund to pull out some real showstoppers. THE SQUARE may shake you at times but it will leave you laughing so hard you'll be gasping for air. I was wishing it would never end. (James Emanuel Shapiro)",
    "directors": [
        "Ruben Östlund"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-square"
    },
    "runtime": 150,
    "synopsis": "An art museum director's life becomes a comedy of errors when trying to put together his latest exhibit in FORCE MAJEURE director Ruben Ostlund's latest, which won the Palme D'Or at this year's Cannes.",
    "title": "The Square",
    "year": 2017
}