{
    "countries": [
        "France",
        "Germany"
    ],
    "description": "Stories about dreamers are as old as time. But it's hard to remember the last time anyone introduced a character as brilliantly outrageous as the subject of THE PRINCE OF NOTHINGWOOD.\n\nMeet Salim Shaheen, a one-man film industry in Afghanistan whose 110 (and counting) films are the biggest success stories of his homeland. Armed with nothing more than a camera and a group of dreamers like himself, Shaheen pushes forward endlessly to make movies. Nothing can stop him from working: not war, not mines and not even his own actors!\n\nFilmmaker Sonia Kronlund follows Shaheen as he completes his latest opus — a movie based on his own life — and learns about how he became a filmmaker. She becomes a part of his crew. She is sometimes teased and sometimes frightened as the ragtag group makes their way through some of the most dangerous regions of Afghanistan.\n\nAnd as we follow Shaheen, we follow the story of Afghanistan, a land divided by war that is still ruled by a sharp and archaic border between the equality of men and women, and is still as proud of its heritage as ever. It's a complex and thorny road that is full of uneasy questions and full of answers that might irk, but is wild and entertaining despite all that.\n\nIt's a rare pleasure to discover a film like THE PRINCE OF NOTHINGWOOD that not only serves as a brilliant character portrait but also introduces the audience so thoroughly to a region as complex as the problems it's mired in. THE PRINCE OF NOTHINGWOOD asks you to consider some difficult questions even as it entertains you. With a central cast of characters that are as unique as a unicorn, this is one hell of a ride which will leave you open to considering the Middle East through an entirely different light. (Evrim Ersoy)",
    "directors": [
        "Sonia Kronlund"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-prince-of-nothingwood"
    },
    "runtime": 85,
    "synopsis": "Meet Salim Shaheen: Afghani auteur, prolific actor and one-man moviemaking industry. Along with his trusted troupe of actors, he defies all the odds in the Middle East to fulfill his dreams of making movies.",
    "title": "The Prince of Nothingwood",
    "year": 2017
}