{
    "countries": [
        "Republic of Korea"
    ],
    "description": "Young pretty boy Jo Hyun-su catches the eye of veteran gangster Han Jae-ho during a slap fight at Gyeonggi Penitentiary, where both are guests of the state. Jo's boyish good looks give him a sense of naivete that he trades on and uses to quickly turn the tables on those who underestimate him. Han works for a fish importing business that's really a drug-smuggling front run by Chairman Ko. This is a huge thorn in the side of police chief Cheon, a tough-as-nails female cop who goes toe-to-toe with Ko. On the inside, Han takes control of the cigarette trade by force and lives like a prince behind bars. But when Kim Sung-han arrives, all hell breaks loose. Kim and the prison warden are old friends and suddenly Han's reign is over; there's a new sheriff in town. But Jo sticks by Han's side and even saves his life from a shiv attack by one of Kim's underlings. A friendship slowly begins to form between the two criminals. This friendship lasts beyond their years in prison but nothing is exactly what it seems in the brutal Korean underworld.\n\nWhile Byun Sung-hyun's sprawling epic crime saga liberally borrows from films like the INFERNAL AFFAIRS series, it still manages to put its own spin on familiar storylines. With slap fights as a central plot point, the film feels right at home at Fantastic Fest. The action is hard-hitting and relentless. The revenge is brutal and final. THE MERCILESS is shot with style and gusto. The film is edited in nonlinear chunks that jump back and forth through the timeline, which gives us glimpses of the character's true motivations. THE MERCILESS is a dynamic and kinetic rollercoaster ride through shaky alliances and double crosses where no one is safe. (Luke Mullen)",
    "directors": [
        "Byun Sung-hyun"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-merciless"
    },
    "runtime": 117,
    "synopsis": "Cribbing liberally from the history of gangster films, Byun Sung-hyun's hard-boiled Korean crime saga is filled with all manner of murder, deceit, double and triple crosses... and, oh yeah, slap-fighting.",
    "title": "The Merciless",
    "year": 2017
}