{
    "countries": [
        "Norway"
    ],
    "description": "Acclaimed director Joachim Trier has birthed upon the world several outstanding dramas. His feature OSLO, AUGUST 31ST was chosen for the Un Certain Regard program in Cannes. His 2015 follow-up LOUDER THAN BOMBS was selected for the Cannes main program. This year, Trier returns to the scene with another astonishing vision. THELMA is a science fiction-tinged romantic thriller that explores burgeoning love and the journey of self-discovery of a young woman in Norway.\n\nThelma has recently been accepted to attend university in Oslo and her new higher education is at odds with her parent's ultra-conservative religious beliefs and upbringing. They even comment to her at a particularly uncomfortable dinner how a little knowledge doesn't make her better than others. After being struck with a seizure in the school library, for which doctors have no clear explanation, Thelma begins to experience equally baffling, possibly supernatural events. Shortly thereafter, Thelma befriends a fellow student named Anja. Less emotionally bound than Thelma and beautiful in her own right, the women's connection unlocks a new romance growing inside of Thelma. As their relationship intensifies and Thelma's romantic feelings burst forth, the situation takes a dark and perplexing turn.\n\nThe film stars both Eili Harboe as Thelma, who you may recognize from the 2015 Fantastic Fest film THE WAVE, and Okay Kaya as Anja, a singer-songwriter turned actress. Harboe's doe-eyed innocence exudes a relatable and charismatic sense of wonder as she develops from her chaste existence while discovering the truth about her inner self.\n\nTrier masterfully captures the emotional tumult of a young woman in new surroundings with a fresh take on the world, whose blooming sense of self and burgeoning sexuality are punctuated by seemingly inexplicable phenomena. This atmospheric tale from Trier tingles with electricity, powerful sexy emotions, dark thrills and shocking moments. (Noah Lee)",
    "directors": [
        "Joachim Trier"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/thelma"
    },
    "runtime": 116,
    "synopsis": "A conservative young woman attending college in Oslo begins to fall in love while discovering her burgeoning supernatural powers in a stunning new film from Norway.",
    "title": "Thelma",
    "year": 2017
}