{
    "countries": [
        "United States"
    ],
    "description": "Cory Finley came in hot with his first film. With THOROUGHBREDS, the writer and director has delivered a stylish psychodrama about that most vexing of subjects: teenage girls.\n\nTHE WITCH's Anya Taylor-Joy and BATES MOTEL's Olivia Cooke are Lily and Amanda, two former friends who are thrown back together when Amanda's mother asks Lily to tutor her troubled daughter. There's a mysterious history between the girls, and in their teenage years they've grown apart: Lily into a posh, accomplished young woman and Amanda into a bit of a social outcast. But their new arrangement reveals that they have more in common than we might expect — neither of the girls is entirely what they seem.\n\nTaylor-Joy and Cooke are both remarkable in THOROUGHBREDS, and Lily and Amanda's profound strangeness — their cavalier approach to destruction, the deep secrets that they hide from everyone else they know — never precludes them from being very real friends to one another. Lily and Amanda's friendship might not look like any other friendship we've seen in life or on film, but it's genuine and exceptionally moving.\n\nFinley's direction is striking and deliberate. He frames the girls so carefully against each other and their beautifully decorated backdrops. This movie is designed within an inch of its life, with a piercing, tribal score that heightens an already heightened atmosphere. THOROUGHBREDS is brightly lit and colorfully hued, but the comedy is pitch black. As the narrative descends from peculiar character study to an outright horror show, we realize that THOROUGHBREDS has been lulling us into complacency with its gorgeous aesthetics and hypnotic performances. Before we've noticed what's happening, things have gotten very dark. (Meredith Borders)",
    "directors": [
        "Cory Finley"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/thoroughbreds"
    },
    "runtime": 92,
    "synopsis": "Two teenage girls in suburban Connecticut rekindle their unlikely friendship after years of growing apart. In the process, they learn that neither is what she seems to be, and that a murder might solve both of their problems.",
    "title": "Thoroughbreds",
    "year": 2017
}