{
    "countries": [
        "Germany"
    ],
    "description": "After failing her tryout for the police department, Maggie signs up to train as a security guard. An average polite young girl, Maggie comes off as the kid who got upset when others didn't color inside the lines. She was born to become part of the system. But when Maggie meets Tiger, everything changes. Tiger is everything Maggie isn't, a Bohemian ass-kicker who lives in a converted bus and plays by no rules but her own. Maggie is fascinated by Tiger and her worldview, as if it had never occurred to her that people could live that way. Becoming fast friends, Maggie and Tiger set off on a series of increasingly outlandish and ultimately dangerous pranks. What starts as some relatively harmless fun quickly escalates into arbitrary violence with an extra mean streak. As Maggie realizes that Tiger's anarchy has limits and its seeming randomness has a point, the girls find their friendship in jeopardy.\n\nDirector Jakob Lass has crafted a cool aggressive take on the anti-establishment youth-in-revolt film. Casting female leads (including Ella Rumpf from last year's RAW) turns this type of story on its head and adds an extra layer to the violent pranks on display. Scenes where the leads beat up punks in the subway and force a male mall patron to strip take on new meaning with young women in control. Rumpf and Maria-Victoria Dragus play off of each other beautifully sell the subtly shifting dynamic between them. Ultimately their friendship is what really matters, even as Maggie starts to lose sight of that fact with her constant need to go further and one-up Tiger and eventually herself.\n\nTIGER GIRL moves like a freight train with fast-paced editing and cinematography as well as a buzzing score that keeps things chugging along. There's never a dull moment here. (Luke Mullen)",
    "directors": [
        "Jakob Lass"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/tiger-girl"
    },
    "runtime": 90,
    "synopsis": "Failing to crack the ranks as a would-be cop, Maggie begrudgingly settles for a security guard job until she encounters Tiger, a fierce young woman whose rebellious antics leave Maggie questioning which side of the law she truly belongs on.",
    "title": "Tiger Girl",
    "year": 2017
}