{
    "countries": [
        "Mexico"
    ],
    "description": "When her mother suddenly disappears leaving no one to care for her, young Estrella ends up on the street and joins a gang of children, triggering a dangerous and tragic chain of events in the third feature from Mexican filmmaker Issa Lopez.\n\nMost films coming out of Mexico and featuring stories involving drug cartels usually take place in the world of adults. This is most likely because adults are more violent, and it's easier to set up a story in \"our\" world with lots of action and gunfights. Because let's face it, isn't that what we really want to see? Action and guns blazing? With one hero rising and standing in the way of the bad guys? In these types of films, rarely has a filmmaker reflected on the children that are left behind after their parents are murdered by cartels. They may not be the main targets and they're most certainly not the focus of those fighting on either side of a drug war. But these kids are victims of a world they didn't create and don't understand. They are left behind with little chance of survival and no one watching over them.\n\nIn TIGERS ARE NOT AFRAID, Issa Lopez tackles a subject of great significance, finally giving a voice to a whole generation of children who've been forgotten and abandoned by society. She manages to mix in fantastic elements with tremendous subtlety, thus elevating the story by giving it an even darker tone set alongside interesting whimsy.\n\nTIGERS ARE NOT AFRAID is a dark, stunning fairytale told from the magical point of view of incredibly brave and unusual children. These children are no longer \"out of sight, out of mind.\" Thanks to Lopez's remarkable work, audiences will walk out of the theater with a brand new perspective on a well-worn cinematic subgenre. (Annick Mahnert)",
    "directors": [
        "Issa López"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/tigers-are-not-afraid"
    },
    "runtime": 83,
    "synopsis": "When her mother suddenly disappears with no one to care for her, young Estrella ends up on the street and joins a gang of children, triggering a dangerous and tragic chain of events in the third feature from Mexican filmmaker Lopez.",
    "title": "Tigers Are Not Afraid",
    "year": 2017
}