{
    "countries": [
        "Australia"
    ],
    "description": "As any cult film and television fan will tell you, there is no more fertile ground for the strange and bizarre than Japan. This is, after all, the land that gave us HANZO THE RAZOR‚ a traveling samurai who solves crimes using his very large penis‚ and took director Takashi Miike from shooting darts out of women's vaginas to regular appearances in the Cannes Film Festival. Japan produces more than its share of the weird. Which may explain how it is that so many have overlooked the existence of early 1990s oddity TOP KNOT DETECTIVE.\n\nOn the Japanese airwaves for two seasons, TOP KNOT DETECTIVE was an early foray into television production from multi-faceted conglomerate Suttaffu — a company with its fingers in everything from housewares to pop singers — who handed control over to the show's creator and star Takashi Takamoto. And while the results on screen were frequently bizarre, they were nothing at all compared to the true life drama playing out behind the camera.\n\nKnown in the West thanks only to a brief release in Australia, the show itself and the behind the scenes story — an epic tale of debauchery and fragile egos — are now pulled into the light thanks to a riotous documentary from filmmakers Aaron McCann and Dominic Pearce, who walk us through the entire sordid tale with access not only to Western filmmakers influenced by the madness of the original series — keep an eye open for DANGER 5's Dario Russo in there — but also with extensive interviews with the original cast and crew, who give insight to the show and the increasingly self destructive behavior of creator Takamoto.\n\nThis is a hugely entertaining look at a completely neglected talent who deserves to find an audience around the world.\n\nIt's also complete and total bullshit. (Todd Brown)",
    "directors": [
        "Aaron McCann",
        "Dominic Pearce"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/top-knot-detective"
    },
    "runtime": 87,
    "synopsis": "Aliens! Ninjas! Robots! Enormous egos! Get ready to enter the world of TOP KNOT DETECTIVE! Possibly the greatest cult TV series you've never heard of, TOP KNOT DETECTIVE and its creator Takashi Takamoto come to life in this gonzo documentary.",
    "title": "Top Knot Detective",
    "year": 2016
}