{
    "countries": [
        "Iceland",
        "Denmark",
        "Poland",
        "Germany"
    ],
    "description": "Ah, neighbors. They can be dreams or they can be nightmares. Some neighborly disputes turn to profound hate and even push people to pack up and move away. Neighboring is an art that requires strong social skills, and too few have them. In UNDER THE TREE, Hafsteinn Gunnar Sigurðsson delivers a truly acid satire about neighbor relationships, full of extremely dark comedic moments, the kind of darkness for which only Nords have the recipe.\n\nSummer in Iceland doesn't last long, and when Atli's (Steinþór Hróar Steinþórsson) only sunny moments on the garden deck are cut short by the shadow cast by his neighbor's tree, he gets pissed. And when his seemingly nice neighbor keeps ignoring his request to trim said tree, he decides to take the matter into his own hands. Things quickly get out of control from there. Throw in some family issues, couple trouble, garden gnomes, disappearing pets and a chainsaw, and you get a savage, funny, dramatic and sad tale about four human beings who end up committing an unthinkable crime, all based on a misunderstanding.\n\nSure, UNDER THE TREE is pretty mean but it's also an accurate analysis of the (sad) society we live in, where people have lost the ability to care about others and have turned into selfish assholes. Sigurdsson has thrown together all his wickedly funny and painfully astute ingredients into a pressure cooker, and he's kept the heat on, and you know what happens when you just let the pressure build and build and build.... (Annick Mahnert)",
    "directors": [
        "Hafsteinn Gunnar Sigurðsson"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/under-the-tree"
    },
    "runtime": 89,
    "synopsis": "On the outskirts of Reykjavik, the shadow cast by a tree triggers a feud between two neighboring families, with tragic and darkly comic consequences.",
    "title": "Under the Tree",
    "year": 2017
}