{
    "countries": [
        "Japan"
    ],
    "description": "Most fans of THE ABCs OF DEATH 2's \"'Y' IS FOR YOUTH\" segment — which features a vacuum cleaner made of french fries sucking a woman's hair off and then turning into a giant penis before getting really weird — probably don't recognize the name of its director. Soichi Umezawa has been working in the business steadily since the '90s, mostly doing special makeup effects on TV shows and low-budget films like ALIEN VS. NINJA. Finally getting his chance to helm a feature, Umezawa delivers an effects-laden horror film that's even more outlandish than expected.\n\nAfter studying in Tokyo, Kaori returns to Aina Academy to finish her prep classes for art school. Her time away has made her a better artist than most of her classmates and she soon begins taking top scores on projects. Things begin to get strange when she finds some clay left behind by the building's previous owner and uses it for sculpting assignments. After a mishap with a razor blade and the disappearance of one of her most jealous classmates, her teacher and the other students of Aina Academy soon find themselves dealing with murderous, bloodthirsty clay.\n\nVAMPIRE CLAY is a brilliant calling card and a ceaselessly entertaining showcase from an artist who refuses to let any limitations prevent him from practicing his craft and showing his talents on screen. Umezawa's twisted imagination has a perfect home in clay, especially when it's finding ways to consume human bodies, allowing for gory and gooey effects aplenty. Set within the confines of a small artist studio, Umezawa focuses his energy on providing ever more wild and sometimes genuinely horrific creations.\n\nVAMPIRE CLAY is a swift and singular experience all the way through to the final images which are some of the most bizarre to ever grace a Fantastic Fest screen. (Brian Kelley)",
    "directors": [
        "Soichi Umezawa"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/vampire-clay"
    },
    "runtime": 80,
    "synopsis": "A class of art school hopefuls is stalked by blood-thirsty, flesh-hungry clay in this bizarre practical effects-heavy horror assault from THE ABCs OF DEATH 2 segment director and longtime special makeup effects artist Umezawa.",
    "title": "Vampire Clay",
    "year": 2017
}