{
    "countries": [
        "Republic of Korea"
    ],
    "description": "Park Hoon-jung, writer of the deliciously violent I SAW THE DEVIL, returns with his fourth directorial feature, a raucous political tête-à-tête wrapped inside a serial killer procedural. V.I.P. takes place in chapters, each one longer than the last, and each chronicling a different facet of East Asian geopolitics through familiar iconography: men on a mission to catch a murderer... only once he's been caught, the real mystery is who gets final jurisdiction over him and why.\n\nPark wraps his darkly violent psychological thriller within the political intrigue of bureaucratic agendas and media narratives, with key person of interest Kim Kwang-il (a silent and deadly Lee Jong-Suk) existing at the nexus of humanity and diplomacy. Hot on his trail for a multitude of political and personal reasons are Jang Dong-gun as an agent of the National Intelligence Service, fighting a battle for his very soul, Kim Myung-min and Park Hee-soon as driven police officers from the South and North willing to go beyond the call of duty, and even FARGO's Peter Stormare as a member of the CIA. Everyone wants Kim Kwang-il and he's right within their grasp, but this soft-spoken, hyper-intelligent political psychopath knows exactly how to play the game.\n\nV.I.P. may function as political allegory, but it isn't afraid to occasionally get as messy as its ultra-brutal Korean contemporaries in murder scenes sure to make even seasoned Fantastic Fest goers wince, with an unrelenting intensity and a penchant for direct political metaphors that pay off in supremely violent fashion. Blood splatter is a regular fixture of the set and makeup design, each spray and droplet telling its own story whether spread across the four walls of a village household, or trickling quietly down the cheek of a steadfast character trying desperately to avoid unraveling.\n\nThe political, the personal and the pragmatic all rub up against one another until they eventually blur together, as even the nature of what's \"right\" shifts as rapidly and amorphously as the global conflicts the film echoes; current political deadlocks wearing the mask of a jet-black Korean crime caper. (Siddhant Adlakha)",
    "directors": [
        "Hoon-jung Park"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/vip"
    },
    "runtime": 128,
    "synopsis": "A notorious serial killer who happens to be the son of a defecting DPRK official sends South Korea's National Intelligence, police from both states and even international brass into a mad political scramble in this thrilling neo-noir.",
    "title": "V.I.P.",
    "year": 2017
}