{
    "countries": [
        "United States"
    ],
    "description": "It's New Year's Eve in Atteridgeville and Lefa's life is on the cusp of major change. Accepted into university to study botany, he's about to leave his home in a ghetto township behind if only his deadbeat father will come through with his school fees. Though he may not need his father's help at all, not with his horticultural skills and the criminal mind of his albino would-be gangster best friend, Papi. No, the easy life is on the horizon if only they can find a way to navigate the very definitely NOT easy life lying much closer to them.\n\nFusing African oral storytelling traditions with a Tarantino-style multi-threaded crime story with nods to Kevin Smith and Richard Linklater in its approach to youth culture, Kagiso Lediga's WIZARD is a coming-of-age crime comedy unlike any you've ever seen. The South African comic has stepped into the feature world with a pair of directorial efforts in 2017 — his debut feature CATCHING FEELINGS premiered at the LA Film Festival earlier this year as well — and the results are remarkable.\n\nLediga's portrayal of South African culture is a world apart from what you may expect. It is somehow light hearted and loving without glossing over the harsher realities of township living. Lediga has an obvious gift for dialogue and tone, combined with a remarkable ability to shift tone while weaving American and African influences together into something thoroughly and entirely his own.\n\nLediga's greatest asset, however, isn't his familiarity with genre or snappy dialogue but his rich and engaging characters. For all the bursts of violence and outrageous comedy, the strength of WIZARD lies purely with its young leads — with Lefa caught between reaching for a better life and feeling guilty about leaving friends and family behind, with the doubly outcast Papi struggling to hide his true emotions behind a façade of bluster and bravado to spare his friend — his ONLY friend — the pain of having to say goodbye. (Todd Brown)",
    "directors": [
        "Kagiso Lediga"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/wizard"
    },
    "runtime": 79,
    "synopsis": "Young Lefa proves not to be such a terribly convincing criminal as he, and his best friend Papi, attempt to fund his university tuition by peddling weed in the South African townships.",
    "title": "Wizard",
    "year": 2017
}