{
    "countries": [
        "United States"
    ],
    "description": "Don Hertzfeldt is one of the most talented filmmakers working in animation today and his return to the world of Emily Prime is everything we could have ever hoped for: a brilliant, hilarious, heartbreaking journey into the future that is as complex as it is charming.\n\nWritten entirely around candid audio recordings of Hertzfeldt's five year old niece, WORLD OF TOMORROW EPISODE TWO: THE BURDEN OF OTHER PEOPLE'S THOUGHTS finds Emily Prime swept into the brain of an incomplete back-up clone of her future self who is on a mission to reboot her broken mind, and what follows is an adventure of the most unbelievable kind: kaleidoscopic imagery meld into mind-bending sequences. Without spoiling any details of the wonders that occur, it's safe to say that Hertzfeldt manages to merge all of this into a coherent and philosophically complex story: a story that speaks to the very nature of us and resonates on a level that's impossible to shake off.\n\nHertzfeldt's signature style and some brilliant use of music complete this amazing experience that proves indeed that brilliant, life-changing experiences do come in small packages.\n\nCoupled with Episode One of WORLD OF TOMORROW— in order to make sure everyone is up to speed on the journey of Emily Prime—as well as an extended Q & A with Don himself, the World Premiere of WORLD OF TOMORROW EPISODE TWO: THE BURDEN OF OTHER PEOPLE'S THOUGHTS promises to be one of the most special experiences you could hope for at Fantastic Fest. (Evrim Ersoy)\n\nPlease note: \n\nThere will be a 30 minute discussion with Don Hertzfeldt after the first screening only and we ask that you plan to sit through.\n\nDue to the short runtime, there will be no food and beverage service in the second screening. \n\nThank you",
    "directors": [
        "Don Hertzfeldt"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/world-of-tomorrow-episode-two-the-burden-of-other-peoples-thoughts"
    },
    "runtime": 40,
    "synopsis": "The highly anticipated follow-up to Don Hertzfeldt's Oscar-nominated WORLD OF TOMORROW finds Emily Prime swept into the brain of an incomplete backup clone of her future self, who's on a mission to reboot her broken mind. Continuing the tradition of the first film, WORLD OF TOMORROW EPISODE TWO was written entirely around candid audio recordings of Hertzfeldt's five-year-old niece.",
    "title": "World of Tomorrow Episode Two: The Burden of Other People's Thoughts",
    "year": 2017
}