{
    "synopsis": "A student rents a room from a family in their converted army bunker, and ends up the tutor to the child and a virtual slave to the parents.",
    "description": "It seems a simple enough goal for any student: Find a quiet place to live and work, an oasis to center your mind and go about your business. And that's all the eponymous Student (Pit Bukowski) at the center of  Nikias Chryssos' debut feature wants. Just a quiet place. A safe place. Preferably a boring place. And he thinks he's found it when he comes across a room for rent with a family living in a converted military bunker. With Mother, Father and young Klaus, all will surely be well. But things are not quite what the Student expects when he arrives.\n\nIn retrospect, the fact that the family lives in a bunker should have tipped the Student off that things weren't quite normal. But while he was willing to overlook that, he couldn't possibly overlook meeting young Klaus... who looks closer to thirty than his supposed eight years of age, despite his youthful attire and homespun haircut. Did the ad mention that the Student would now be expected to take over tutoring duties of the homeschooled \"youngster\"? An education the Student is encouraged to beat into young Klaus with the cane hanging on the wall? An education prescribed to prepare young Klaus for a future as the President of the United States by Heinrich, who's the alien creature living within the swollen leg of Mother?\n\nAfter a string of acclaimed short films, Chryssos has cooked up a supremely odd feature debut with DER BUNKER, a picture that The Hollywood Reporter happily proclaimed \"the best German-language movie featuring a talking leg, ever\" after its Berlin premiere. Flawlessly composed and deeply committed to its own sense of oddity, DER BUNKER is a striking and promising debut from a unique young talent. (Todd Brown)",
    "title": "Der Bunker",
    "runtime": 85,
    "directors": [
        "Nikias Chryssos"
    ],
    "year": 2015,
    "countries": [
        "Germany"
    ]
}