{
    "year": 2015,
    "description": "German directors Jorg Buttgereit, Michal Kosakowski and Andreas Marschall have birthed this trio of ruminations on sex, fantasy and rage. Buttgereit, who found cult success with his 1987 film NEKROMANTIK, kicks things off with the first segment, FINAL GIRL. Leaning heavily on extreme closeups, Buttgereit paints a portrait of a lonely young girl going about her morning chores, particularly caring for her guinea pigs, while narrating her inner monologue for the audience. But a lone guinea pig is kept in another room, separate from the others, for some reason...\n\nKosakowski is responsible for the middle section, entitled MAKE A WISH. A young deaf-mute couple are enjoying a lazy day together exploring a rundown neighborhood. They enter an abandoned building where boy tells the girl the bloody but magical history of one of his family heirlooms. His story is interrupted when they're discovered by a group of four angry extremists looking to pick a fight. The couple is helpless to fight back with their own strength, but the boy's heirloom may hold the power to change things.\n\nMarschall wraps things up with the final story, ALRAUNE. It takes its title from a novel based on the German folktale of a young girl born with no ability to feel love but is nonetheless obsessed with sex. Marschall's film tells the story of a fashion photographer who finds himself searching chat rooms and the internet for women after a fight with his girlfriend. On a whim, he invites a chat partner to meet in real life. His night takes a turn when he mistakes a different girl for the one he was talking to and follows her to a mysterious club. What takes place behind the club door will haunt him long after he leaves.\n\nUnsurprisingly given the filmmakers involved, German Angst pulls no punches. It kicks off with plenty of blood and shock and never lets up. While the first two segments are particularly brutal, it's possibly the psychological horrors of the third segment that are the most terrifying and affecting. Beautifully filmed with impressive effects, the dark and gritty GERMAN ANGST truly gets under your skin. (Luke Mullen)",
    "directors": [
        "Jörg Buttgereit",
        "Michal Kosakowski",
        "Andreas Marschall"
    ],
    "countries": [
        "Germany"
    ],
    "synopsis": "German directors Buttgereit, Kosakowski and Marschall unleash this brutal assault on the senses, a surreal three-part horror anthology touching on love and hate and everything in between.",
    "runtime": 111,
    "title": "German Angst"
}