{
    "synopsis": "Frederic Tellier's tight police procedural recreates the events around the decade-long search and trial of \"The Beast of the Bastille,\" France's first serial killer, who was tracked down using DNA evidence.",
    "description": "In the 1990s, Guy Georges killed seven young women in different cities during one of France's more notorious crime waves. Frederic Teller's debut recreates the complex events that led to the arrest while also jumping ahead ten year to the trial. At first, rookie detective Frank Magne is given his first assignment, to reread unsolved cases to see if anything was missed. In this case, something was: two murder victims had the same person install a utility. For the next decade, Frank becomes obsessed with finding the killer and fighting corruption inherent in the police bureaucracy, especially after Georges was questioned and released several times over the eight year investigation.\n\nIt's easy to see SK1 as the \"French Zodiac,\" but Teller goes for a clinical and nearly emotionless docudrama while Fincher dealt with the frustration his main characters encountered while wrestling with the unknown. Teller's approach is to allow the audience to witness events with nearly no manipulation. One understands how far we've come with murder investigations. In the past, crimes scenes were contaminated, footprints were stepped on, and different departments withheld information so they could break the case. The Beast of the Bastille case was the investigation that changed everything in France. After it was over, DNA databases were created that helped solves thousands of cases. SK1, or Serial Killer 1, was the first.\n\nL'AFFAIRE SK1 starts with a James Jones quote: \"This force of evil... Where does it come from?\" The film itself never really tries to answer this question. Instead, Teller builds with almost no commentary, just recreation that allows the events to speak for themselves. Ultimately, it deals with the force of humanity and the events that elevate us all into a greater society in the face of evil forces. (James Shapiro)",
    "title": "L'affaire Sk1",
    "runtime": 120,
    "directors": [
        "Frédéric Tellier"
    ],
    "year": 2014,
    "countries": [
        "France"
    ]
}