{
    "year": 2015,
    "description": "We've all seen love stories with zombies. We've all seen them with superheros. We've all seen them with time travel. Now Finland gives us one with all of the above, plus some aliens and giant pet pandas thrown in for good measure.\n\nMilla is a simple girl living in a very complicated world. Her parents have a drinking problem which regularly turns them into zombies. Her best friend is a superhero named Super-Gitta. Her friends are trying to set her up with a dashing young man who sells trips to the future via his company's commercial black holes. Then there's her live-in, diner-owner boyfriend, Aimo, who constantly feels inadequate.\n\nWhen his gym-going fails to produce results as quickly as he'd like, Aimo takes the easy way out. He splurges on a set of Exo-Arms Mark 106's, making him more powerful than he could have ever imagined. However, his rash decision causes his relationship with Milla to crumble, and his solution to this problem only makes things worse.\n\nBased on a popular TV teen dramedy in Finland, LOVEMILLA places some of the most mundane of life's problems in a world full of anything but. Borrowing ideas from science fiction, fantasy and a little bit of horror, its magic lies in its absolute refusal to explain - or even acknowledge - the universe its characters live in. Men wear breastfeeding appliances, people break out into song, aliens beam down from outer space, and life just goes on as normal.\n\nLOVEMILLA is a mashup of all the kinds of movies we know and love at Fantastic Fest. From giant pandas to time travel to completely unexpected musical numbers, it would be safe to say LOVEMILLA has it all. It does this without ever forgoing its sense of heart, so by the end of LOVEMILLA… you will. (Brian Kelley)",
    "directors": [
        "Teemu Nikki"
    ],
    "countries": [
        "Finland"
    ],
    "synopsis": "LOVEMILLA is a delightful peek at life and love in Finland, filled with all the usual zombies, black holes, giant pandas and superheros you'd expect from the land that gave us Renny Harlin.",
    "runtime": 97,
    "title": "Lovemilla"
}