{
    "year": 2015,
    "description": "From killer hair extensions to murderous pet store owners to hip-hop gang war musical epics, Shion Sono has become a Fantastic Fest staple, always delivering something fresh and exciting, but always distinctly Sono. This year, he returns with a film that feels more personal than ever, one that could almost be called a family film but that never lacks his bizarre touch.\n\nRyoichi is a timid businessman with not-so-modest dreams. Having long ago abandoned his hopes of becoming a punk rock superstar, he works at a musical parts company and pines for Yuko. As with his his other aspirations, his bashful nature prevents him from making a move.\n\nForming an immediate bond with a turtle for sale, Ryoichi brings the animal home, names it Picadon and finds a burst of confidence while performing for his new pal. In the midst of planning out his rise to musical stardom, Ryoichi is forced to flush his beloved friend down the toilet. As Picadon finds a new, magical home in a sewer of misfit toys, Ryoihi's dreams finally begin to come true after he writes a loving tribute to his flushed friend.\n\nSono is no stranger to outcast characters and their longings, nor has he ever been shy about shoving his protagonists into the face of current and pressing issues in Japan. Set amid the fervor surrounding Tokyo's successful bid for the 2020 Olympic Games (and particularly the costly stadium there that has been described as looking like a turtle), Sono's main character in LOVE & PEACE is a microcosm of Japan. Ryoichi is in danger of losing sight of what brought him what he thinks he always wanted, and he may not have ever considered the true price tag.\n\nFeaturing the catchiest tune you're likely to hear at Fantastic Fest this year, LOVE & PEACE is a heartwarming and soul-enriching work from one of the best; a film that will make you believe deeply in both of its titular sentiments. (Brian Kelley)",
    "directors": [
        "Sion Sono"
    ],
    "countries": [
        "Japan"
    ],
    "synopsis": "Fantastic Fest staple Shion Sono returns once again with a deeply personal (and expectedly odd) film about a lonely businessman with dreams of punk rock stardom and his best friend, a turtle.",
    "runtime": 117,
    "title": "Love And Peace"
}