{
    "synopsis": "There has never been and will never be another film like THE MAN WHO SAVES THE WORLD, and your only chance to discover why is at this special Fantastic Fest screening!",
    "description": "The '70s were an amazing time in Turkey. The cinema industry was turning out films at an unbelievable rate in order to keep up with demand. From dramas to action films to comic book movies, each film was uniquely tinted with the sensibilities of the country.\n\nHowever, even amidst all the titles that came before and after it, THE MAN WHO SAVES THE WORLD holds a special place. It's the pinnacle of the blending of art and craft: part homage, part liberal borrowing, and a whole lot of heart.\n\nDirector Çetin İnanç's attempt to create the ultimate Turkish science fiction epic has all the trademarks of the genre: a mash-up of American cinema tradition and Turkish mythology bound together by the insane desire to reach infinitely beyond its microscopic budget. Two pilots who find their ships mysteriously crashing on an alien planet end up fighting an evil dictatorial emperor plotting to destroy Earth. But no summary can do this wild mix justice. From its z-grade, beautiful inhabitants to the endless borrowed shots literally spliced in from the actual STAR WARS, this is lo-fi filmmaking at an unparalleled best.\n\nThe cast is led by the ubiquitous godfather of Turkish cinema, Cüneyt Arkın, the dashing lead of the period who specialized in genre films and had a penchant for crazy stunts. When you see him jumping all across the landscape, defying gravity, your heart will lift with joy.\n\nAdd to this a killer soundtrack (featuring music pulled directly from a spectrum of popular films including JAMES BOND, INDIANA JONES and, again, STAR WARS) and explosions galore and what you have is a cinematic experience unlike any other.\n\nNOTE: Due to the nature of the film, we have sourced the best available format to screen. Keeping in mind that film archiving was a term unknown in Turkey in the '70s, this is as good as it's ever going to get.\n\nSo sit back, relax and let the Turks take you on a journey to a universe far, far away, completely familiar and yet utterly different. (Evrim Ersoy)",
    "title": "The Man Who Saves the World",
    "runtime": 91,
    "directors": [
        "Çetin İnanç"
    ],
    "year": 1982,
    "countries": [
        "Turkey"
    ]
}