{
    "synopsis": "A roadhouse hostess goes undercover to investigate the murder of her sister in a little-seen sexploiter from grindhouse rebel and master of erotica Joe Sarno.",
    "description": "He directed one of the first X-rated movies released in America, INGA. And he hid behind a bewildering number of aliases when he moved into explicit hardcore pornography to make ends meet in the DEEP THROAT-tastic 1970s. But it was during the swinging sixties that Joseph W. Sarno became a grind-household name due to such sexploitation classics as THE SWAP AND HOW THEY MAKE IT, COME RIDE THE WILD PINK HORSE, SCARF OF MIST THIGH OF SATIN and ALL THE SINS OF SODOM.\n\nA trailblazer in the fertile field of golden era softcore sinema, Sarno became one of the most prolific and distinctive pioneers to emerge from the 42nd Street scene alongside \"King Leer\" Russ Meyer and \"adult auteur\" Radley Metzger. Sarno made his mark on the sexploitation genre because of his instantly recognisable style, both economic and highly artistic, and interest in the moral and psychological dimensions of his colourful characters in the lurid melodramas he made cerebral, gorgeous to look at and, of course, \"stimulating\" to watch.\n\nMY BODY HUNGERS was written and directed by Sarno between his Peyton Place rip-offs PASSION IN HOT HOLLOWS and DESIRE UNDER THE PALMS, and starred many from his regular rep company – Gretchen Rudolph, Patricia McNair, John Aristides, Tammy Latour – in a hot-blooded crime mystery thriller. Hitching to New England to reconnect with her estranged older sister Janet at the roadhouse she works in, Marcia (NAKED FOG star Rudolph) learns her sister has been murdered; strangled to death with a black lace garter belt, no less. Investigating the circumstances around the killing, Marcia uncovers a seamy catalogue of sordid scandals in high places that puts her life in peril too. Featured in the book The Act of Seeing by Nicolas Winding Refn and Alan Jones, published by FAB Press. (Alan Jones)",
    "title": "My Body Hungers",
    "runtime": 80,
    "directors": [
        "Joseph W. Sarno"
    ],
    "year": 1967,
    "countries": [
        "United States"
    ]
}