{
    "year": 2014,
    "description": "Stanley has been alone with his ghosts for as long as he can remember, living an isolated life in his slowly crumbling family home in the Welsh hills. For years, it's been only Stanley and his memories, eking out a quiet existence, until the day a distant horn leads him to a young couple on the run, their car sinking slowly into the passing river. With no other options and nobody else to help, Stanley does the only thing he can: He takes the couple home to nurse them back to health. And it turns out that Stanley's ghosts may not be only his own.\n\nThe creative team behind acclaimed BBC crime series HINTERLAND delivers a something unique with THE PASSING. The first ever Welsh language genre film, THE PASSING is a classy, artfully executed supernatural drama. Director Gareth Bryn draws stellar performances from his entire cast as he builds a subtle, nuanced tale of isolation and loss. The Welsh countryside provides a striking backdrop, the environment proving every bit as significant a character as any of the three principal actors while Bryn handles the entire affair with a confident hand that marks him as a talent to watch.\n\nWith the bulk of Welsh talent confined to the television world – particularly when it comes to those working in the Welsh language – with minimal crossover to film, Bryn has quite a lot to prove here. And with such a polished and accomplished first effort, it would appear that not only should we be looking out for whatever comes next for Bryn himself, but also try to develop an ear for the Welsh language. Because this feels a lot less like a one-off than the leading edge of many more to come. (Todd Brown)",
    "directors": [
        "Gareth Bryn"
    ],
    "countries": [
        "United Kingdom"
    ],
    "synopsis": "After their car is driven off the road and crashed into a river, a young couple on the run is taken in by a simple man living with his secrets in his isolated home.",
    "runtime": 87,
    "title": "The Passing"
}