{
    "year": 2015,
    "description": "Making movies is a collaborative process where — with a little luck — creatives share a single vision. When it works, it's not unlike threading a needle. Robert Eggers' THE WITCH is such a precise vision that it's nearly equivalent to threading a hundred needles by throwing the thread through the needles' eyes from five feet away.\n\nTHE WITCH isn't just the best horror film of 2015; it could very well be the best film of 2015. Eggers and his team were dedicated to bringing historical accuracy to every aspect of the feature: the dialogue, costumes, props and the remarkable sets, and more. The entire production design — the film's reported budget is shockingly only one million dollars — perfectly transports the audience to one of the creepiest time periods in American history.\n\nSeventeenth century colonial New England actively believed in the supernatural. Both God and the Devil were real to almost everyone, and citizens could find evidence of both everywhere. Laypeople frequently resorted to superstitious rituals to save them from hunger and poverty. The leadership (conservative Puritan but secular men) were focused on maintaining authority and power, and had a very strict sense of justice. These specific ethics allowed lies, deceit, and jealousy to fester and permeate all aspects of society. Hope was reserved for only a select elite. This was a world without any shades of grey. It's a glorious environment to make a horror film.\n\nEggers takes what he and his creative team built and fills it with superstition, paranoia and dread. As food runs out, the family unravels and the ultimate horror waiting in woods does just enough to give the family an opportunity to destroy themselves. This is the kind of filmmaking that deserves celebration.\n\nAnd, I almost forgot. There are really creepy twins who play with a goat named Black Phillip. (James Shapiro)",
    "directors": [
        "Robert Eggers"
    ],
    "countries": [
        "United States"
    ],
    "synopsis": "Sixty years before the Salem witch trials, a Puritan moves his family away from civilization to a homestead which shares its borders with inescapable evil.",
    "runtime": 90,
    "title": "The Witch"
}