{
    "year": 2015,
    "description": "David has recently become single. The rules of The City dictate that he must be taken to The Hotel, where he will have 45 days to find a matching mate. If he does, he can go back to his life. If he fails, he'll be transformed into an animal of his choice and sent into The Woods. However, there's a splinter group of renegade Loners living within The Woods who oppose this system violently. With a ticking 45 day clock, David will struggle to survive and maybe just maybe find his true love.\n\nYorgos Lanthimos continues the singular vision he presented in his previous films DOGTOOTH, ATTENBERG and ALPS with a dystopian science fiction tale that's as funny as it is twisted, dark and insightful. A brilliantly deadpan exercise, THE LOBSTER is surreal wonder at its best.\n\nWorking in English language exclusively for the first time, Lanthimos utilizes an all-star cast, led by Colin Farrell as the downtrodden David. John C. Reilly, Ben Whishaw, Olivia Colman and Lea Seydoux all appear in the film, but we also see the director's usual Greek cast members, including Angeliki Papoulia stealing every scene she's in as \"The Heartless Woman.\"\n\nWhat could easily be a one-dimensional farce is played out as a much more intricate and emotionally insightful black comedy, with laughs milked out of some very dark moments. Lanthimos' deliberate use of classical music to underline these moments works beautifully, and the film's lone musical number features Olivia Colman performing an unexpected pop song in brilliant fashion.\n\nDestined to become one of the top titles of 2015, THE LOBSTER is visceral cinema brought to life. It's a journey into a twisted mirror image of our own world where the reflections reveal much more about ourselves than perhaps we want to know. (Evrim Ersoy)",
    "directors": [
        "Yorgos Lanthimos"
    ],
    "countries": [
        "Netherlands"
    ],
    "synopsis": "Somewhere in the near future, single people face a choice: Join a program to find a mate in 45 days or be transformed into an animal.",
    "runtime": 119,
    "title": "The Lobster"
}