{
    "year": 2015,
    "description": "God exists. He lives in Brussels. These two lines set the stage perfectly for Jaco Van Dormael's latest film. There's more, of course. God lives in an apartment with no entry or exit and spends most of his time in a giant office where he controls the world through a computer terminal that looks like it still runs Windows 98. He lives with his wife and daughter and is a raging jerk to both of them. His son, whom you may have heard of, made his escape through the washing machine long ago. Finally his daughter, Ea, gets fed up with his shit. With some encouragement from her brother, JC, she decides to leave the nest, find her own apostles and write her own brand new testament. But before she makes her escape, she steals the key to the office and texts the answer to an all-important question to everyone on Earth. Her attempted good deed backfires and God must scramble to fix it before humanity finds it has no need of Him.\n\nTHE BRAND NEW TESTAMENT is a wildly innovative and incredibly funny film. The premise alone is gold, but the little details sprinkled throughout really make the story shine. The cast is perfect, from Pili Groyne as Ea to the great Catherine Deneuve as one of the new apostles. Finally there's God himself, played by the amazing Benoit Poelvoorde, who Fantastic Fiends will recognize immediately as the voice of Steven from A TOWN CALLED PANIC. Ms. Deneuve in particular goes for broke, not just playing along but giving it her all, even when the film gives her an unusual new partner. This is bold, brash, blasphemous filmmaking on a grand scale. THE BRAND NEW TESTAMENT will delight and challenge you and have you laughing the whole way. (Luke Mullen)",
    "directors": [
        "Jaco Van Dormael"
    ],
    "countries": [
        "Luxembourg"
    ],
    "synopsis": "When Ea gets fed up with her overbearing father (who happens to be God), she decides to follow in her older brother's footsteps by leaving the house, gathering her own apostles, and writing her own testament.",
    "runtime": 110,
    "title": "The Brand New Testament"
}