{
    "year": 2015,
    "description": "Private detective Sampson needs to find a missing stripper by the name of Dorothy. Throughout his journey into the underbelly of L.A., he will encounter past loves, depressed housewives, angry mothers and retired dancers. With each encounter, he'll discover connections never imagined possible, all reinforcing that it may be \"too late.\"\n\nDennis Hauck's directorial debut is a technical marvel, a feature film shot on 35mm that tells its story in five uninterrupted takes. Hauck uses one reel for each sequence, resorting to no trick shots or edits, and then shows the reels in a non-sequential order to create a story that switches between the past, the present and the future while still making sense. It's a brilliant device that captures the imagination from the first scene and does not let go until the credits roll.\n\nThe cast is led by John Hawkes as the disheveled but eternally cool Sampson who's not only searching for the missing girl but also for repentance for his sins. He's a character haunted by his own past, and as the picture moves along, his motivation becomes crystal clear. Veteran actors including Robert Forster and Jeff Fahey complete a strong cast which ground the noir dialogue in reality.\n\nThe real star of the film has to be the city in which it is set. Although L.A. has been home to countless noir films, TOO LATE feels like a fresh take on the genre. Whether bathed in glorious bright midday sunlight or lurking in the shadows of a seedy bar, the Los Angeles on screen is a varied beast. Instead of iconic spots in the heart of the city, these locations are on the peripheral borders. The hills, the disused lots and the small clubs on the outskirts all feel like \"genuine article\" Los Angeles.\n\nTOO LATE is a brilliant and assured debut that will mesmerize all those who encounter it; a siren with a neo-noir heart bound to be remembered amongst the best of the genre. (Evrim Ersoy)",
    "directors": [
        "Dennis Hauck"
    ],
    "countries": [
        "United States"
    ],
    "synopsis": "A troubled private eye trawls through the belly of Los Angeles looking for a missing young woman, slowly revealing a careful web of intrigue, lies and unexpected connections.",
    "runtime": 107,
    "title": "Too Late"
}