{
    "countries": [
        "United States"
    ],
    "description": "Jesse Walsh (Mark Patton) and his family are new on Elm Street, taking up residence in the former home of Nancy Thompson. He is having trouble with the adjustment, waking up screaming and sweating from terrifying dreams featuring a killer with a dirty striped sweater and a glove with knives. Jesse makes friends with a neighborhood girl named Lisa (Kim Myers), with whom he discovers Nancy's diary and learns about her nightmares, and with Ron (Robert Rusler) a fellow troublemaker at school. As Jesse navigates teenhood, new relationships, and new feelings, his nightmares grow more intense as Freddy Krueger threatens to tear him apart from the inside.\n\nReleased just a year after the first film, A NIGHTMARE ON ELM STREET 2: FREDDY'S REVENGE took audiences by surprise, changing up the formula set by the first and sneaking into mainstream cinemas one of the most interesting pieces of queer horror. Despite great effects by Kevin Yagher including some seriously brutal transformations, a masterful parent-in-denial performance by the brilliant Clu Gulager, and a Freddy Krueger still more concerned with being evil than with telling dad jokes, it has been the now-so-obvious signs of Jesse's real inner turmoil that have painted conversations since. A truly talented and equally handsome up-and-comer, Patton plays it straight (as it were); despite some of the more over-the-top homoeroticism around him, his anguish is palpable no matter how you choose to read it.\n\nViewed now through thirty-years-thick lenses, we can appreciate and celebrate NOES2 for what it is and have it both ways. It stands as an audacious sequel, throwing away any notion of convention and setting out to be something completely different from its predecessor. It is also a fascinating bit of gaysploitation, taking a monster that feeds on fear and engorging him with an entire nation's terror around AIDS and homosexuality. Either way, it's horror — queer as hell — that speaks a bit more directly to that scream queen inside. (BRIAN KELLEY)\n\nWith Actors Mark Patton, Kim Myers, and Robert Rusler in Attendance for 1st half.",
    "directors": [
        "Jack Sholder"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/a-nightmare-on-elm-street-2-freddys-revenge"
    },
    "runtime": 87,
    "synopsis": "Jesse (Mark Patton) is the new kid on Elm Street and Freddy Krueger might not be the only monster in the closet in this much discussed but under-appreciated queer horror classic.",
    "title": "A Nightmare On Elm Street 2: Freddy's Revenge in 35MM",
    "year": 1985
}