{
    "countries": [
        "Algeria",
        "France",
        "Qatar"
    ],
    "description": "In 1994, Algeria was three years into a destructive civil war in which multiple Islamic factions rose up against their government after it actively blocked an Islamic party from ruling the country. As the war raged on, some of the factions became excessively violent — killing women and children, and turning on fellow Muslims deemed less loyal to the cause — throwing the country into a state of fear and mistrust.\n\nAmidst this turmoil, childhood friends S. and Lotfi journey into the desert to find a terrorist named Abou Leila, whom S. believes is responsible for a series of mysterious deaths across the region. Lotfi wants to help S. with his plan, but S. has a problem: he falls into hallucinogenic fugues, forgets the passage of time, and has traumatic dreams that leave him screaming. If what he sees can't be trusted, perhaps their whole journey is in vain.\n\nBeyond its historical relevance, ABOU LEILA is also a touching story about the enduring power of friendship, and a critical exploration of masculinity. The lead characters were raised from a young age to be not only comfortable with the sight of blood, but willing and ready to shed it at any time. In this war-torn country, men like Lotfi and S. had to choose whether to be predator or prey.\n\nFeaturing astounding lead performances and haunting imagery, ABOU LEILA eventually becomes a more complex, shocking, and universal film than it originally lets on. Ultimately, the film serves as a pointed allegory for the inherent hypocrisy of war, begging the question: what do you do when the enemy you're fighting looks and thinks just like you? (LOGAN TAYLOR)",
    "directors": [
        "Amin Sidi-Boumédiène"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/abou-leila"
    },
    "runtime": 139,
    "synopsis": "In the midst of the Algerian Civil War, Lotfi ventures into the desert with his lifelong friend S., who hopes to find and kill the elusive, dangerous terrorist Abou Leila.",
    "title": "Abou Leila",
    "year": 2019
}