{
    "countries": [
        "France",
        "Belgium"
    ],
    "description": "FF alumnus Fabrice du Welz (CALVAIRE; VINYAN) returns to Austin with probably his most personal film to date, a deeply moving tale about two children falling in love, going against conventions and the adult world. Paul's mother works as a nurse in a mental institution, and together they live on the grounds. The instructions are very clear: he's not allowed to engage with patients. But when Gloria is admitted, he's immediately attracted to her and breaks the rules by instigating conversation. What starts as a friendship quickly turns into fascination and obsession: Paul will protect Gloria, come what may.\n\nIn any other director's hands, this story could have turned into something perverse and uneasy, but du Welz infuses so much fragility, innocence, and humanity into his characters that the viewer also succumbs to adoration of these children and understand Paul's commitment to Gloria. Brilliantly played by Fantine Harduin, Gloria shows such an extraordinary range of emotions that you just want to hug her and tell her everything is going to be alright. Meanwhile, Thomas Gioria's interpretation of Paul is so moving that you will never question for a minute the decisions he makes, despite going against common sense. Fabrice du Welz is a master in depicting relationships on screen. From his early work to ALLELUIA and MESSAGE FROM THE KING, his characters are center stage, driving the story and never just the means to an end. Du Welz cares deeply for them, and every single one seems to have a special significance to him.\n\nBeautifully shot on Super-16mm by Manuel Dacosse, with whom du Welz worked on ALLELUIA, the Belgian director's latest opus will move you to tears with the authenticity of his characters and their unconditional love. In a world governed by rules and conventions, we all could certainly use a little bit of adoration in our lives. (ANNICK MAHNERT)",
    "directors": [
        "Fabrice du Welz"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/adoration"
    },
    "runtime": 98,
    "synopsis": "Paul lives with his mother on the grounds of a mental institution and has little contact with the outside world. When Gloria's admitted, he's immediately fascinated by her and events take an unexpected turn.",
    "title": "Adoration",
    "year": 2019
}