{
    "countries": [
        "United States"
    ],
    "description": "Hank is a good ol' boy, a small town kid; a little rough around the edges, sure, but with a good heart. His time is mostly spent managing a local bar, hunting, and fixing up his huge familial home that's constantly in disrepair. The best thing he ever did was fall in love with Abby, the girl of his dreams. But Abby was never really a small town girl, and after ten years together with no children and no ring, Abby takes off, leaving Hank and her cat behind. Hank is beside himself, and, unable to cope with the loss, he spirals into a cycle of drinking and depression.\n\nWhile he's clearly not in a good place, it's the monster that shows up every night that really starts to drive him crazy. Abby's brother Shane tries to help, telling him that it must be a bear or something logical. But Hank knows the woods around his house, knows the animals that live there, and — after eventually catching a glimpse of the creature — knows what he saw. It's no animal; it's something otherworldly. Unable to convince Shane or even his hunting buddy Wade, Hank sleeps on a couch facing the front door with a 12-gauge, waiting for the monster he knows will return.\n\nJeremy Gardner (THE BATTERY) co-directs with his long-time cinematographer Christian Stella, and the results are phenomenal: a beautiful, lyrical love story that swells with an emotional gut punch. The sentiments are real and raw and relatable, anchored by Gardner and co-star Brea Grant who seem to have an effortless chemistry that instantly rings true. Their moments together are funny and sweet and poignant, accentuated by later conversations that reveal the heartbreak just below the surface. Produced by Fantastic Fest alums David Lawson, Aaron Moorhead, and Justin Benson (and starring Benson as Shane), AFTER MIDNIGHT is a film about discovering what you want out of life, and finding the courage to face your monsters — both real and imagined — to get it. (LUKE MULLEN)\n\nWith Directors Jeremy Gardner & Christian Stella in Attendance for 1st half.",
    "directors": [
        "Jeremy Gardner",
        "Christian Stella"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/after-midnight"
    },
    "runtime": 83,
    "synopsis": "When Hank's longtime girlfriend Abby leaves him, he spirals into a cycle of drinking and depression. But it's the monster that shows up every night that's really driving him crazy.",
    "title": "After Midnight",
    "year": 2019
}