{
    "countries": [
        "Spain"
    ],
    "description": "I guess there are basically two types of friendships. The first is the one where you're acquainted but don't really know who the other person is. Then there's the other type, the friend you share real experiences with: life events, laughs, tears, and the legitimate dramas. David is the second type, a real amigo. He's responsible for Javi's state, having been at the wheel of the car that almost killed him. Is it guilt that pushes David to care for his friend, or is it a genuine act of camaraderie? Little by little, Javi gets on David's nerves, pushing his buttons (and a bell). The slowly building tension is like steam forming in a pressure cooker, but how long does it take for the cooker to crack?\n\nOscar Martin explores the human soul in such an interesting and original way that you can only be amazed by the authenticity of the relationship — because most of us have been there and, to a certain extent, experienced that kind of cannibalistic friendship. It doesn't usually end well. Fun fact: during production, the team jokingly referred to the film as \"THE INTOUCHABLES but with sons of bitches.\" This should give you an idea of the tone.\n\nThe film, jointly written by real-life friends Oscar Martin, David Pareja, and Javier Botet (who has been referred to as \"real fuel for nightmares\" by another FF programmer), was shot in only one week. When you think of it, it's absolutely incredible that it took Martin so long to finally direct his first feature after such an extensive career in the audiovisual field working on commercials, shorts, and music videos. No one will deny that all those years certainly taught him everything he needed to know to tackle his first film, but damn do I wish he would have started earlier as I truly consider him as one of the most interesting new voices to come out of Spain. Mark my words, it won't be long until the Powers That Be of the film industry get a hold of him. (ANNICK MAHNERT)\n\nWith Director Óscar MartÍn in Attendance for 1st half.",
    "directors": [
        "Óscar Martín"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/amigo"
    },
    "runtime": 83,
    "synopsis": "After a serious car accident (for which he's responsible), David decides to care for his best friend Javi at a remote house. It doesn't take long until the animosity insidiously builds between them.",
    "title": "Amigo",
    "year": 2019
}