{
    "countries": [
        "United States"
    ],
    "description": "Dezzy's having a rough week. Her last commission check is two weeks late, her rent is overdue, her boyfriend is a drag, her agent is dropping her, and — oh yeah — the gallery owner who commissioned her latest work wants it now or not at all. All of that would actually be fine if she could just figure out what the fuck her latest painting is, and get it out of her head and onto the canvas. Facing a total lack of inspiration and a potentially premature end to a promising career, she turns to her sometime dealer who hooks her up with an especially potent mix of cocaine and DMT. On the drug, Dezzy spirals completely out of control, partying hard until she blacks out. But it does the trick, and while she can't really remember doing it, she somehow managed to produce some of her best work. Unfortunately, it also triggers a blood-lust within Dezzy, and she has to go hard again and again if she wants to finish what could be her masterpiece.\n\nFantastic Fest alum Joe Begos is back with another insane, carnage-filled slice of mayhem for us to feast upon. He's teamed up with his usual crew of reprobates including cinematographer Mike Testin, editor and multi-hyphenate Josh Ethier, as well as actors Graham Skipper, Matt Mercer, Jeremy Gardner, and many more to create this beautiful hellscape. Filmed on glorious 16mm film, BLISS looks incredible — kinetic and alive and absolutely dripping in sleaze and neon. It's almost like the very personification of sex, drugs, and rock'n'roll coming alive in front of your eyes. Anchored by Dora Madison's dizzying lead performance, this is a blood-soaked punch-to-the-gut midnighter that will leave you screaming for more. (LUKE MULLEN)\n\nWith Director Joe Begos and Editor Josh Ethier in Attendance.",
    "directors": [
        "Joe Begos"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/bliss"
    },
    "runtime": 80,
    "synopsis": "While trying to complete her latest painting, a starving artist facing a lack of inspiration spirals out of control in a blaze of blood-soaked, drug-fueled glory.",
    "title": "Bliss in 35MM",
    "year": 2019
}