{
    "countries": [
        "United States"
    ],
    "description": "See three cute little rascals on a murderous rampage!\n\nIn June 1970, in the sleepy town of Meadowvale, California, three babies are born during a solar eclipse. This may not seem like a big deal. But when Saturn is blocked by both the sun and the moon, a funny thing happens: babies are born without a conscience! Fast forward to June of 1980 and the town is plagued with murders. Nobody seems to be safe; not horny teenagers, dads, law enforcement, teachers, or even children. The townspeople are terrified and the cops aren't making any progress on unveiling the identity of the killer, even as the audience knows that three adorable tots are responsible for the slayings!\n\nThese kids may look sweet and innocent, but don't be fooled. They're as brutal, heartless, and weird as any serial killer. Little Debbie calls the shots and is the most manipulative of the bunch. She charges 25 cents to the boys in the neighborhood to watch through a peephole as her sister Beverly (Julie Brown!) dances in her bedroom. Bespectacled Curtis cruises the neighborhood at night with a giant revolver looking for someone to shoot — teenagers making out in van, children playing wiffle ball, high schoolers studying, etc. And Steven? Well, he beats the hell out of the local sheriff with a baseball bat.\n\nSee a teenage couple get murdered in an open grave! See a car driven by two kids: one working the gas pedal and the other at the wheel, while wearing Jason Voorhees' hood from FRIDAY THE 13TH PART 2! See a lady get shot in the eye with a bow and arrow! See all this and more in the brand new restoration of BLOODY BIRTHDAY! (SEBASTIAN DEL CASTILLO)",
    "directors": [
        "Ed Hunt"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/bloody-birthday-presented-by-agfa-and-arrow-films"
    },
    "runtime": 85,
    "synopsis": "The classic Killer Kids slasher, newly restored by Arrow Films and presented by AGFA.",
    "title": "Bloody Birthday - Presented by Agfa and Arrow Films",
    "year": 1981
}