{
    "countries": [
        "France",
        "United States"
    ],
    "description": "Making a splash on the Internet in 2016, Seth Ickerman (the alias for the talented French duo of Raphaël Hernandez and Savitri Joly-Gonfard) created a music video for the mysterious synthwave artist Carpenter Brut titled \"Turbo Killer.\" Featuring a retro-futuristic, cyberpunk phantasm of frenzied car chases, crucifix spaceships, stunning cultist women, mysterious gas-masked henchmen, and intense pumping music — influenced by soundtracks of both films and video games of the 1980s — this FX-driven rager garnered over 7,000,000 views on Youtube, and left everyone wondering just what the heck happened to their brains and eyeballs… and just what was coming next.\n\nBLOOD MACHINES is here to answer the question. Continuing where \"Turbo Killer\" leaves off, Seth Ickerman pulls out all the stops in their insanely creative and visionary work to expand upon their previous galaxy building. Here, you will meet two space hunters who are on their way to track down the Mima, a renegade ship piloted by an AI which is trying to free itself, when they encounter a ghost in the machine, literally. A beautiful, nude woman with a glowing crucifix on her chest emerges from the disabled ship, as if the machine itself has a soul. Now these hunters must come to terms with this newly presented mystical quandary about the possible life of these mechanical beings.\n\nWhat sets BLOOD MACHINES and its creative team apart is their stylistic singular vision, seemingly influenced by the music of John Carpenter and Justice, as well as heavy metal, comic books METAL HURLANT, the spaceship artwork of Chris Foss, B-movies from the '80s, and neon lights — all mashed together in a heavenly cocktail of technofuturistic tastiness. There is nothing like BLOOD MACHINES, and Fantastic Fest is proud to present a bombastic screening alongside the music video \"Turbo Killer.\" Hop in your Lamborghini, put on your glowing crucifix, slick back your hair and crank up the synthwave tunes because it's going to be one audacious ride! (NOAH LEE)\n\nWith Director Seth Ickerman in Attendance for 1st half.",
    "directors": [
        "Seth Ickerman"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/blood-machines"
    },
    "runtime": 50,
    "synopsis": "The wild sequel to the Carpenter Brut music video, \"Turbo Killer,\" shoots you into a turbulent psychedelic adventure of galactic hunters tracking down the soul of a spaceship set to a killer synthwave soundtrack.",
    "title": "Blood Machines",
    "year": 2019
}