{
    "countries": [
        "United States"
    ],
    "description": "What makes Fantastic Fest unique? Among many other things, we have the world premiere of BUTT BOY, about a guy named Chip who becomes addicted to putting anything and everything up his butt. It's a movie that screams \"Fantastic Fest!\"… but it's also kind of brilliant. Yes, it's a very, very, VERY silly, one joke movie, but it's also told as straight as possible while being presented almost as a David Fincher homage. Seriously.\n\nThe most remarkable aspect of BUTT BOY is how it maintains its serious tone the whole movie, and it works. It opens with a frustratingly \"here we go again\" premise about a middle-class guy with a boring job, a boring marriage, and a life he's sleepwalking through… until his first prostate exam jolts him wide awake. When Chip becomes addicted to putting things in his tuchus, it leads to all kinds of problems and then even crime. Suddenly, BUTT BOY is a pulpy crime thriller about a cat-and-mouse chase between the grizzled and stereotypically hard-edged detective and Chip. And we haven't even gotten to the big twist in the film, which has to be seen to be believed. Again, all this is funny, but the movie is told completely straight. It's almost a miracle it manages to maintain its tone and its joke, and make it compelling throughout its running time. It's a tribute to writer/director Tyler Cornack and his writing partner Ryan Koch that their storytelling elevates this film above its premise.\n\nThis is an idea born out of sketch comedy that will find a cult audience on streaming in the near future, but don't miss the chance to watch the best butt movie of the year with a roomful of other eager viewers and a pitcher of beer. Just secure all loose objects. (JAMES EMANUEL SHAPIRO)\n\nWith Director Tyler Cornack in Attendance for 1st half.",
    "directors": [
        "Tyler Cornack"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/butt-boy"
    },
    "runtime": 100,
    "synopsis": "Writer/director/comedian Tyler Cornack's BUTT BOY introduces us to Chip, a middle-aged man whose first prostate exam stirs feelings deep inside leading to an addiction that can only be shown to Fantastic Fest audiences.",
    "title": "Butt Boy",
    "year": 2019
}