{
    "countries": [
        "United States"
    ],
    "description": "After averaging two films a year, OKC auteur filmmaker Mickey Reece somehow eluded our attention until 2018, when his STRIKE, DEAR MISTRESS, AND CURE HIS HEART landed in our laps, causing quite a stir with Fantastic Fest programmers and the FF audience.\n\nCLIMATE OF THE HUNTER, according to Reece's local online newspaper THE OKLAHOMAN, is best described as \"a visual interpretation of The Jesus and Mary Chain's 1985 debut album, PSYCHOCANDY.\" Two sisters, Alma and Elizabeth, along with a dog who's described as a \"philosopher,\" have come to Alma's remote house to reconnect with Wesley after twenty years. Alma is recently divorced, Elizabeth is a workaholic in Washington, D.C., while Wesley lives in Paris dealing with a wife recently struck with a fatal disease. When the three come together for dinner it has all the makings of a lovely adult melodrama about loneliness, and the desire to connect and share our lives with someone… but we must add to the mix one otherworldly piece of information: Wesley could be a vampire.\n\nThis is Reece in a nutshell. His narratives and characters are equal parts classical, adult, and complicated; his set-ups best described as pure humanism; and then Reece attaches a quality that tilts the whole film wonderfully off its axis. Not to mention his dialogue, which extends beautifully from lines like, \"I learn to trust my intuitions and my prejudices\" to \"Just typical of him thinking about pussy in his twilight years.\" If Alfred Hitchcock made his movies in Oklahoma City with no budget and only local actors and artists, I'd like to think they would closely resemble this. (JAMES EMANUEL SHAPIRO)\n\nWith Director Mickey Reece in Attendance.",
    "directors": [
        "Mickey Reece"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/climate-of-the-hunter"
    },
    "runtime": 90,
    "synopsis": "The \"Soderbergh of the Sticks,\" Mickey Reece, returns to Fantastic Fest with his 27th feature. Two beautiful sisters vie for the affections of a man who may or may not be a vampire.",
    "title": "Climate of the Hunter",
    "year": 2019
}