{
    "countries": [
        "United States"
    ],
    "description": "When Ward Phillips is sent to survey the county land and water outside Arkham, he stumbles on Lavinia Gardner and her family. She lives on an old farm with her parents, brother, and an assortment of horses, dogs, alpacas, and other animals. The only other person who lives nearby is Ezra, a quirky off-the-grid hippie stuck in time. When a meteorite lands on the Gardners' front lawn, no one can make heads or tails of it. A thunderstorm hits the next night and the lightning seems drawn to the meteorite, striking it over and over. Meanwhile, Ward discovers strange anomalies in the water supply. While the meteorite itself shrinks until it completely disappears, the fallout is just starting, and it will infect every living thing on the Gardners' land. Nothing and no one is safe.\n\nThe combination of H.P. Lovecraft, Richard Stanley, and Nicolas Cage is a match made in genre film heaven; all three are all-star Hall of Famers in their own right. Stanley hews pretty closely to the essential elements of Lovecraft's story, while simultaneously modernizing and putting his own distinct twists on it. The film is beautifully shot and spectacularly complemented by the special effects, and when the shit really starts to hit the fan, the sound design combines to create a truly otherworldly and unsettling experience. COLOR OUT OF SPACE is enthralling: a strange, psychedelic canvas of grotesque terrors and alien enigmas sure to put a smile on your face. Strange days, indeed. (LUKE MULLEN)\n\nWith Director Richard Stanley in Attendance for 1st half.",
    "directors": [
        "Richard Stanley"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/color-out-of-space"
    },
    "runtime": 111,
    "synopsis": "Unimaginable terrors befall the Gardner family after a meteorite lands on their front lawn in Richard Stanley's entrancing, horrific adaptation of H.P. Lovecraft's short story.",
    "title": "Color Out of Space",
    "year": 2019
}