{
    "countries": [
        "New Zealand",
        "Canada",
        "Ireland"
    ],
    "description": "Ant Timpson's directorial debut feels like a film that's been long in the making. During all those years of working within genre film as a producer and curator, he must have been incubating this incisive blend of daddy issues, senseless violence, and gross-out humor.\n\nElijah Wood is Norval, a hipster 30-year-old fraught with nerves and already full of issues when we meet him trying to navigate some very specific instructions in a remote part of Oregon. It seems that Norval and his father Brian have long been estranged, and Norval has received an unexpected invitation begging him to come visit. The stage seems set for a beautiful family reunion, until Norval actually meets Brian, a drunk, rude man who was most certainly not expecting his son to turn up on his doorstep.\n\nFull of kinetic energy, stylish visual touches, and a sense of character, COME TO DADDY is also astounding in the assurance with which it explores the heart of its story without ever letting up on the tension. Sure, there are further plot developments that take the story in unimaginable directions, but not for one second does Norval ever feel anything other than real and very, very human.\n\nWorking with an incredible cast, perhaps Ant Timpson's greatest achievement is getting to the pathos at the heart of this outlandish tale: the grief of losing a parent, whether physical or metaphorical, without ever having the chance to face them. COME TO DADDY is a film that signals a real voice arriving within the genre space. Fully-formed, confident, and incredibly funny, audiences will respond to its charm in the only way possible, by surrendering fully. (EVRIM ERSOY)\n\nWith Director Ant Timpson in Attendance for 1st half.",
    "directors": [
        "Ant Timpson"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/come-to-daddy"
    },
    "runtime": 94,
    "synopsis": "When 30-year-old Norval receives a letter from his estranged dad begging him to visit, he is set on a weird path of discovery, unusual encounters… and a lot of violence.",
    "title": "Come To Daddy",
    "year": 2019
}