{
    "countries": [
        "Greece"
    ],
    "description": "Anna lives an ordinary life. She works as a cashier at a local supermarket, sleeps alone in a noisy apartment complex, and drifts through her daily routine. The one thing that makes her feel alive is Cosmic Candy, a potent version of Pop Rocks that sends its user into a dreamlike, hallucinogenic state.\n\nOne day, Anna's neighbor goes missing, and his daughter shows up outside her door, anxiously hoping for companionship and care. In different circumstances, Anna may have ignored this cry for help, but on the cusp of losing her job, she accepts a chance for change.\n\nFirst time director Rinio Dragasaki shows a remarkable grasp of her characters and their environment, utilizing a vibrant pastel color palette and impeccably detailed production design to show Anna's hopeful perspective of the world around her. Dragasaki crafts surreal atmospheres that alternate gracefully between a somber reality and a mind-bending space of childlike imagination.\n\nWith refreshingly endearing lead performances and a bubbly, hypnotic score, COSMIC CANDY is the kind of charming comedy that will leave audiences optimistic and hopeful. It's also a tale of female friendship and maternal bonding featuring a very catchy song about French toast.\n\nA sweet comedy elevated by fantastical bursts of color and sound, COSMIC CANDY is an exciting debut film out of Greece that illustrates how in any circumstance, there's a chance to find beauty in the world if you're willing to change your outlook (and maybe pop some sugary confections while you're at it). (LOGAN TAYLOR)\n\nWith Director Rinio Dragasaki in Attendance.",
    "directors": [
        "Rinio Dragasaki"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/cosmic-candy"
    },
    "runtime": 95,
    "synopsis": "Anna, an eccentric supermarket cashier with an obsessive taste for a trippy treat called Cosmic Candy, undergoes a quirky transformation when forced to care for a ten-year-old neighbor girl.",
    "title": "Cosmic Candy",
    "year": 2019
}