{
    "countries": [
        "Finland",
        "Latvia"
    ],
    "description": "Don't let the catchy title fool you; DOGS DON'T WEAR PANTS isn't about whether canines may or may not wear clothes to cover their bottoms. If that's the movie you're looking for, you're at the wrong festival. No, this third film from Finnish filmmaker Jukka-Pekka Valkeapää (THE VISITOR; THEY HAVE ESCAPED) is impressionistic, complex, brilliant, and one of the major discoveries at this year's Cannes Film Festival.\n\nDOGS DON'T WEAR PANTS is initially about the pain of true loss. Pekka Strang (from Dome Karukoski's terrific TOM OF FINLAND) is heartbroken surgeon Juha, who mends the hearts of others on the operating table. Ten years after the drowning death of his wife — which may or may not have been accidental — Juha is barely living, and sleepwalking through raising his fiercely independent daughter. On her birthday, Juha agrees to take her to a tattoo shop to have her tongue pierced. Wandering downstairs, he finds a bizarre statue (is it a statue?) and is then tackled by a dominatrix who pins him to the ground, choking him with her foot.\n\nWhat happens next is best left to discover on your own, but this movie will make you feel every emotion possible. Valkeapää announces himself not just as an expert in staging, lighting, and photography, but as a filmmaker skilled at surprising an audience in the best way possible. Combined with two acting performances (Strang and his co-lead Krista Kosonen) that transcend excellence, DOGS DON'T WEAR PANTS is not just a highlight of this Fantastic Fest, but a highlight of what you'll see all year. (JAMES EMANUEL SHAPIRO)",
    "directors": [
        "Jukka-Pekka Valkeapää"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/dogs-dont-wear-pants"
    },
    "runtime": 105,
    "synopsis": "A heartbroken heart surgeon is introduced to the dark and extreme when his daughter gets her tongue pierced, sending him down a path of pain, dreams, life, love, death, and awakenings.",
    "title": "Dogs Don't Wear Pants",
    "year": 2019
}