{
    "countries": [
        "United States"
    ],
    "description": "Brad Anderson's tense, taut, and incredibly tight thriller is an impressive turn for Sam Worthington. Genre specialist Alan B. McElroy crafts a screenplay that uses an impressive array of tricks and turns to deliver a finely-tuned cinematic expression of terror.\n\nWorthington stars as Ray, buckling under the pressure of his responsibilities as a father and husband. When a routine stop to refuel their car ends with an accident that breaks his daughter's arm, Ray and his wife Joanne rush her to the nearest hospital. After the exhausted Ray falls asleep in the waiting room, he wakes to a world of nightmare and uncertainty: His family has gone missing. In fact, according to the hospital, they never came in. Taken to his absolute limit, Ray will go to any extreme to discover what has happened to his beloved wife and daughter. But there's more to the story than he suspects, and the truth will not be pleasant.\n\nChanneling a similar vibe to the wonderful BREAKDOWN, Anderson's FRACTURED differs in its focus on developing the characters: Worthington's Ray is an everyman whose motives are explored throughout the film, and it's the believability of his actions that have the audience so closely relating to him. Without ever losing sight of the end goal, this incredible thriller ratchets up the suspense in a series of set pieces that will keep you guessing at what the truth may be.\n\nSharp as a razor and relentlessly harrowing, FRACTURED is an example of what can be achieved when a filmmaker mines the personal to explore the repercussions of an individual's actions on the world around them, and leaves the audience with some pointed questions to explore long after the screen has faded to black. (EVRIM ERSOY)\n\nWith Director Brad Anderson and Actor Lily Rabe in Attendance for 1st half.",
    "directors": [
        "Brad Anderson"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/fractured"
    },
    "runtime": 100,
    "synopsis": "An unfortunate accident at a truck stop means Ray has to rush his daughter to the nearest hospital for a broken arm, but when his family disappears, he soon finds himself in a frantic fight to discover what happened.",
    "title": "Fractured",
    "year": 2019
}