{
    "countries": [
        "Canada"
    ],
    "description": "In a therapy workshop for those with facial differences, there is an imposter. Whereas all the other members in the group — including its body-conscious and confidence-lacking leader — must return to a world that rejects them for lack of beauty, Augustine hides a secret. Under his bandages, he is really Stan. His face no longer distorted, he's an attractive and imaginative teenager who plays D&D, picks up girls at bars, and lately has the difficult task of taking care of his cancer-stricken mother. Stan's visits to the group are his way of learning to cope with the disease that is physically destroying a once-beautiful woman, and with his overwhelming guilt in being unable to face her. When the members of the group find out about Stan's deception, he strikes a deal to stay while helping them weaponize their differences against a world that's hostile towards them.\n\nHAPPY FACE is director Alexandre Franchi's deeply personal sophomore feature. After 2009's surprising and clever LARPing thriller debut THE WILD HUNT, Franchi had his own complicated battle with bone cancer that took a portion of his leg. Wanting to make a film based on the loss of his mother to a cancer that increasingly rendered her physically different, he also drew on the stories of his cast, all with real facial differences, to shape HAPPY FACE's final narrative.\n\nThe result is a wondrously emotional and often very funny experience, a delicate balance of exasperation and anger at a beauty-obsessed world, and a startlingly tender expression of empathy. HAPPY FACE celebrates its unique cast, but more importantly, allows them to inhabit fully-realized characters with relatable flaws, insecurities, hopes, and dreams that often have nothing to do with the way they look. Fans of singular, all-inclusive, and challenging films with a healthy dose of dark humor should not skip out on HAPPY FACE. (BRIAN KELLEY)\n\nWith Director Alexandre Franchi and Actor E. R. Ruiz in Attendance for 1st half.",
    "directors": [
        "Alexandre Franchi"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/happy-face"
    },
    "runtime": 97,
    "synopsis": "An attractive teenager infiltrates a support group for those with facial differences in hopes of learning how to connect with his cancer-stricken mother in Alexandre Franchi's (THE WILD HUNT) deeply personal, often hilarious, and powerfully inclusive sophomore feature.",
    "title": "Happy Face",
    "year": 2018
}