{
    "countries": [
        "Canada"
    ],
    "description": "Two women find themselves in all the same places: the same yoga class, the same coffee shop...what are the odds! But when the intense, extroverted Linda (Precious Chong) coerces the reserved, deferential Michelle (Alex Essoe) into visiting her home for a spontaneous interior design consultation, it quickly becomes clear that Linda has something more sinister on her mind than throw pillows.\n\nEveryone knows if a gun appears in the first act, it must go off by the finale. Yet despite the fact that the first thing Michelle notices upon entering Linda's home is a large sledgehammer hung as décor on the wall, she presses on — as if compelled by an outside force whispering in her ear, \"Be polite! Don't make a fuss!\" After reluctantly drinking a cocktail prepared by Linda (garnished with a cheeky stirrer declaring \"Liquid Therapy!\"), Michelle soon realizes that society's conditioning to be a \"good girl\" is now being weaponized against her. Linda has been let down by a lifetime of fairytale expectations, and she's not letting Michelle leave until she's evened the score.\n\nThe film is propelled along by an incredibly smart and acerbic screenplay crafted by Essoe and Chong, along with director Zach Gayne. The three have created their own microcosm, equal parts absurdity and horror, where a vintage video board game called Party Hunks can lead to emotional disclosure and physical distress, and all the jokes land as forcefully as the inevitable violence. Essoe and Chong give their all in this film, pushing themselves to the absolute limit in an epic battle that engages all the tools, both psychological and physical, at their disposal. As the saying goes, when women fight each other, no one wins…except for the audience in this delightfully deranged film. (LISA DREYER)",
    "directors": [
        "Zach Gayne"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/homewrecker"
    },
    "runtime": 86,
    "synopsis": "Societal expectations create a pressure cooker in HOMEWRECKER, a darkly hilarious satire that plays like the best bonkers thriller Lifetime wishes they made.",
    "title": "Homewrecker",
    "year": 2019
}