{
    "countries": [
        "Canada"
    ],
    "description": "Vincenzo Natali takes on double duty by adapting this wonderful take on the novella IN THE TALL GRASS by Stephen King and Joe Hill, entering the pantheon of directors who manage to really capture the spirit of King on the big screen.\n\nLaysla De Oliveira and Avery Whitted star as Becky and Cal, two siblings en route to California who stop by a large grass field in Kansas when the heavily pregnant Becky feels nauseous. Hearing a young boy calling for help somewhere nearby, the two venture in and discover that the grass holds more secrets than they could have ever imagined...and they may never find their way out again.\n\nImbuing a field of grass with a sense of horror and utter helplessness is the kind of achievement only a seasoned writing duo like King and Hill can achieve, but to successfully transplant those feelings into the medium of cinema is the kind of masterwork we've grown to expect from a mastermind like Natali. Recalling his earlier works like CUBE, Natali once again shows that less is more, trapping his characters in a spiral of terror using nothing more than a sense of helplessness and the suggestion that something might be stirring close by.\n\nAs Becky and Cal encounter a series of characters and fumble towards an understanding of the mysteries of the grass, time and space seemingly warp, disorienting the characters and terrifying the audience. With incredible sound design and a roving camera seemingly everywhere at once, the film looks at what happens when human beings find themselves at the mercy of nature.\n\nAs a Stephen King fan, it's been an absolute joy seeing the wonderfully successful adaptations of the last few years, and IN THE TALL GRASS is no exception. Scary, succinct, and utterly mesmerizing, this is one tall tale you'll be keen to revisit as soon as the credits roll. (EVRIM ERSOY)\n\nWith Director Vincenzo Natali and Actors Laysla De Oliveira, Harrison Gilbertson, Rachel Wilson, and Will Buie Jr. in Attendance for 1st half.",
    "directors": [
        "Vincenzo Natali"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/in-the-tall-grass"
    },
    "runtime": 90,
    "synopsis": "Adapted from the eponymous novella by Stephen King and Joe Hill, IN THE TALL GRASS follows siblings Cal and Becky who find themselves trapped within a vast field of tall grass when they venture in to answer the cries of a young boy.",
    "title": "In the Tall Grass",
    "year": 2019
}