{
    "countries": [
        "India"
    ],
    "description": "Deep in the forests that dominate the South Indian state of Kerala, life rolls along at the same pace that it has for decades. However, in this rural town, the monotony is about to be shattered by the act of one stubborn buffalo who's not prepared to meet his maker. When this magnificent beast escapes the chopping block, it sends an entire region into panic as they scramble to subdue him before he destroys everything they've built.\n\nAs the buffalo careens through town, leveling whoever and whatever he pleases, the men of this village struggle to devise a plan of attack, hamstrung by long-held political and personal allegiances, leading to a chaos far beyond what anyone could have predicted. The result is utter anarchy, a tremendous cavalcade of failed masculinity and ancient communal bonds gone to shit, all in the service of harnessing a part of nature that man was never meant to tame.\n\nIndian director Lijo Jose Pellissery has spent a decade honing his craft, largely anonymous to audiences outside of his home state. But with JALLIKATTU, the world is now watching, and they're about to get one hell of a show. A filmmaker with an uncanny grasp of the cinematic medium, there are few in the world who can match his vision and ability to control and convey the feeling of helplessness that comes with the compounding chaos created by the hubris of man. In JALLIKATTU, he displays an impeccable grasp of the seemingly uncontrollable, creating massive scenes of perceived disorder and choreographing them with the skill of a master.\n\nDeftly transitioning between an artistic expression of the visual and aural rhythms of village life and the testosterone-driven madness of the hunt, JALLIKATTU begs the question: Where the hell did this guy come from and why am I just now hearing about him? A masterclass in orchestrating a kind of action you've never seen before, Pellissery's direction is a jaw-dropping example of a world-class talent hiding in plain sight. Oh, and watch out for that ending, it's a goddamned doozy. (JOSH HURTADO)",
    "directors": [
        "Lijo Jose Pellissery"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/jallikattu"
    },
    "runtime": 91,
    "synopsis": "The line between man and beast dissolves when a buffalo escapes slaughter in a sleepy South Indian village, leaving a trail of chaos and explosive machismo in its wake. It's a landlocked JAWS, a bestial 2001, and a contemporary MAD MAX: FURY ROAD all rolled into one.",
    "title": "Jallikattu",
    "year": 2019
}