{
    "countries": [
        "United States"
    ],
    "description": "It is simply impossible to think about Taika Waititi without recognizing that his heart is so big it could likely power at least a dozen humans. Throughout his films — from EAGLE VS SHARK to BOY to WHAT WE DO IN THE SHADOWS to HUNT FOR THE WILDERPEOPLE and even to a Marvel property like THOR: RAGNAROK — it is apparent that his affection for his stories and his characters has no boundaries. That affection is also insanely infectious, as we also come to love these stories, the worlds he builds, and the people who fill them. His optimism and sense of wonder give us a ray of hope when we desperately need it.\n\nHope in the darkest time is a nice segue into talking about his latest film: a WWII/Holocaust satire. The Third Reich and comedy are two things that have rarely gone together in entertainment. Chaplin's THE GREAT DICTATOR is a classic because he was willing to juxtapose war and humor to advocate that the US join the effort to stop German fascism and its relocation and murder of Europe's Jews. Mel Brooks' THE PRODUCERS is a perfect comedy in every way, but Brooks was less concerned with making a political statement than making a cinematic one: comedy should be limitless.\n\nConsidering the importance of the historical precedents and the endearing heart of Waititi's films, it's no surprise that JOJO RABBIT is an instant and important classic. It's brilliant and hilarious, with an incredible amount of benevolence at its center. He's not pulling his punches — the humor in JOJO shows the darkest aspects of humanity, but that darkness is needed in this film. The heart, compassion, and charity that fill all of Taika's films serve as the ultimate counterpoint to that darkness. And friends, fear not: JOJO RABBIT has both a wealth of heart and a great deal of laughs. It's a special film from a special filmmaker and it exemplifies all the things that make us want to share movies with the Fantastic Fest audience. (JAMES EMANUEL SHAPIRO)\n\nWith Director Taika Waititi in Attendance.",
    "directors": [
        "Taika Waititi"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/jojo-rabbit"
    },
    "runtime": 108,
    "synopsis": "Writer-director Taika Waititi (THOR: RAGNAROK, HUNT FOR THE WILDERPEOPLE), brings his signature style of humor and pathos to his latest film, JOJO RABBIT, a World War II satire that follows a lonely German boy (Roman Griffin Davis as JoJo) whose world view is turned upside down when he discovers his single mother (Scarlett Johansson) is hiding a young Jewish girl (Thomasin McKenzie) in their attic. Aided only by his idiotic imaginary friend, Adolf Hitler (Taika Waititi), Jojo must confront his blind nationalism.",
    "title": "Jojo Rabbit",
    "year": 2019
}