{
    "countries": [
        "Portugal"
    ],
    "description": "Silvia and Clara have been secret lovers for years. Silvia lives a comfortable life and has yet to find the strength to tell her husband about Clara. Now, Silvia is pregnant with their first child. Clara, realizing she'll never be the most important person in Silvia's life, has reached a point of frustration and hopelessness. The two women set up a clandestine meeting in the countryside to repair their relationship.\n\nThe couple spend much of their time lounging around the luxurious pool on the property, though they often find themselves distracted by strange noises coming from the pump. These noises fluctuate and grow, and sometimes sound strangely like voices. Eventually, these sounds start penetrating their sleeping minds, and the boundaries between illusion and reality begin to crumble.\n\nOn its surface, KEEP ME COMPANY is a thoughtful, well-acted character study about the complexities of relationships. But as each evening brings an increasing level of surreality, an intricate maze of dream logic takes over.\n\nGonçalo Almeida's film resourcefully uses simple yet striking visuals, powerful symbolism, and an impressively rich soundscape to create his mind-bending fever dream. So often, his aesthetic choices veer into womb-like territory that is somehow simultaneously comforting and unsettling, particularly given the thematic importance of pregnancy and water as a form of baptismal cleansing within the story.\n\nKEEP ME COMPANY is a psychologically fascinating film exploring the breakdown of a relationship and questions of fate. Are we really in control of our own emotions and bonds, or are we at the mercy of forces greater than ourselves? (LOGAN TAYLOR)\n\nWith Director Gonçalo Almeida in Attendance for 2nd half.",
    "directors": [
        "Gonçalo Almeida"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/keep-me-company"
    },
    "runtime": 82,
    "synopsis": "Two lovers meet in a secluded country home to try to heal their relationship without distraction, but the property's pool has other mysterious intentions.",
    "title": "Keep Me Company",
    "year": 2019
}