{
    "countries": [
        "United States"
    ],
    "description": "KNIVES AND SKIN takes place in a tiny rural midwest town like many a high school film before it, but the happenings in this particular locale are far from conventional. The film follows a group of teenage girls grappling with the disappearance of one of their own: pretty blonde marching band captain Carolyn Harper. The girls feel lost, maybe afraid that if someone hurt Carolyn, they could be next. Or maybe they're just lost because they're teenage girls, a challenge even without the added mystery.\n\nLike many high school movies, there are different cliques represented: fashionable rebels, sexually confused cheerleaders, horny jocks, wholesome brainiacs, and all the rest. Yet Jennifer Reeder's film transcends the cliché divides of high school life. The feelings she explores are deeply human and are often made clearest in song form. At key moments in the film, the characters break out into melancholic interpretations of '80s New Wave hits — sometimes in realistic situations like a choir class, and sometimes in fourth-wall-breaking musical moments. In every case, it's a moving and original technique that gets to the heart of these characters.\n\nThe script features a peculiar and consistent kind of detached dialogue. People don't speak authentically, but they do speak honestly, as if all the veneer of propriety, subtlety, sarcasm, and passive-aggression has been stripped from their lexicon in the face of this tragedy. Such bald honesty has various effects on the townsfolk, allowing some to explore their sexuality more freely, and causing others to destroy their families and homes.\n\nMuch like David Lynch before her (whose work is a clear and constant reference point for the film), Reeder digs deep beneath the suburban surface to find the ugliness underneath. Featuring a Badalamenti-esque score, neon-soaked production design, and gorgeous bucolic scenery, it's a fully absorbing, surreal world.\n\nKNIVES AND SKIN is the kind of film that only gets better with repeat viewings. It's also the kind of film that works best when you let it wash over you in all its strangeness and ambiguity. It doesn't have to tie up every loose end to be powerfully moving, deeply affecting, and gorgeously magical. (LOGAN TAYLOR)\n\nWith Director Jennifer Reeder in Attendance for 1st half.",
    "directors": [
        "Jennifer Reeder"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/knives-and-skin"
    },
    "runtime": 109,
    "synopsis": "The disappearance of popular teenager Carolyn Harper has a profound ripple effect across her small midwest town in Jennifer Reeder's hypnotic musical mystery.",
    "title": "Knives and Skin",
    "year": 2019
}