{
    "countries": [
        "Sweden",
        "Denmark"
    ],
    "description": "Tobias and Elin have been married for many years. When we first meet them, they are playful and in love. Then, a painful tragedy tears their relationship apart. In an attempt to reconnect and heal their wounds, they decide to take a camping trip. Unfortunately, a band of mischievous characters descends upon their campsite, submerging the couple in a stream of traumatic experiences as they try to escape.\n\nThis may sound like your typical survival-in-the-woods narrative, but KOKO-DI KOKO-DA has many surprises in store. For one, the villains are no back-country cannibals — they're characters from a child's music box come to life. An old man in a white suit, straw hat, and cane leads the group. His followers include a giant woman in pigtails walking a vicious pit bull, a hulking strongman carrying a second, dead pit bull, and an ominous white cat in a bow tie. Their shocking appearance is nothing compared to the surreal forms of torture they inflict on this poor couple.\n\nJust as upsetting are the lengths to which the couple must go to survive and escape. Told in a seemingly endless loop that brings us back to the moment chaos begins, Johannes Nyholm creates an evil form of GROUNDHOG DAY. As frustrating as this seems, there's a tenderness underpinning the whole endeavor, made clearest in a series of poignant animations of a family of bunnies. Nyholm has previously created many similar animations and his experience with the medium is put to great effect here.\n\nAs strange and playful as the film may sound, KOKO-DI KOKO-DA contains some of the most disturbing imagery ever put to screen, punctuated by the catchiest, ear-wormiest piece of children's folk-song goofiness audiences will struggle to forget. This malevolent camping trip from hell may also be one of the most touching meditations on grief to come out in years. (LOGAN TAYLOR)",
    "directors": [
        "Johannes Nyholm"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/koko-di-koko-da"
    },
    "runtime": 86,
    "synopsis": "When a disconnected couple takes a camping trip in an attempt to mend their marriage after tragedy, they find themselves tormented by a peculiar band of misfits.",
    "title": "Koko-DI Koko-Da",
    "year": 2019
}