{
    "countries": [
        "United States"
    ],
    "description": "After starring in a hundred movies over the past two decades, Tina Krause has established herself as an unstoppable warrior from the DIY fringes. LIMBO is the first — and to this day, only — movie written and directed by Krause. And it's truly invigorating.\n\nLIMBO presents three days in the life of a woman named Elizabeth, as she deals with identity issues, sexist mouth-breathers, supernatural manifestations… and a possible trip to hell. Combining video collage experiments with nightmarish mood, this is what might happen if David Lynch and Nine Inch Nails collaborated on a shot-on-video horror movie. Unlike most no-budget productions from the late '90s, LIMBO isn't an ironic slasher or a movie about vampires who wear leather vests. This is a representation of a dream on video, complete with intense emotions, gore-soaked violence, abstract twists, and a disregard for convention.\n\nAfter LIMBO was completed, Krause submitted it for a screening at a convention. The movie was rejected. Undeterred, she resubmitted it under the name \"Stephen Krause.\" The movie was accepted. After the screening, Stephen Krause was called to the stage for a Q&A. That's when Tina Krause addressed the crowd and unleashed an expletive-ridden tirade about the toxic gender politics of the film industry. She raged against the unfairness of it all; here was a woman who had years of experience working on hundreds of productions, both in front and behind the camera. She could write, shoot, edit, direct, and act. Anyone who didn't understand that could go right to hell. And that's what she told them.\n\nPreviously only available via VHS, AGFA and Bleeding Skull! are honored to present a new transfer of LIMBO from the original S-VHS master tape with director Tina Krause in person! (JOSEPH A. ZIEMBA)\n\nWith Director Tina Krause in Attendance.",
    "directors": [
        "Tina Krause"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/limbo-presented-by-agfa-and-bleeding-skull"
    },
    "runtime": 55,
    "synopsis": "Tina Krause's unseen and unreal shot-on-video horror movie, newly preserved by AGFA + Bleeding Skull!",
    "title": "Limbo - Presented by Agfa and Bleeding Skull!",
    "year": 1999
}