{
    "countries": [
        "Austria",
        "United Kingdom",
        "Germany"
    ],
    "description": "Single mother Alice works as a senior plant breeder at a private company, which is developing new species of flora. Her latest creation is a crimson flower that requires intense attention, but in return produces oxytocin, a chemical that causes happiness in its caregivers. As a mother she's quite distant — working in her labs, visiting with her psychiatrist, and perfecting her flora — providing her son only takeout for dinner. Going against the wishes of her teammates, her creation is bred without the ability to reproduce, an aberration which is seen as an abhorrent deviance of nature. In an attempt to connect with her son Joe, she makes a decidedly poor decision to take her new flower home as a gift. Soon after, his personality takes a turn for the peculiar, and the now-named \"Little Joe\" flower becomes suspect.\n\nAustrian director Jessica Hausner's LITTLE JOE is her first English language film and was recently in competition at Cannes. Emily Beecham (INTO THE BADLANDS) and Ben Whishaw (CLOUD ATLAS; THE LOBSTER) star in this meditative slice of science fiction, a film in which the tension and atmosphere is as ever-present as the arid climates of the greenhouses where Little Joes are being cultivated. Scored by Asian-influenced pattering drums, high-pitched squeals, and droning flutes from composers Teiji Ito and Markus Binder, LITTLE JOE is disquieting on the surface and never ceasing in its unsetting chills. Remarkable for its stunning color palette and understated direction of action, this body snatchers for the drugged-out millennium is the antidote for previously dull takes on the trope. (NOAH LEE)",
    "directors": [
        "Jessica Hausner"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/little-joe"
    },
    "runtime": 105,
    "synopsis": "A genetically modified scarlet flower has mood-enhancing antidepressant effects on its owners, which become increasingly alarming as its influence spreads in this body snatchers for the drugged-out millennium.",
    "title": "Little Joe",
    "year": 2019
}