{
    "countries": [
        "United States"
    ],
    "description": "There was a time before ALIEN and a time after ALIEN. There are many films that rank as the best in both science fiction and horror, but none have left a mark on fandom, general audiences, and other filmmakers like Ridley Scott's 1979 masterpiece. It has three sequels, two prequels, and has even been merged into another cinematic universe. The four original ALIEN films have been released and re-released on every conceivable home video format. The devoted have pored over every special feature created (most from Fantastic Fest alumni Charles de Lauzirika), and yet the genesis of Dan O'Bannon's story and HR Giger's designs has never been told in as captivating and complete a way as in Alexandre O. Philippe's MEMORY.\n\nPhillippe leans hard into O'Bannon's story. Having passed away in 2009 from Crohn's disease, O'Bannon's presence in the film is achieved through archival interviews and new interviews with his widow, Diane. We are led from O'Bannon's childhood in suburban St. Louis, to his thirty-page treatment called MEMORY, and ultimately to the unforgettable chest-buster scene, directly influenced by the disease O'Bannon imagined was eating him alive from within.\n\nPhilippe's films work well because he understands why we love movies like PSYCHO and ALIEN, and his analysis explains to us why we love them, plus how the love filmmakers have for them continues to influence cinema today. Through his deconstruction, we are given a new appreciation for the collective art in ALIEN, and learn so much that we want to watch these films again immediately afterward to reflect upon where all the pieces came from and what they mean. His documentaries are always among the genre events of the year. (JAMES EMANUEL SHAPIRO)\n\nWith Director Alexandre O. Philippe in Attendance for 1st half.",
    "directors": [
        "Alexandre O. Philippe"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/memory-the-origins-of-alien"
    },
    "runtime": 93,
    "synopsis": "Following up his deconstruction of PSYCHO's shower scene in 78/52, documentarian Alexandre O. Philippe is back with his analysis of ALIEN, its origins, and the impact of Ridley Scott's classic sci-fi shocker.",
    "title": "Memory: The Origins of Alien",
    "year": 2019
}