{
    "countries": [
        "Canada"
    ],
    "description": "Ian Richard Hodgkinson is better known by his professional wrestler name Vampiro, his ghostly face-painted alter ego. Although Hodgkinson got his start as a wrestler in Montreal, Canada, his formative years were spent working in Mexico in their wrestling federations, better known as lucha libre. However, many fans will recognize him from television, where he worked on World Championship Wrestling in the late '90s/early 2000s and became a tag team champion with The Great Muta.\n\nNAIL IN THE COFFIN explores Hodgkinson's history, highlighting his job running Lucha Libre AAA in Mexico and Lucha Underground in Los Angeles, while balancing being a father to his daughter who lives in his hometown of Thunder Bay, Canada. Unlike many professional wrestling documentaries before, director Michael Paszt has constructed a fascinating and heartfelt look at a wrestler who has overcome and still continues to overcome psychical injuries, sexual abuse, and drug addiction. Not to mention the wild stories of working for Milli Vanilli, or wrestling alongside the punk rock band The Misfits. Vampiro's stories are multi-faceted and completely enthralling.\n\nTold through an engrossing collection of home videos and interviews with his daughter Dasha, NAIL IN THE COFFIN paints a touching picture of a wrestler doing whatever he can to raise his daughter, while keeping the business he also clearly loves running smoothly. We've seen plenty of documentaries about the darker side of the professional wrestling business, and almost all of them focus on American wrestling. This is something quite different.\n\nNot just for fans of spandex and sweat, the film provides an entrancing history of a very human, down-to-earth character, his daughter, and a striking look at Mexican lucha libre history. (NOAH LEE)\n\nWith Director Michael Paszt and El Vampiro in Attendance for 1st half.",
    "directors": [
        "Michael Paszt"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/nail-in-the-coffin-the-fall-and-rise-of-vampiro"
    },
    "runtime": 88,
    "synopsis": "An intimate and heartfelt look at professional wrestler Vampiro's past, and his new life navigating the management of a lucha libre federation in Mexico, while raising his teenage daughter in Canada.",
    "title": "Nail in the Coffin - the Fall and Rise of Vampiro",
    "year": 2019
}