{
    "countries": [
        "United States"
    ],
    "description": "Don't let the fancy Porsche fool you; Russell needs his job driving for a ride-share app. After his career and his marriage both imploded, the car is about the only nice thing left in his life; a stream of entitled pricks asking the same boring questions from his backseat is the seeming penance for his sins. But everything changes when Charlotte's name pops up his phone.\n\nAfter picking up the enigmatic young woman, Russell's night takes a turn. Slipping him a few $100 bills, she convinces him to cancel his loose plans and be her driver for the rest of the evening. Their first stop is a quick in-and-out at her ex's place, where she runs out the door with a tiny suitcase as he chases her, screaming. They make their escape, but this is merely the beginning of a night that'll go completely off the rails. Driving through a residential neighborhood to look at Christmas lights, they accidentally run over a guy, setting in motion a chain of events that will go places Russell could never have imagined.\n\nFantastic Fest alum Brad Baruh is back with his sophomore feature, this time teaming up with longtime collaborator Meghan Leon to co-direct. Fest favorite AJ Bowen stars, putting in a fantastic performance as always — funny and charming in equal measure — while sporting a headful of grey hair like genre film's George Clooney. His facial expressions alone are worth the price of admission, but it's the chemistry with lead actress Sophie Dalah that really anchors the film and sells all the twists and turns, while the Christmas-time setting gives everything a bit of a Shane Black vibe. NIGHT DRIVE is a Coen-esque comedy of errors, an entertaining and sometimes tense film that zigs when you think it will zag, building to an ending you'll never see coming. (LUKE MULLEN)\n\nWith Directors Meghan Leon and Bradford Baruh, and Actors A.J. Bowen, Sophie Dalah, and Scott Poythress in Attendance.",
    "directors": [
        "Meghan Leon",
        "Bradford Baruh"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/night-drive"
    },
    "runtime": 82,
    "synopsis": "When Russell picks up an enigmatic young woman through a ride-share app, his boring evening perks up. But all bets are off after they hit a guy with the car in this charming comedy of errors.",
    "title": "Night Drive",
    "year": 2019
}