{
    "countries": [
        "Belgium"
    ],
    "description": "Disclaimer: I take full responsibility for this film being programmed at your beloved Fest. I fought for it because once in a while, every programmer stumbles upon something so magical that they have to share it. I am warning you, though, this film may not be for everyone. You may even hate me for playing it, but I'll gladly take the hit.\n\nEssayistic and experimental, NIGHT HAS COME is mesmerizing. Director Peter Van Goethem assembled Royal Belgian Film Archive footage from the last century to create an original story, narrated by a fictional man as a memory piece. While it may take a bit of patience to fall into the experiment, once you're in, it's a beautiful experience. The director has put together a post-apocalyptic tale tackling philosophical questions that easily competes with more traditional post-apo features.\n\nA virus erupts and children are the first victims. The people call it \"night\" because it steals memories and leaves only darkness. The State steps in with a new program that can store memories and begins to harvest them all, \"just in case.\" But is the virus really of natural origin? Or was it engineered to provide the next generation with a fresh start (and the State with an easily controlled population)? Quarantine, resistance, riots — Van Goethem throws it all into the mix, and brilliantly uses archival footage to take you on a fictional journey only a step away from reality.\n\nLike the chicken and the egg, you have to wonder which came first in the creation of the film: the narrative text or the choice of images? The editing is superb, and Guy Van Nueten's enthralling score is a perfect match for this out-of-the-ordinary proposal. It's also worth mentioning that the director did this film within the framework of his Doctorate in the Arts at the University of Brussels, and we should celebrate not only the film but also the research work behind it. (ANNICK MAHNERT)\n\nWith Director Peter Van Goethem in Attendance for 1st half.",
    "directors": [
        "Peter Van Goethem"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/night-has-come"
    },
    "runtime": 56,
    "synopsis": "In a dystopian society, the population is threatened by a virus eating its way through the brain, erasing memories. After developing a treatment to store and classify memories, the State requires citizens to comply.",
    "title": "Night Has Come",
    "year": 2019
}