{
    "countries": [
        "Republic of Korea"
    ],
    "description": "Eighty years ago, Jean Renoir's classic THE RULES OF THE GAME upset the ruling class in France so much that one critic angrily tried to burn the theater down immediately after seeing the film. We are hopefully not on the brink of another world war, but the division between the haves and the have-nots is widening daily. With the political divide so stark that empirical truth is up for interpretation, the world is ripe for a good yarn about classism, and Bong Joon-ho is certainly no stranger to class critique. Unlike SNOWPIERCER, Bong doesn't rely on budget or science fiction for this narrative. PARASITE may use symbolism in its title, but there's very little allegory here. Grounded and real, you will recognize this world and how we're all living in it.\n\nThe less said about PARASITE's narrative the better. Bong's previous films have deftly woven their way through different genres and managed to balance a comic and tragic tone, but PARASITE is beyond anything he's done before. It's a film that transforms into something else the moment you thought you knew where it was going.\n\nWill PARASITE drive someone to try to burn a theater down? Probably not. PARASITE's wealthy characters may not be as sympathetic as the ones living in poverty, but they aren't evil or idiots. Simple and lacking self-awareness, yes...but nice. Even so, as one character observes: \"Hell, if I had all this money, I'd be nice too!\" Take away a person's comforts, then their basic needs, and people quickly become something very not nice. The class system rests on the idea that not everyone can win. The only exception is the Fantastic Fest audience members who catch Bong's latest — and for my money — greatest work. (JAMES EMANUEL SHAPIRO)",
    "directors": [
        "Bong Joon-ho"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/parasite"
    },
    "runtime": 131,
    "synopsis": "Bong Joon-ho's seventh feature — about an unemployed Korean family conning their way out of their basement apartment — is a roller coaster ride of laughs, gasps, horror, tears, and perfection.",
    "title": "Parasite",
    "year": 2019
}