{
    "countries": [
        "Belgium"
    ],
    "description": "Set within a nudist camp in Belgium, Tim Mielants' masterful tragicomedy PATRICK successfully blends the uncomfortable with the undeniable to create a film so unique that it needs to be seen to be believed.\n\nPatrick lives on a nudist campsite owned by his mother and his domineering father, Rudy. He works as a handyman, taking care of small repair jobs, helping the residents and generally just getting by. The sudden demise of his father throws his entire world into disarray, and while trying to deal with his feelings, Patrick also realizes that his hammer is missing. Setting off to find the tool will lead Patrick down very strange paths indeed, even as the seeds of rebellion are being planted within the campsite.\n\nFeaturing a seemingly impossible amount of nudity, director Mielants uses the physical nakedness of his actors to disarm the audience and present complex human beings who can only be judged by their characters. By populating the campsite with an eclectic array of people, some helpful to Patrick, others a hindrance, the director effectively creates a micro-universe that is within our own and yet totally isolated.\n\nWith a killer central performance from Kevin Janssens as the titular Patrick and Jemaine Clement in a beautiful turn as a new guest at the campsite, PATRICK is a one-off kind of film that truly belongs at Fantastic Fest. In turns funny and uncomfortable, the story of a man and his hammer will leave a mark not unlike encounters with previous titles like FORCE MAJEURE and TONI ERDMANN. (EVRIM ERSOY)\n\nDirector and Actor Kevin Janssens in Attendance for 1st half.",
    "directors": [
        "Tim Mielants"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/patrick-2019"
    },
    "runtime": 97,
    "synopsis": "Patrick is not having an easy time. First his domineering father passed away and now his favorite hammer is missing. Before the day is out, Patrick's search will lead him to discover answers to the questions he didn't even know existed.",
    "title": "Patrick",
    "year": 2019
}