{
    "countries": [
        "Germany",
        "Bulgaria"
    ],
    "description": "Katrin Gebbe's terrific debut feature, NOTHING BAD CAN HAPPEN, shook the Drafthouse Films team to its core at 2013 Cannes. That film's protagonist endures horrific suffering, seeing it as part of his divine mission to save a brother and sister from their evil, abusive parents. Clearly, Gebbe finds faith to be a compelling motivation as she again uses it in her second film, PELICAN BLOOD.\n\nThis time, Gebbe is working with German thespian Nina Hoss who has twice won the Adolf Grimme acting award, as well as the Silver Bear for Best Actress both at Berlinale and the Lolas. Hoss plays Wiebke, a single mother of an adopted 9-year-old named Nicolina. Wishing to adopt a sister for Nicolina, she finds her new daughter in 5-year-old Raya. But when Wiebke and Nicolina bring Raya home, she immediately starts acting out. Raya isn't just challenging her boundaries; something is really wrong with her, and it could be something beyond physical understanding.\n\nGebbe's inspiration for NOTHING BAD CAN HAPPEN was a news article about an abused, homeless teen, and the film was remarkable in its assured vision and strong performances. PELICAN BLOOD shows her evolving as a mature and strong auteur, inspired by becoming a mother herself. Working with her husband Moritz Schultheiß, one of Germany's best up-and-coming cinematographers, Gebbe explores the driving forces of motherhood and a mother's bond with her child. Comparisons to the EXORCIST are valid: mothers and daughters bound together both by love and something possibly evil. The results here are considerable and even beautiful in the face of the darkest and most horrible possibilities. (JAMES EMANUEL SHAPIRO)\n\nWith Director Katrin Gebbe booked for 1st half.",
    "directors": [
        "Katrin Gebbe"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/pelican-blood"
    },
    "runtime": 121,
    "synopsis": "German acting treasure Nina Hoss headlines Katrin Gebbe's (NOTHING BAD CAN HAPPEN) sophomore feature about a single mother who adopts — and won't give up on — a troubled little girl with a horrific past.",
    "title": "Pelican Blood",
    "year": 2019
}