{
    "countries": [
        "France"
    ],
    "description": "When I describe this documentary as sad, I mean it in the most respectful way possible. Phil Tippett is a too often unsung hero of the visual effects industry. If you're not sure who I'm talking about, he's the guy who did stop-motion, designs, and visual effects on STAR WARS, DRAGONSLAYER, ROBOCOP, INDIANA JONES, JURASSIC PARK, and fucking STARSHIP TROOPERS, just to name a few — all films that have rocked the cradle of our cinephile childhoods. He's an artist whose craft was done by hand, meticulously and lovingly, with hours and hours spent making sure every detail was right.\n\nThe film takes us deep into Tippett's beginnings, influences, collaborations, and his struggle with the industry. When I say sad, it's because he's just one of the many victims of technological advancements in favor of digital VFX. I'm not saying this is bad — I'm the first one to go see AVENGERS at the theater — but your heart bleeds for a man who dedicated his entire life to making us believe in worlds imagined by amazing storytellers. I remember shaking at the apparition of the dragon in DRAGONSLAYER (a dragon design that in my opinion has never been matched) or screaming at the arachnid bugs of STARSHIP TROOPERS. Somehow they felt real… and that's what it was about.\n\nAlexandre Poncet is a journalist who writes for the French equivalent of FANGORIA and Gilles Penso has been in the French movie industry for a while. Their fascination for the SFX and VFX lead them to collaborate on the amazing portrait of yet another hero of the VFX industry, Ray Harryhausen. In 2015, they co-directed CREATURE DESIGNERS - THE FRANKENSTEIN COMPLEX which explored the history of special effects in film. With PHIL TIPPETT - MAD DREAMS AND MONSTERS, Poncet and Penso take us on the powerful and emotional journey of an artist who had to adapt to a quickly evolving industry which rendered his amazing skills almost obsolete. It's the story of our time, where artisans are too often neglected in favor of quicker and cheaper processes. The Frenchmen's fantastic documentary gives credit where credit is due, putting Tippett back where he belongs, on the Olympus of visual effects alongside the creatures he created. (ANNICK MAHNERT)\n\nWith Directors Alexandre Poncet and Gilles Penso in Attendance for 2nd half.",
    "directors": [
        "Gilles Penso",
        "Alexandre Poncet"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/phil-tippett-mad-dreams-and-monsters"
    },
    "runtime": 80,
    "synopsis": "After their documentary CREATURE DESIGNERS - THE FRANKENSTEIN COMPLEX, French journalist Alexandre Poncet and filmmaker Gilles Penso deliver an in-depth, sad, and beautiful documentary about the stop motion and VFX artist Phil Tippett, a man who changed the landscape of visual effects in film.",
    "title": "Phil Tippett - Mad Dreams and Monsters",
    "year": 2019
}