{
    "countries": [
        "United States"
    ],
    "description": "After being caught while filming REFLECTIONS OF EVIL inside Universal Studios, filmmaker Damon Packard was banned for life from the theme park. He made the right choice.\n\nOne fine day in Los Angeles, Bobby (Damon Packard) materializes. Bobby is a behemoth who looks like a walking Salvation Army, with layers of tattered clothes, a somnambulistic gait, and dozens of broken headphones hanging from his neck. Like a mutated analog of SALESMAN, Bobby wanders the streets and attempts to sell discount watches. He loses his shit every time he misses the bus, makes eye contact with other humans, or encounters a dog. Everyone that Bobby meets is mean and aggressive, including a real-life cop who is disgustingly racist and homophobic — a true reflection of evil. During a flashback, it's revealed that Julie, Bobby's sister, ran away and joined a supernatural drug cult. Is Julie alive or undead? And will Bobby ever be able to fill the void of her absence?\n\nREFLECTIONS OF EVIL is like seeing an astral projection of someone's mental breakdown through the prism of low-budget horror aesthetics. Produced and self-distributed by Packard thanks to an unexpected inheritance, this is a highly personal psychedelic collage that utilizes 16mm film, video, and found footage to comment on the hopelessness of society. Packard's stream-of-consciousness style is built on visual manipulations, breakneck editing, renegade plagiarism, mismatched audio effects, and the juxtaposition of tones. This is true genre anarchy: a rage-filled, 137-minute outsider manifesto that toes the line between artsy triumph and genre pastiche. Imagine Steven Spielberg smoking peyote for the first time while watching Peter Jackson's BAD TASTE at Kenneth Anger's house and you're halfway there.\n\nUnsettling, fascinating, sad, and hilarious, REFLECTIONS OF EVIL offers a glimpse into a secret dimension that the vast majority of the world's population would violently reject. For the rest of us, it's a dream come true. After watching this movie, you'll never look at E.T., The Carpenters, or food the same way again. (JOSEPH A. ZIEMBA)",
    "directors": [
        "Damon Packard"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/reflections-of-evil-presented-by-agfa"
    },
    "runtime": 137,
    "synopsis": "The new ground zero for gonzo horror surrealism in the 21st century, newly preserved by AGFA.",
    "title": "Reflections of Evil - Presented by Agfa",
    "year": 2002
}