{
    "countries": [
        "United Kingdom"
    ],
    "description": "Beautiful, reserved, and devout Maud needs a change of scenery and a new assignment to take her mind off the growing pains in her stomach. She takes a nursing job caring for Amanda, a former dancer battling stage three spinal cancer. Amanda is strong, enigmatic, and alluring, clearly struggling to leave her bon-vivant lifestyle behind in her final months on earth.\n\nThough the two women couldn't be more different on the surface, they form an inexplicable bond that grows from mutual admiration to misguided resentment. All the while, a more powerful force starts to take over Maud, causing terrifying bouts of physical contortion in the vein of demonic possession that lead to a dramatic and alarming psychological breakdown. Could Maud truly be under the power of the Lord himself, or has she simply begun a sexual awakening for which she has no better explanation?\n\nRose Glass displays a masterful grasp for the craft far beyond what one expects from a feature debut. SAINT MAUD is gorgeously shot, viscerally constructed, and endlessly enthralling cinema. Morfydd Clark imbues Maud with an uneasy air of desperation, fragility, and instability. It's a remarkably versatile performance that pairs perfectly with Jennifer Ehle's brazen interpretation of the headstrong Amanda. Throw in a haunting soundscape and a perfectly gradual sense of ever-increasing paranoia, and SAINT MAUD becomes an unforgettable entree into the paranoid psychological thriller canon. (LOGAN TAYLOR)\n\nWith Director Rose Glass in Attendance for 1st half.",
    "directors": [
        "Rose Glass"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/saint-maud"
    },
    "runtime": 83,
    "synopsis": "While caring for an attractive woman dying of cancer, devoutly religious nurse Maud develops an all-encompassing case of holy possession mixed with real-life obsession.",
    "title": "Saint Maud",
    "year": 2019
}