{
    "countries": [
        "United States"
    ],
    "description": "When A NIGHTMARE ON ELM STREET 2: FREDDY'S REVENGE was released in 1985, it wasn't long before people noticed something was just a little different. The sequel's premise of a teenage boy named Jesse (Mark Patton) becoming possessed by Freddy was a departure from the slasher tropes embraced by the original.\n\nHowever, it was the film's homoerotic shower scene, foray into a gay leather bar, and Patton's positioning as a screen queen that raised more than a few eyebrows, and became the main point of discussion when talking about the film for years to come. Amid backlash and finger-pointing about his sexuality's impact on the film, and the fear of homosexuals and AIDS permeating the culture in the mid-'80s, Mark Patton left Hollywood. Now, more than three decades later, he wants to set the record straight.\n\nSCREAM, QUEEN! MY NIGHTMARE ON ELM STREET is a special kind of eye-opening documentary, inviting fans not only to delight in the batshit uniqueness of NOES2, but also asking them to reckon with what it means for the film to exist in the first place. Through interviews with the cast and crew of NOES2, as well as film and queer culture luminaries like Peaches Christ, SCREAM, QUEEN! directors Roman Chimienti and Tyler Jensen are unafraid to revel in the love and fandom that has grown for the film, while also confronting the heartbreaking and challenging realities that are part of its legacy. At the center of it all is Mark Patton, a wonderfully gracious and honest man with an important story who is sure to win the hearts of all.\n\nNOES2 is a surprising example of how attitudes and conversations around the ideas of queer representation and portrayal in film have changed over the past thirty years. Derided by most series fans after its release, eventually embraced by curious audiences, it can now be celebrated for what it really is. SCREAM, QUEEN! serves as an essential companion piece to NOES2, allowing Mark to tell his amazing story and providing crucial context that seals its place in the pantheon of great horror films, queer or otherwise. (BRIAN KELLEY)\n\nWith Directors Roman Chimienti and Tyler Jensen, and Actor Mark Patton in Attendance for 1st half.",
    "directors": [
        "Roman Chimienti",
        "Tyler Jensen"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/scream-queen-my-nightmare-on-elm-street"
    },
    "runtime": 100,
    "synopsis": "More than thirty years after its release and his departure from Hollywood, Mark Patton (star of A NIGHTMARE ON ELM STREET 2: FREDDY'S REVENGE), sets the record straight on the famously queer horror sequel in this fabulous, surprising, and eye-opening documentary.",
    "title": "Scream, Queen! My Nightmare On Elm Street",
    "year": 2019
}