{
    "countries": [
        "United States"
    ],
    "description": "Hunter has everything some women dream of: a beautiful home, a handsome husband, and loving, attentive in-laws. Clad in chic '50s housewife attire and living in a mid-century modern mansion straight from BETTER HOMES AND GARDENS, she's the picture of idyllic wifeliness from a bygone era.\n\nHer in-laws coddle her and her husband worships her, especially once she reveals she is pregnant with their first child. All this fawning, however, conceals a growing condescension and control over Hunter's every move and choice. Everyone wants to keep Hunter in her place: safe and secure in the stylish home her husband built for her. As long as she fulfills her wifely duties — keeps the home clean, a nice dinner on the table, and her husband's workday clothes washed and pressed — everything will be okay.\n\nBut as the pressure to be perfect mounts and the loneliness of her lifestyle creeps in, Hunter finds herself inexplicably drawn to consuming household objects. It starts innocently enough, but her experiments escalate, ultimately causing her physical and emotional destruction. The film purposely avoids explaining each of Hunter's choices, instead allowing viewers to put themselves in her shoes and embrace her charming character with empathy and patience.\n\nCarlo Mirabella-Davis creates a world that exists separate from our time, hovering between contemporary and '50s-era gender politics. The initial impression feels antiquated, a reminder of a past that is blessedly forgotten; but Mirabella-Davis's subtle, complex sense of time and place revives and reanimates the stubbornly resilient cultural baggage.\n\nHaley Bennett shines as a Marilyn Monroe-esque figure, all buxom curves bound in dainty twin sets with carefully coiffed hair and a delicate, wispy voice. But like Monroe before her, Hunter drifts between the world's expectations of her and her own needs and lingering psychological damage.\n\nUltimately, SWALLOW is a gorgeous, fascinating allegory about autonomy, femininity, family, and trauma told by a master filmmaker and a thrilling young actress worth watching. (LOGAN TAYLOR)\n\nWith Director Carlo Mirabella-Davis in Attendance for 1st half.",
    "directors": [
        "Carlo Mirabella-Davis"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/swallow"
    },
    "runtime": 94,
    "synopsis": "Beautiful newlywed Hunter has a perfect home, perfect life, and perfect husband. When the pressure to maintain that perfection builds after the announcement of her pregnancy, she develops an unusual craving: swallowing random household objects.",
    "title": "Swallow",
    "year": 2019
}