{
    "countries": [
        "United States"
    ],
    "description": "After a storm at sea, Jenn washes up on a deserted island with her friend, but soon finds herself the lone survivor Alone on the island, she gathers her strength to survive. After discovering horribly mutilated animals and huge pools of blood, Jenn suspects she might not be truly alone, and whatever's out there is hungry.\n\nJ.D. Dillard seemed to burst onto the indie film scene when his film SLEIGHT hit Sundance in 2016. His follow-up, SWEETHEART, landed him in Park City again earlier this year. Having back-to-back features premiere at one of the biggest and most prestigious film festivals in the world is no small feat, but there are plenty of good reasons Dillard's work has defied the odds. SWEETHEART's storytelling is almost disarmingly simple; it's a basic survival tale that throws us in the deep end with no unnecessary preamble. There's no bullshit here, no extra fat weighing it down, just the lean meat of the story told at a swift and steady pace.\n\nThe fantastic score and otherworldly sound design keep the tension high, especially when Jenn — and the audience — can't quite see what's out there in the dark. The cinematography is simply gorgeous. Days are bold and bright, the sky and sea both impossibly blue, while the nights are dark with rich deep shadows; beautifully framed compositions abound. Featuring an all-timer reveal shot — one of the best in decades — SWEETHEART is a tense and thrilling creature-feature that will leave you breathless. (LUKE MULLEN)\n\nWith Director J.D. Dillard in Attendance for 1st half.",
    "directors": [
        "J.D. Dillard"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/sweetheart"
    },
    "runtime": 82,
    "synopsis": "After a storm at sea leaves her stranded on a deserted island, Jenn gathers all her strength to find ways to survive. But when night falls, Jenn discovers that the island isn't as deserted as she might have thought… or hoped.",
    "title": "Sweetheart",
    "year": 2019
}