{
    "countries": [
        "United States"
    ],
    "description": "Justin Benson and Aaron Moorhead continue to cement their status as the foremost chroniclers of intelligent genre cinema in their brilliant follow-up to THE ENDLESS. Anthony Mackie and Jamie Dornan star as a pair of paramedics who find their world embroiled in endless tragedy when a new designer drug called Synchronic starts to infect the streets of New Orleans.\n\nCapturing a new side of New Orleans, a land of twilight and endless melancholy, Benson and Moorhead create a world that sits somewhere between the works of Martin Scorsese and Ridley Scott. The descent into tragedy of those addicted to Synchronic feels all too real in an age where the opioid crisis is destroying countless lives. Using genre smarts, the directors bring an otherworldly angle to the proceedings that keeps the rhythm of the piece ticking. Blessed with sensitive portrayals from their two leads, Benson and Moorhead clash genres together to create a symphony of discord that would have felt crass and inferior in the hands of less talented directors. Add to the mix a ravishing score and breathtaking cinematography and SYNCHRONIC is guaranteed to linger for a long time.\n\nTruly a journey worth taking, SYNCHRONIC feels like the next natural step in the evolution of the power duo, an expansion of their idiosyncratic world view without ever losing their razor-sharp ability to shape the experience of the film. This is a big screen blast that will leave everyone and everything reeling in its wake. (EVRIM ERSOY)\n\nWith Directors Justin Benson and Aaron Moorhead in Attendance for 1st half.",
    "directors": [
        "Justin Benson",
        "Aaron Moorhead"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/synchronic"
    },
    "runtime": 96,
    "synopsis": "Two paramedics find their world ripped apart when they start encountering deaths linked to the otherworldly effects of a new designer drug called Synchronic.",
    "title": "Synchronic",
    "year": 2019
}