{
    "countries": [
        "United States"
    ],
    "description": "Frank is a bored corporate lawyer who is about to get the biggest promotion of his life. To celebrate, he lets loose with a night out on the town with his single friend, Jeff. Many shots into their night, the guys follow a pair of flirtatious women to a house party where a persuasive drug dealer convinces Frank to try a mysterious white powder. Frank blacks out immediately, only to wake up alone in the house with no memory of the night before and a lot of unanswered questions. Thus begins a twisted time travel journey that's equal parts LOOPER, GROUNDHOG'S DAY, and DUDE, WHERE'S MY CAR?\n\nThe film stars the always-delightful Justin Long, leaving behind the early hipster charm of the \"Apple Guy\" for a far more \"PC Guy\" brand of white-collar yuppie. Even in a more contained role, he and costar Donald Faison inject the film with goofy, expressive humor that keeps things lively even in the most cerebrally complex plot moments.\n\nFeaturing a driving futuristic score, hallucinogenic camerawork, and the most surreal use of rotoscope animation in modern cinematic memory, Gille Klabin's narrative debut heralds an original new talent with a clear eye for fast-paced action. With whip-smart dialogue, comically over-the-top characters, and enough time travel twists to keep the biggest sci-fi fan on the edge of their seats, THE WAVE is a fresh take on a classic genre that is guaranteed to simultaneously confound and entertain. (LOGAN TAYLOR)\n\nWith Director Gille Klabin in Attendance; Actors Justin and Donald Faison in Attendance for 1st half.",
    "directors": [
        "Gille Klabin"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-wave-2019"
    },
    "runtime": 87,
    "synopsis": "Frank (Justin Long), a bored corporate lawyer, decides to shake it up with a wild night out. In the process, he takes a mysterious drug that launches him into a mind-bending time travel adventure.",
    "title": "The Wave",
    "year": 2019
}