{
    "countries": [
        "Spain"
    ],
    "description": "Galder Gaztelu-Urrutia's exquisite debut is the kind of midnight movie audiences dream of. His killer setup — a vertically tiered prison where prisoners are taunted by a moving platform laden with exquisite food but available for only brief windows of time — is a jumping-off point to deliver a state-of-the-union about Spanish society. The result is satisfying as a genre film while also working as a poignant commentary on the disturbing nature of mankind, the atrocious deeds we are capable of, and what the true meaning of humanity may be.\n\nWhen we meet Goreng (Ivan Massagué in a beautifully understated role), he has just arrived on The Platform and has been assigned to the level of old-hand Trimagasi (Zorion Eguileor in top form) who explains to him the rules: the levels are assigned randomly, those in the upper tier get to eat and those in the lower tier have to fight for survival. Although Goreng is reluctant at first to accept the system he finds himself in, it isn't long before his survival instincts kick in, igniting a battle that spirals all the way down to the core of what it means to be a human being.\n\nVisually striking, filled with unforgettable imagery and a sense of rhythm that delivers, THE PLATFORM takes the audience on an emotional and visceral journey that constantly questions the beliefs we hold dear. Looking at society through the microcosm of this brutal prison system, the film confirms there's more to us than meets the eye: sometimes frightening, sometimes vicious, but always, always tinged with the inherent kindness that can exist somewhere within us. And as the world loses its mind, The Platform continues to move downward, never stopping, never slowing down.\n\nDestined to be one of the biggest talking points of Fantastic Fest, THE PLATFORM delivers thrills, chills, and lateral spills in the most unique way possible. (EVRIM ERSOY)\n\nWith Director Galder Gaztelu-Urrutia in Attendance for 2nd half.",
    "directors": [
        "Galder Gaztelu-Urrutia"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-platform"
    },
    "runtime": 90,
    "synopsis": "Somewhere in the future exists THE PLATFORM, a vertically tiered prison where the upper levels have access to exquisite food and the lower levels fight for survival. Level assignments are random, but how long can a prisoner's luck hold? One man is about to find out.",
    "title": "The Platform",
    "year": 2019
}