{
    "countries": [
        "United States"
    ],
    "description": "Sometime in the 1950s, the sky is turning to dusk in Cayuga, New Mexico, and the United States is on the cusp of the space race. Everett (Jake Horowitz) is the local DJ and technical whiz who helps the high school with its radio gear for recording sporting events. His friend Fay (Sierra McCormick), a talkative young student, works as a telephone operator connecting the townspeople on her switchboard. One quiet evening during a school basketball game, they begin receiving strange signals over the telephone lines, which sends both of them down a rabbit hole of intrigue, trying to figure out just what that odd sound may be.\n\nDirector Andrew Patterson's first feature film is quite the accomplishment. THE VAST OF NIGHT channels THE TWILIGHT ZONE; its mystery dissolves into a tasty mesh of strange noises over a phone line, old timey radio, long lost recordings in a library, long-take interviews with people who may know what's going on, and pitch perfect hard-boiled dialogue. Patterson establishes Cayuga as an accurate representation of the down-home town, where doors are never locked, everyone knows everyone's business, and a squirrel chewing through the lines at the high school is big news. That is, until bigger news starts unfolding for Everett and Kay and their radio listeners, in real time, unbeknownst to everyone at the basketball game.\n\nFeaturing some mind-blowing cinematography and tracking shot work by M.I. Littin-Menz, his collaboration with Patterson pulls us into that little black and white TV screen of days past, and then fills it with both a sense of homeyness and underlying dread. The dialogue and story from writers James Montague and Craig W. Sanger capture the intrigue one would get from the classic \"walk and talks\" of Aaron Sorkin at his peak.\n\nFrankly, THE VAST OF NIGHT is the whole package. For fans of classic science fiction, quality stories told well, and the journey into a fifth dimension, you cannot do better. (NOAH LEE)",
    "directors": [
        "Andrew Patterson"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-vast-of-night"
    },
    "runtime": 90,
    "synopsis": "A rural 1950s radio DJ and a telephone operator uncover a strange signal that could change everything in this stunning science fiction debut feature.",
    "title": "The Vast of Night",
    "year": 2019
}