{
    "countries": [
        "United States"
    ],
    "description": "The truth isn't out there... BECAUSE IT'S RIGHT HERE.\n\nOn October 8th, 1983, the McPherson family gathered together to celebrate the 5th birthday of Michelle, the littlest member of their household. Candles were blown out. Presents were exchanged. Laughs were had. And everything was captured on VHS by Michael McPherson and his new camcorder. Including the alien invasion.\n\nA decade before THE BLAIR WITCH PROJECT terrorized millions, broke box office records, and redefined the horror landscape, there was THE MCPHERSON TAPE. Shot for $6000 on a consumer-grade camcorder by first-time filmmaker Dean Alioto in 1989, this is the first found footage horror movie on the planet. Much like Orson Welles' legendary radio broadcast of WAR OF THE WORLDS, THE MCPHERSON TAPE uses minimalist methods to create maximum-ist emotional chaos. Alioto blends the production design of a Jaycees haunted house with a dead serious tone to forge a fun, hypnotic nightmare that upends the concept of reality. The movie was so convincing that Fox News aired an expose in 1994 to uncover the \"truth\" about this mysterious videotape that allegedly featured a real-life UFO abduction. Who's to say it didn't actually happen?!\n\nDue to a warehouse fire at the original distribution company, THE MCPHERSON TAPE was never officially released. AGFA + Bleeding Skull! are proud to present the world premiere of this important milestone in shot-on-video horror history, newly preserved from the original 3/4\" master tape! For this special screening, we'll be joined by director Dean Alioto, who will hopefully reveal the truth… once and for all. (JOSEPH A. ZIEMBA)\n\nWith Director Dean Alioto in Attendance.",
    "directors": [
        "Dean Alioto"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-mcpherson-tape-presented-by-agfa-and-bleeding-skull"
    },
    "runtime": 63,
    "synopsis": "The world's first found footage horror movie, newly preserved by AGFA + Bleeding Skull!",
    "title": "The Mcpherson Tape - Presented by Agfa and Bleeding Skull!",
    "year": 1989
}