{
    "countries": [
        "United States"
    ],
    "description": "When a young girl attends a funeral in an old mortuary, she stumbles upon a secret room full of curiosities where she meets the towering, ominous mortician: a startling figure of a man existing somewhere between Lurch and PHANTASM's Tall Man. The mortician guides the young girl through his collection, sharing four stories of wild, unique, and memorable deaths.\n\nThus begins the narrative skeleton surrounding Ryan Spindell's (THE BABYSITTER MURDERS) delightful, morbid, and clever anthology. Where many anthologies can feel either one-note or tonally scattered, Spindell's has an admirable amount of both cohesion and variety.\n\nEach of the four stories brings us into a fully realized, impeccably designed period piece, moving chronologically from the 1950s through the 1980s. A '50s housewife struggles with a mysterious presence in her bathroom; a '60s college boy gets a taste of his own fraternizing medicine; and a '70s husband makes some tough decisions about his wife — all culminating in Spindell's hugely popular '80s-set BABYSITTER MURDERS.\n\nEach film showcases Spindell's remarkable talent for balancing humor and terror, as well as his startling ability to completely pull the rug out from under the audience. With a vibrant variety of tones, timely and important themes, and enough laughs, screams, and squirm-inducing moments to make its two-hour runtime fly by, THE MORTUARY COLLECTION is a wild ride that's sure to thrill. (LOGAN TAYLOR)\n\nWith Director Ryan Spindell in Attendance; Actors Clancy Brown, Caitlin Fisher, Barak Hardley, Christine Kilmer, Mike Nelson, and Sarah Hay in Attendance 1st half.",
    "directors": [
        "Ryan Spindell"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-mortuary-collection"
    },
    "runtime": 108,
    "synopsis": "A young girl enters a secret room in a mortuary and learns the backstory of the mortician's favorite deaths in this twisted anthology by Fantastic Fest alum Ryan Spindell.",
    "title": "The Mortuary Collection",
    "year": 2019
}