{
    "countries": [
        "Turkey"
    ],
    "description": "Set within a dystopian vision of Turkey, the central government has decided to install new TV antennae throughout the country to allow every citizen to tune in to their nightly broadcasts. In a crumbling building block that isolates residents from every layer of society, the building superintendent Mehmet oversees the deployment of the antenna. Within minutes of its installation, the worker falls to his death from the roof. His death signals the start of a mysterious process which will affect all the residents, causing bloody havoc throughout the building.\n\nMixing the body-horror elements of David Cronenberg with a keen political sensibility, Orçun Behram's brilliant debut heralds the arrival of a new voice within Turkish genre cinema. Digging deep into Turkey's checkered history, its totalitarian governments, and endless sense of oppression, Behram unearths a chaos and horror to rival those of H.P. Lovecraft's Old Gods. Here is an apartment block right next to our own and yet nowhere; this sense of displacement is reflected both within the larger picture and each of the characters we encounter.\n\nAs the newly installed antenna drips black goo that rots any object it touches, Mehmet desperately tries to identify the malevolent force pushing them ever closer to destruction. Meanwhile, the family tragedies, domestic squabbles, and commonplace violence of daily life find their wavelengths amplified with a little help from the antenna.\n\nWith striking cinematography and instantly unnerving imagery, Behram concocts a world that is both familiar and alienating. With the help of a killer electronic soundtrack, beamed to us from a future unknown, this is one trip into the heart of corruption that encourages the audience to think deep and hard about what signals we let into our lives. (EVRIM ERSOY)\n\nWith Director Orçun Behram in Attendance.",
    "directors": [
        "Orçun Behram"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-antenna"
    },
    "runtime": 115,
    "synopsis": "Somewhere within an unnamed city in Turkey, the residents of an apartment block await the installation of their new antenna as ordered by the central government. No one can prepare them for the evil that will be unleashed.",
    "title": "The Antenna",
    "year": 2019
}