{
    "countries": [
        "Germany"
    ],
    "description": "In the early 1970s, Hamburg was a city stuck between worlds. On one hand, the newly vigorous German economy was propelling citizens to comfort and prosperity. On the other, the generation that struggled economically through WWII were sidelined and forgotten. Those forgotten hide in Hamburg's Red Light District, where they escape their depression via long, drunken nights at The Golden Glove. Even within the grotty district, The Golden Glove is the lowest dive.\n\nFritz Honka, a hunched, bug-eyed Golden Glove regular, has a penchant for prostitutes and abusive sexist inclinations that quickly turn murderous. He preys on the despair of female bar patrons, luring the loneliest souls to his vile apartment before inflicting appalling sexual and physical violence upon them. It is essential to note, however, that the film does not delight in this violence. Instead, the camera seems deeply ashamed of Honka's actions, turning away from or blocking our view of the worst atrocities he commits. The film's opening ten minutes tell you everything you need to know about the world Fatih Akin has unapologetically built: brutal, grim, and shocking. There's no gentle build up. For better or worse, it's clear what we're in for.\n\nWhile this may sound like a film that hates its characters as much as the world they inhabit, Akin is remarkably empathetic in his depictions. Each bar patron has a distinct personality, vulnerability, and — in many cases — charm. With every poor choice a character makes, Akin seems to question not why they made said choice, but whether another option was ever available to them. Jonas Dassler, an objectively handsome 23-year-old actor, transforms himself down to the smallest physical tic, creating a Peter Lorre/Quasimodo hybrid that will haunt audiences from his first appearance on screen.\n\nInfamously panned following its Berlin premiere, THE GOLDEN GLOVE is not an easy film to sit through. It requires a strong stomach from its viewers but rewards those who endure with a masterpiece of staging, performance, and storytelling that elicits genuine sympathy towards the underbelly of society so often forgotten or insulted in mainstream media. (LOGAN TAYLOR)",
    "directors": [
        "Fatih Akin"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-golden-glove"
    },
    "runtime": 110,
    "synopsis": "Based on true events that transpired in the grimy slums of 1970s Hamburg, loner-turned-murderer Fritz Honka stalks his local drinking spot, The Golden Glove, in search of his next victim.",
    "title": "The Golden Glove",
    "year": 2019
}