{
    "countries": [
        "Germany"
    ],
    "description": "\"On a Saturday night in late summer 2012, the Durati Family was killed during the robbery of their house.\" This event, based on a true story, occurs at the very end of Sara Summa's debut feature, THE LAST TO SEE THEM, and yet this is not a spoiler. That first sentence is the opening title card of the film, telegraphing the main characters' fates in a few brief, tragic words.\n\nTHE LAST TO SEE THEM takes an unorthodox storytelling approach, exploring in immense detail the lives of the four members of the Durati family the day before the robbery. Despite her characters' inevitable demise, Summa shows endless empathy for each family member through a patient, observant account of the minutiae of everyday domestic life. As audiences grow more attached to these characters, their most casual lines of dialogue take on unexpected gravitas. All plans for the future feel like tiny stabs in the audience's heart.\n\nSumma elicits arresting and peculiar performances from her actors. There's a sense that each character is \"going through the motions,\" trying to keep up appearances and maintain order even as each seems deeply unsettled when witnessed in moments alone. The characters seem almost possessed or haunted — at the very least overcome by something intangibly askew.\n\nThe production team makes careful use of space, choreographing a domestic dance around the home reminiscent of a stage play. The camera lurks in these spaces like a fly on the wall. Helpless to stop what's coming, the audience is left with the eerie, unsettling realization that they will, in fact, be the last to see the characters alive.\n\nSumma's debut feature is a revolutionary exercise as a sort of anti-found-footage film. Artfully exploring cinema's unique ability to play with temporality, it deftly probes major existential questions about life and how to best live it in the face of our inevitable, unpredictable end. (LOGAN TAYLOR)\n\nWith Director Sara Summa and Composer Ben Roessler in Attendance for 2nd half.",
    "directors": [
        "Sara Summa"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-last-to-see-them"
    },
    "runtime": 79,
    "synopsis": "One summer evening in rural Italy, the Durati family is murdered during a home robbery. THE LAST TO SEE THEM chronicles the previous — and final — day of their lives.",
    "title": "The Last To See Them",
    "year": 2019
}