{
    "countries": [
        "United States"
    ],
    "description": "Mother Ivy and daughter Echo deviate from the standard lives of most in their small town in upstate New York. Ivy makes a living conning people out of money as a fortune teller, and Echo gets into trouble at school with her dark goth-like makeup, love of old-timey music, hunting, and sassy attitude. Recluse Kurt, a man who seems to have something to hide, moves in down the road from them and spends his days renovating a broken-down old farmhouse. One dark and deadly evening as Echo is out sledding, their lives crash together with unfortunate results. Ivy begins searching for her missing child as Kurt literally buries his secret beneath the ground and becomes haunted by his misdeeds.\n\nThe Adams Family, comprised of John Adams, Toby Poser, and daughter Zelda, are the complete filmmaking package. Working together, they directed, wrote, shot, and starred in this independent supernatural horror film that firmly plants its roots in reality while skirting the edges of the surreal. Basing the film in their home of the Catskill Mountains allows for an icy approach to their storytelling, both literally and figuratively. THE DEEPER YOU DIG lives within its restraints, turning them into solid strengths, giving its world a lived-in and ultimately unsettling atmosphere. Paired with some slick camera work, the emotive performances from its leads and their self-composed disquieting score implies a film with a much higher budget.\n\nDrawing on increasingly bizarre elements, THE DEEPER YOU DIG morphs from a simple tragedy into the Lynchian. Rather than focusing on the balls-out terror that modern horror films tend to favor, the Adams team tethers their film to a simplicity of style which, sewn together with its occultish reveals, bores its fears into your core, chilling your inner being as effectively as nature does the fall forests on screen. (NOAH LEE)\n\nWith Director Toby Poser in Attendance.",
    "directors": [
        "Toby Poser",
        "John Adams",
        "Zelda Adams"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-deeper-you-dig"
    },
    "runtime": 95,
    "synopsis": "The creation of a family production team in upstate New York, this unsettling supernatural tale explores the aftermath of a roadside accident, bringing together a mother, her daughter, and a stranger in increasingly surreal circumstances.",
    "title": "The Deeper You Dig",
    "year": 2019
}