{
    "countries": [
        "United States"
    ],
    "description": "From Daniel Scheinert, one half of the duo behind the inventive SWISS ARMY MAN, THE DEATH OF DICK LONG is the kind of unclassifiable cinema that engages, questions, and ultimately touches the heart while being simultaneously outrageous, funny, and utterly squirm-inducing.\n\nDick is dead thanks to a night that veered out of control after band practice, and best friends Zeke and Earl are determined to make sure the truth about what happened never comes out. However, the unexpectedly dogged Officer Dudley from the sheriff's department and their ever-inquisitive friends and family constantly threaten to derail the dimwitted duo's desperate distractions from the truth.\n\nHalf outrageous buddy comedy and half a touching and melancholy exploration of fragile masculinity, THE DEATH OF DICK LONG is the kind of cinematic tightrope walk only attempted by the bravest of directors. The fact that Scheinert not only pulls it off but does it with aplomb is a testament to one of the most creative and unique voices working in film. Special mention must go to the tender depiction of this small town in Alabama; giving it a humanity probably not seen since FARGO, Scheinert is honest but gentle in his portrait of everyday folk, finding humor in their personalities as opposed to mockery.\n\nPerhaps it's this tender streak that sets the film so spectacularly apart, a beating, emotional heart in its weird, gross-out chest. THE DEATH OF DICK LONG is the kind of film that makes you glad weird cinema is alive and well. (EVRIM ERSOY)",
    "directors": [
        "Daniel Scheinert"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-death-of-dick-long"
    },
    "runtime": 107,
    "synopsis": "Dick is dead but no one knows how, and Zeke and Earl are desperate enough to go to any lengths to stop anyone from finding out the reason...but a small town in Alabama is not the kind of place where secrets can stay buried for long. Soon all hell breaks loose, engulfing the two men in a reckoning they had never even considered.",
    "title": "The Death of Dick Long",
    "year": 2019
}