{
    "countries": [
        "United States"
    ],
    "description": "GOODNIGHT MOMMY was one of the rare films that crossed between genre and arthouse audiences. It announced the emergence of two major talents, Austrian co-directors Severin Fiala and Veronika Franz. The rare aunt/nephew filmmaking duo found ways to creep under our skin and into our nightmares with a tale of a mother and her two twin sons, isolated in the country as she recuperates from surgery. As the twins grow increasingly worried about their mother, the pressure of being alone with each other grows past the boiling point.\n\nTalking about THE LODGE and its story is not easy without giving away its secrets, so let's not even try. It's similar to GOODNIGHT MOMMY in that it deals with a fractured family dynamic, and again puts adults and kids in tense situations where nothing good can happen. Its craft is as accomplished as GOODNIGHT MOMMY, and it's scary as all hell, but what is most impressive about the film is how the narrative takes its time. Layer by layer, everything the audience needs in their heads for the finale is revealed bit by bit throughout the film. When the third act hits, you're watching a jigsaw puzzle come together before your eyes. This is a riddle that's not about monsters or the Devil. It's not about demons or vengeful spirits. This is as human as a horror film can be, and what makes it both great and terrifying.\n\nTHE LODGE opened this year's midnight section at Sundance, and — like THE WITCH and HEREDITARY — was the one midnight film that left with a distribution deal and Park City still buzzing. We don't play a lot out of Sundance, but something this scary can't be ignored and must be shared with Fantastic Fest audiences. Kiss sleep goodbye, and try to keep warm. (JAMES EMANUEL SHAPIRO)",
    "directors": [
        "Veronika Franz",
        "Severin Fiala"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-lodge"
    },
    "runtime": 108,
    "synopsis": "Five years after GOODNIGHT MOMMY stunned Fantastic Fest audiences, Veronika Franz and Severin Fiala are back with another disturbing psychological twister about a brother and sister spending Christmas with their shadowy soon-to-be stepmother.",
    "title": "The Lodge",
    "year": 2019
}