{
    "countries": [
        "Mexico"
    ],
    "description": "The prolific Rogelio A. González directed over seventy films, many of which are considered bona fide classics from the Golden Age of Cinema in Mexico. Adding in the incredible duo of Ana Bertha Lepe and Lorena Velázquez, both of whom were crowned Miss Mexico before embarking on acting careers, THE SHIP OF MONSTERS represents an incredible snapshot of an industry at the height of its creative powers.\n\nLepe and Velázquez play Gamma and Beta, two Venusian women who are sent on a mission to collect male specimens from across the universe in order to repopulate their planet. Along with their robot servant, Tor, they will traverse the length of the galaxy collecting some of the most unusual characters on their ship — from a singing cowboy to Tagual, the Martian prince! Did I also mention the musical numbers?\n\nTurning American science fiction conventions on their head, THE SHIP OF MONSTERS is a breath of fresh air, skillfully blending several genres including sci-fi, western, and horror while always keeping an eye on the entertainment factor. Despite its low budget, it's hard not to be enchanted by the skillful charm and endless kinetic energy of this escapist adventure.\n\nClever and ridiculous in equal measure, THE SHIP OF MONSTERS represents Mexican cinema like we don't often see: fully aware of its own identity and ready to win over any cynical audience member with endless invention. Do not miss the opportunity to discover a new side to Mexican sci-fi, and embark on a journey with fellow audience members across the galaxy in search of the most fascinating characters you'll meet all fest long. (EVRIM ERSOY)",
    "directors": [
        "Rogelio A. González"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-ship-of-monsters"
    },
    "runtime": 81,
    "synopsis": "Two Venusian women and their robot servant are on a mission to find suitable candidates to repopulate their planet. Soon their ship is filled with bizarre specimens from across the universe, leading to an adventure like no other!",
    "title": "The Ship of Monsters",
    "year": 1960
}