{
    "countries": [
        "Romania"
    ],
    "description": "You love a good noir? You want twists? Turns? Beautiful femmes fatales? Epic shootouts? Snitches? Exotic Mediterranean scenic beauty? Laughs? Intrigue? An epic love story? Opera? Friends, THE WHISTLERS is the film for you. It blew audiences away this year at Cannes, and it's one of the best crime thrillers in recent memory.\n\nTHE WHISTLERS starts with poker-faced, middle-aged cop Cristi (Vlad Ivanov) coming to the island of Gomera. He's been seduced into the trip by Gilda (an incredible Catrinel Marlon) to help wealthy criminal Zsolt escape from prison. Knowing Cristi's corrupt, his superiors have tapped his phone, forcing him to learn the language of the island's criminal underground: silbo whistling. Created to communicate without discovery, the whistles transmit simple phrases and sentences over distance, indistinguishable from bird song.\n\nTHE WHISTLERS keeps layering the narrative by throwing a new twist or turn at the audience every ten minutes, and you might have some trouble keeping up. The film's narrative becomes almost comically dense, but you'll recognize these tropes if you've seen Hollywood noir classics like THE MALTESE FALCON and CRISS CROSS. Cristi is in love with Gilda and desperate for the wealth that will provide for a better life. His partners in crime are only interested in getting out alive with as much cash as possible, and Cristi's superiors want him caught, dead or both. Gilda? She's the femme fatale so her motives are naturally known only to her. If all this backstabbing gets confusing, all you really need to know is that no one can be trusted. While your head may be spinning, you'll also be smiling as the film breezes by. (JAMES EMANUEL SHAPIRO)",
    "directors": [
        "Corneliu Porumboiu"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-whistlers"
    },
    "runtime": 97,
    "synopsis": "Corneliu Porumboiu mixes Romanian New Wave with Hollywood noir beats as he follows a corrupt detective who helps a wealthy criminal escape from jail by learning the ancient, secret language of silbo whistling.",
    "title": "The Whistlers",
    "year": 2019
}