{
    "countries": [
        "United States"
    ],
    "description": "In this age where countless people spend their time watching streaming celebrities rather than television or movies, it's easy to see how Reverend Max (Ryan Guzman, STEP UP REVOLUTION; EVERYBODY WANTS SOME) and his best friend Drew (Kyle Gallner, VERONICA MARS; JENNIFER'S BODY) can make a hefty living with their live exorcisms. Their worldwide audiences aren't aware that their show is actually a well-staged fraud, but that doesn't matter: they're doing good business hawking their wares to their fans. Any concerns about authenticity are an afterthought at best.\n\nOne night, Drew's fiancée Lane (Alix Angelis, THE MAGNIFICENT SEVEN) chooses to sit in the hot seat and have an exorcism \"performed\" to free her of demonic possession. Unfortunately for her and the entire crew of the show, this is the evening a particularly evil and vengeful demon visits and actually does possess Lane. A demon who is hell-bent not just on torturing them, but exposing their deception to their fans — which coincidentally is also gaining them a larger audience by the minute.\n\nDirector Damien LeVeck and his co-writer Aaron Horwitz have adapted their original short film into a rollicking midnighter. Not only are they exposing Internet culture's hollow view of what is and isn't real, but they're doing it with a cleverly developed concept. Each scene builds upon what came before, delivering a steady stream of exciting, shocking moments.\n\nTHE CLEANSING HOUR is a rollercoaster of a horror film, with clearly defined rules, wicked CGI, practical effects, and thrilling performances from its talented cast. Strap yourself in, grab your prayer towel, and get ready to save the souls of the Reverend Max, Drew, and Lane! (NOAH LEE)\n\nWith Director Damien LeVeck in Attendance for 1st half.",
    "directors": [
        "Damien LeVeck"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-cleansing-hour"
    },
    "runtime": 95,
    "synopsis": "Reverend Max and his best friend Drew have a hit web show where they make a pretty good living faking exorcisms for hundreds of thousands of fans until the evening a real demon takes over and terrorizes their crew.",
    "title": "The Cleansing Hour",
    "year": 2019
}