{
    "countries": [
        "Mexico"
    ],
    "description": "An unsung masterpiece of gothic horror, THE BLACK PIT OF DR. M is a tightly plotted and visually intense scarefest that rivals the best of anything being made elsewhere at the time. Director Fernando Méndez and writer Ramón Obón were prolific talents responsible for some of the most interesting genre content coming out of Mexico between the '40s and '60s, including films such as THE BODY SNATCHER (EL LADRÓN DE CADÁVERES) and EL VAMPIRO. Starring Rafael Bertrand who took on a huge variety of roles, including a stint as Zorro in the mid-'60s as well as appearing alongside Boris Karloff in ISLE OF THE SNAKE PEOPLE, there's an abundance of talent here both in front and behind the camera, which explains the end result being such an incredible experience.\n\nDr. Mazali runs an asylum for the criminally insane, but his real interest lies in lifting the veil between this world and the afterlife. With his colleague Doctor Aldama, he makes a pact: whichever doctor dies first will return from the afterlife and share its secrets with the other. However, it won't be long before the doctors discover that the secrets of life and death are not to be trifled with, and the real horror of their existence will dawn on them.\n\nWith masterful performances from the two leads and an incredible use of shadows and light, THE BLACK PIT OF DR. M should easily sit next to the canon of Val Lewton/Jacques Tourneur movies. The electric atmosphere is enhanced by a bombastic score that only works to highlight the beautifully macabre ideas at play. Science vs natural order, the supernatural vs the violence of men, and many more play out in an underseen title that manages to cram more excitement into its brief running time than any four Hollywood films of the time. (EVRIM ERSOY)",
    "directors": [
        "Fernando Méndez"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-black-pit-of-dr-m"
    },
    "runtime": 82,
    "synopsis": "Two doctors make a pact on behalf of science: Whichever one dies first will return to share the secrets of the afterlife. This pact will not end well.",
    "title": "The Black Pit of Dr. M",
    "year": 1959
}