{
    "countries": [
        "United States"
    ],
    "description": "Martin Krejčí's directorial debut is the kind of wondrous, life-affirming accomplishment that audiences wait decades to experience. Combining his background as a commercial director with a sense of fantasy embedded deep within Czech cinema, he constructs a fairytale world that's enchanting without being mawkish and streaked with an underlying melancholy.\n\nPaul is thirteen, and very aware that he doesn't fit in due to his hypertrichosis (a condition resulting in an abnormal amount of hair growth over the body). All he wants to do is hide and be left alone. When an unexpected package from his mother combines with a failed birthday party with his dad, Paul sets out on an unusual journey alongside unique characters to places previously unimagined.\n\nEmotionally astute and sensitively constructed, THE TRUE ADVENTURES OF WOLFBOY tackles tolerance and acceptance without being preachy. It captures the magic of childhood without ever becoming whimsical and — most importantly — connects the audience with a roster of characters that are hard to forget. Featuring Jaeden Martell as Paul, John Turturro as a somewhat devilish fairground owner, and Sophie Giannamore as the unbelievably mesmerizing Adriana, the film is blessed with incredible performances from every member of the cast.\n\nFrom the exquisite hand-drawn chapter cards that accentuate the journey, to Olivia Dufault's incredibly crafted script, every aspect of THE TRUE ADVENTURES OF WOLFBOY feels magical. Clearly a project of love and dedication, it's the kind of title that will capture the imagination of the Fantastic Fest audience like no other in the line-up. (EVRIM ERSOY)\n\nWith Director Martin Krejčí in Attendance for 1st half.",
    "directors": [
        "Martin Krejčí"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/the-true-adventures-of-wolfboy"
    },
    "runtime": 88,
    "synopsis": "Suffering from hypertrichosis — which covers him with animal-like fur — Paul knows he's not like other kids. But a seemingly random package from his estranged mother will send him on a journey of self-discovery alongside extraordinary characters.",
    "title": "The True Adventures of Wolfboy",
    "year": 2019
}