{
    "countries": [
        "Mexico"
    ],
    "description": "Ah, there's nothing like a Mexican summer to make you grab a few beers, fewer friends, and head out to a picturesque mountain range to massacre grizzly bears. If that sentence made you say, \"Whu-whu-WHA?!,\" then you should know that things only slide further into the savage vortex of non-reality from there.\n\nThe home video era hit the independent film world with tornado force, creating an overnight market where the most outrageous, bizarre, and anti-human concepts could find an audience regardless of their budgets. Suddenly, rental store shelves were downright jam-packed with straight-to-VHS features that redefined viewing forever. This creative explosion hit hardest in the horror genre, and nowhere was it more inventive than in Latin America. Mexican VCRs in the mid-'80s through early '90s ran on a steady diet of new wave witchcraft, satanic clown dolls, and manic cocaine vampires. Looming tall above them all stood TRAMPA INFERNAL's blade-fisted, mannequin-faced, uzi-toting psychopath chillingly named… Jesse?!\n\nYep, that's right. And nothing pisses Jesse off more than when the drunken antics of big city bear hunters wake him from his comfy cave nap. Soon, he's off on a subhuman, grenade-lobbing rampage through the winding rural roads, laying waste to every man, woman and minivan in his way. He's a bona fide homicide machine, equal parts Freddy Krueger, Jason Voorhees, Grizzly Adams, Ken doll, and that guy who's currently whistling under the bench at your local bus stop. In fact, the only thing in the world that's less sane than Jesse is EVERYTHING ELSE ABOUT TRAMPA INFERNAL. If you hate fun, be sure to miss this screening! (ZACK CARLSON)",
    "directors": [
        "Pedro Galindo III"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/trampa-infernal"
    },
    "runtime": 77,
    "synopsis": "In Mexico's most notorious unseen video-era masterblast, a crew of toxically masculine bear murderers runs afoul of a forest-dwelling war veteran wearing a mannequin mask and Freddy Krueger glove. Entertainment ensues!!",
    "title": "Trampa Infernal",
    "year": 1989
}