{
    "countries": [
        "United States"
    ],
    "description": "Like the best assault films, Joe Begos' latest puts a bunch of likable characters in a contained space, inserts an element that puts them in danger, and then sits back while the shit hits the fan. For VFW, the \"likable characters\" are faces we all know and love: Stephen Lang, William Sadler, David Patrick Kelly, George Wendt, Martin Kove, and Fred Williamson. Friends who served together in Vietnam, they've come together for Fred's (Stephen Lang) birthday, and tonight, after the bar closes, they're taking him out on the town.\n\nAnd here's where the trouble starts: America is in the shitter thanks to a new drug called Hype that's turned the country into a John Carpenter-like war zone. The users are beyond addicts — they're punk mutants, subhuman and rabid without their fix. Naturally, the local drug lord Boz (Travis Hammer) has chosen to hole up across the street from the VFW. When his stash is stolen by a woman named Lizard who then takes shelter with our old crew, Boz sets loose his army of addicted animals to bring back the Hype by any means necessary.\n\nBegos' VFW is no foreign war. This is an all-out bloody rampage in the main characters' home away from home. This is their turf, and once Lizard finds haven there, they will defend it and her with all the skills and training Vietnam gave them. When the blood starts spraying and the guts start flying, Begos continues to make good on the promise of ALMOST HUMAN and THE MIND'S EYE by delivering visceral and exciting action and violence. With VFW, Begos has a cast worthy of the time needed to make us care about them. This is an adrenaline-fueled love letter that we all can embrace. (JAMES EMANUEL SHAPIRO)\n\nWith Director Joe Begos and Actors Jesse Kove, Travis Hammer, Stephen Lang, Bill Sadler, Martin Kove, David Patrick Kelly, and Tom Williamson in Attendance for 1st half.",
    "directors": [
        "Joe Begos"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/vfw"
    },
    "runtime": 92,
    "synopsis": "In the near future, a new drug called Hype has turned America into a war zone. The addicted are more mutant than human, and they've set their sights on assaulting a VFW post in Joe Begos' star-studded latest.",
    "title": "Vfw",
    "year": 2019
}