{
    "countries": [
        "Ireland",
        "Belgium",
        "Denmark"
    ],
    "description": "Gemma and Tom live simple, working class lives as an elementary school teacher and a landscaper, respectively. Unmarried, childless, and young, they're nonetheless willing to explore the idea of suburban life in the Yonder housing complex, especially if it's really as affordable and fulfilling as advertised.\n\nThey decide to tour of one of the available homes with their peculiarly proper realtor. Taking in the endless line of identical green houses with awkward floorplans and a photo of the house itself on the mantelpiece, Gemma and Tom can immediately tell this world is not for them. Still, they politely go through the motions of the tour until their realtor disappears, along with their ability to leave the development.\n\nWhat follows is a dizzying, inescapable game of Life, complete with the requisite checkpoints of homemaking and child rearing. It's within these confines that Gemma and Tom must try to forge a meaningful existence. Can their love for each other survive this ultimate test of domestic \"bliss\"?\n\nDirector Lorcan Finnegan (WITHOUT NAME) delves deep into the concept of the American Dream, exploring major questions about happiness and life's true purpose. The sharply written script deftly alternates between painfully funny and haunting. It's an uneasy ride through an initially familiar world made all the more striking through spectacular, uncanny production design in the vein of EDWARD SCISSORHANDS and BLUE VELVET.\n\nWith bold lead performances by the always expressionistic Imogen Poots and an idiosyncratic Jesse Eisenberg, VIVARIUM is an epic, unforgettable descent into the hell of living a life devoid of freedom and choice. (LOGAN TAYLOR)",
    "directors": [
        "Lorcan Finnegan"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/vivarium"
    },
    "runtime": 98,
    "synopsis": "When young couple Gemma (Imogen Poots) and Tom (Jesse Eisenberg) drive out to a maze of temptingly affordable houses in the suburbs, they find themselves unable to leave.",
    "title": "Vivarium",
    "year": 2019
}