{
    "countries": [
        "United States"
    ],
    "description": "Back in 2014, a video appeared on the Internet and took it by storm. This terrifying, blurry CCTV footage shows a young girl sleeping in her bed when the storage drawer under it begins to open. As the choppy footage continues, we see crawling out the freakiest clown you could imagine. Dressed in a red polka dot outfit, with dark gloves and a wrinkly, white, semi balding mask with deep, dark holes where eyes should be, the figure stands and stares at the girl, then proceeds to turn straight towards the camera, grasp it, and shut it off.\n\nLatching onto the fear center of parents everywhere, this footage and other unsettling videos became a viral sensation, garnering jokes from late night talk hosts, an interview on a local NBC station, and quickly becoming a real-life urban legend. Soon after, people in Naples, Florida were able to hire — via Craigslist and from stickers around town — this clown, now known as Wrinkles, to terrify their children into behaving. A call to his gravelly voicemail, perhaps images of Wrinkles, or even just the knowledge of his existence are sometimes enough to threaten kids onto the path of righteousness.\n\nDirector Michael Beach Nichols, who previously scared audiences with his documentary on the attempted takeover of a small town by white supremacists in WELCOME TO LEITH, returns for another fascinating deep dive into the cultural phenomena of coulrophobia, or fear of clowns. Nichols doesn't just follow and talk to Wrinkles himself, but excavates the history of clowns in horror media and how the appearance of Wrinkles has acted as a catalyst for a widespread fear of clowns in the public consciousness, prompting copycats to pop up in other cities throughout the United States.\n\nWRINKLES THE CLOWN is a fascinating look at one man's development into his own legend and much, much more. If you suffer from coulrophobia, WRINKLES isn't going to help, but make sure you watch it anyway, or you may find a clown hiding in your closet at night, ready to pounce! (NOAH LEE)\n\nWith Director Michael Beach Nichols and Editor Christopher Walker in Attendance for 1st half.",
    "directors": [
        "Michael Beach Nichols"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/wrinkles-the-clown"
    },
    "runtime": 78,
    "synopsis": "Pennywise isn't real. But Wrinkles is. This documentary explores the story of the infamous freaky clown from Naples, Florida who makes a living being hired by parents to terrorize their naughty children.",
    "title": "Wrinkles the Clown",
    "year": 2019
}