{
    "countries": [
        "United States"
    ],
    "description": "The Whitners are a strange family dealing with the aftermath of the death of their oldest son, Dylan. Mrs. Whitner is off on a thousand-mile trail trek, Mr. Whitner spends most of his time at work or in the bathroom, and twins Myrcella and Wyrm are basically being raised by their Uncle Chet. Myrcella and Wyrm also happen to be two of the last kids in their grade to pass their level one sexuality requirement: a school-mandated program enforced by electronic collars that detach when the wearer kisses someone. But when Wyrm hears Myrcella has just made out with the foreign exchange kid, it leaves him as the only one still waiting to pop his collar. And because of the No Child Left Alone program, if he doesn't pop it soon he won't be able to move on to the next grade — not to mention the fact that the damn collar will still be on. Running out of time and frustrated with his sister's snotty sense of superiority and self-righteousness, Wyrm tries everything he can think of to find someone to kiss, move on, and grow up.\n\nWriter/director Christopher Winterbauer has crafted a truly impressive debut feature. Working from his Sundance-selected short of the same name, Winterbauer, along with badass production designer Melanie Jones, has built an incredibly detailed, occasionally lo-fi, analog-heavy world reminiscent of an alternative 1990s. It's recognizable and easily relatable, but just slightly foreign in a way that immediately pulls you in and piques your curiosity. The performances, particularly from Azure Brandi as Myrcella and Theo Taplitz in the title role, are confident and assured and really sell the awkwardness and insecurity of adolescence. It sounds a little trite to call it a coming-of-age story, and it's certainly on a different wavelength than most movies with that theme. It's an odd mix of family drama, sci-fi, and super-dry dark comedy — like the strange, slickly-made lovechild of Yorgos Lanthimos and Todd Solondz. WYRM is funny and sad, heartbreaking and heartwarming, a fascinating and wholly unique discovery. (LUKE MULLEN)\n\nWith Director Christopher Winterbauer in Attendance for 1st half.",
    "directors": [
        "Christopher Winterbauer"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/wyrm"
    },
    "runtime": 106,
    "synopsis": "In a strangely futuristic yet analog alternate universe, a lonely, dinosaur-obsessed youth struggles to complete a unique school requirement or risk being held back and enduring a lifetime of embarrassment.",
    "title": "Wyrm",
    "year": 2019
}