{
    "countries": [
        "United States"
    ],
    "description": "In a filmography that includes such widely loved and studied mainstream films as ROBOCOP, TOTAL RECALL, and STARSHIP TROOPERS, Paul Verhoeven's 1995 film SHOWGIRLS — the first and only NC-17 movie to get a wide release in the US — stands as one of his most confusing, often maligned, and misunderstood (if you're to believe some of the pundits in YOU DON'T NOMI). Exploring the new life it has found years after its Razzies sweep (where Verhoeven was the first person ever to accept a Razzie award in person), YOU DON'T NOMI is a striking rumination on a movie and a career that has come to mean many things to different people.\n\nThere are no talking heads in YOU DON'T NOMI. Instead, various experts and critics — from IT DOESN'T SUCK: SHOWGIRLS author Adam Nayman, to film critic Barbara Shulgasser who dismisses the film as \"garbage by a great director\" — present the gamut of takes on the film and its continued legacy, while writer/director/editor Jeffrey McHale expertly weaves together clips of SHOWGIRLS and Verhoeven's other work. Exploring the film's evolving status in the zeitgeist, McHale touches on its surprising and unintended impact, like the success of April Kidwell who has worked through past trauma by portraying Elizabeth Berkley in BAYSIDE! THE MUSICAL! and SHOWGIRLS! THE MUSICAL!\n\nThe result is a sometimes dreamlike and always riveting journey through the themes and motifs that have shaped Verhoeven's work and birthed the perverse and audacious mystery that is SHOWGIRLS. (BRIAN KELLEY)\n\nWith Director Jeffrey McHale in Attendance for 1st half.",
    "directors": [
        "Jeffrey McHale"
    ],
    "meta": {
        "source_url": "https://fantasticfest.com/films/you-dont-nomi"
    },
    "runtime": 94,
    "synopsis": "Using cleverly edited clips of Paul Verhoeven's genre-spanning filmography, Jeffrey McHale's video essay explores the decidedly un-titillating and delightfully inexplicable SHOWGIRLS and its continued, ever-expanding legacy.",
    "title": "You Don't Nomi",
    "year": 2019
}